#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область НастройкиОбменаБСП

// Заполняет настройки, влияющие на использование плана обмена.
//
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию,
//                          см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт

	Настройки.ИмяКонфигурацииИсточника = Метаданные.Имя;
	Настройки.ИмяКонфигурацииПриемника.Вставить("БухгалтерияПредприятияКОРП");
	Настройки.ИмяКонфигурацииПриемника.Вставить("БухгалтерияПредприятия");
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Ложь;
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена = Ложь;
	Настройки.Алгоритмы.ПриПолученииВариантовНастроекОбмена = Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;

КонецПроцедуры

// Заполняет коллекцию вариантов настроек плана обмена.
//
Процедура ПриПолученииВариантовНастроекОбмена(ВариантыНастроекОбмена, ПараметрыКонтекста) Экспорт

	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки = "";
	ВариантНастройки.КорреспондентВМоделиСервиса = Ложь;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;

КонецПроцедуры

// Заполняет описание варианта настройки обмена.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт

	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "БухгалтерияПредприятияКОРП";
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = "Настройки обмена Консолидация БП-УХ";
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = 'Бухгалтерия предприятия КОРП'");
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ИспользуемыеТранспортыСообщенийОбмена();
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru = 'Консолидация: Бухгалтерия предприятия'");
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = КраткаяИнформацияПоОбмену();
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "";
	ОписаниеВарианта.ОбщиеДанныеУзлов = ОбщиеДанныеУзлов();
	ОписаниеВарианта.ПоддерживаетсяСопоставлениеДанных = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуемыеТранспортыСообщенийОбмена()

	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FTP);
	Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.COM);
	Возврат Результат;

КонецФункции

Функция ОбщиеДанныеУзлов()

	Возврат "ДатаНачалаВыгрузкиДокументов,ИспользоватьОтборПоОрганизациям,Организации,РежимВыгрузкиПриНеобходимости";

КонецФункции

Функция КраткаяИнформацияПоОбмену()

	Возврат НСтр("ru = 'Позволяет загружать данные консолидации из баз 1С:Бухгалтерия предприятия в Управление холдингом.
	|Используется классический обмен с правилами конвертации. Направление основной передачи: БП → УХ.'");

КонецФункции

#КонецОбласти

#КонецЕсли
