
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипИсточника = Параметры.ТипИсточника;
	АдресХранилищаТаблицыРеквизитов = Параметры.АдресХранилищаТаблицыРеквизитов;
	ЗаполнитьТаблицуРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ПолучитьАдресХранилищаТаблицыРеквизитов());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитов()
	
	НастройкиРеквизитов = ПолучитьИзВременногоХранилища(АдресХранилищаТаблицыРеквизитов);
	
	Для каждого ТекСтрока Из НастройкиРеквизитов Цикл
		Если ТекСтрока.Предопределенный Тогда
			НовСтрока = ТаблицаРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			НовСтрока.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекРеквизит Из Метаданные.НайтиПоПолномуИмени(ТипИсточника).Реквизиты Цикл
		НовСтрока = ТаблицаРеквизитов.Добавить();
		НовСтрока.ИмяРеквизита = ТекРеквизит.Имя;
		НайденныеСтроки = НастройкиРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ТекРеквизит.Имя));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НовСтрока.Пометка = Истина;
			НовСтрока.ОтборПоРеквизиту = НайденныеСтроки[0].ОтборПоРеквизиту;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилищаТаблицыРеквизитов()
	
	НастройкиРеквизитов = ТаблицаРеквизитов.Выгрузить(Новый Структура("Пометка", Истина));
	Возврат ПоместитьВоВременноеХранилище(НастройкиРеквизитов);
	
КонецФункции

