&НаКлиенте
Процедура ПередатьДанные(Команда)
	Источник = Неопределено;
	Приемник = Неопределено;
	
	Для Каждого Стр Из Формы Цикл
		Если Стр.Выход Тогда
			Источник  = Стр; 
			ПараметрыФ = Стр.Параметры;
		КонецЕсли;
		Если Стр.Вход Тогда
			Приемник = Стр;
		КонецЕсли;
	КонецЦикла;
	
	Если Источник = Неопределено
	 Или Приемник = Неопределено
	Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ФормаОбработки = ПолучитьФорму("Обработка." + Источник.Имя + ".Форма");
	Исключение
		Предупреждение("Источник: Ошибка открытия формы" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Попытка
		
		//Данные = Выполнить("ФормаОбработки." + Источник.Функция);
		//Если   Источник.Имя = "COMВыборка" Тогда
		ОргИД = Неопределено; 
		Период= Неопределено; 
		СчетКод="";   
		Режим="Разница"; 
		Результат = "Выборка";
		Лево = Истина;
		Право = Истина;
		Сообщать = Ложь;
			
		Данные =        Вычислить("ФормаОбработки." +Источник.Функция+ПараметрыФ);//"()");
			//Данные = ФормаОбработки.Обороты();
			
		//ИначеЕсли Источник.Имя = "ПоискГУИДОВиОбъектов" Тогда 
		//	
		//		Данные = ФормаОбработки.ОтчетТипыДанныхНаСервереФ();
		//	
		//КонецЕсли;
		//
				//Данные = ФормаОбработки.Выборка(Ложь,"РегистрыСведений","ДанныеДляПодбораСотрудников",,,);
	
		//ФормаОбработки.Выборка(Ложь,"Справочники","БанковскиеСчета",,,"Владелец=Справочники.Контрагенты,Владелец=Справочники.Организации");
		//Данные = ФормаОбработки.ФункцияМ();
		//"Владелец=Справочники.Контрагенты,Владелец=Справочники.Организации)");   
		//Функция Выборка(Внешняя, Тип, Вид, РеквОрг = Неопределено, ОргИД = Неопределено, Рекурсия = Неопределено, ТолькоПосчитать = Ложь, Внутр = Ложь,
		//	АдаптироватьПоСоответствиям = Истина) Экспорт
	Исключение
		ПоказатьПредупреждение(,"Источник: Ошибка вызова функции" + Символы.ПС + ОписаниеОшибки());
		//Предупреждение("Источник: Ошибка вызова функции" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка
		ФормаОбработки = ПолучитьФорму("Обработка." + Приемник.Имя + ".Форма");
	Исключение
		Предупреждение("Приемник: Ошибка открытия формы" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Попытка
		Выполнить("ФормаОбработки." + Приемник.Функция + "(Данные)");
	Исключение
		Предупреждение("Приемник: Ошибка вызова функции" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ФормыГалкиПриИзменении(Элемент)
	Для Каждого Стр Из Формы Цикл
		Если Стр.ПолучитьИдентификатор() <> Элементы.Формы.ТекущаяСтрока Тогда
			Стр[СтрЗаменить(Элемент.Имя, "Формы", "")] = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНаФормуОбработки(Команда)  
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("НачатьВыборФайла", ЭтаФорма));
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);  
	
	СобытиеЖР ="Загрузка эксель";	
	
	ОбработататьНаСервереДвДанные(ДвоичныеДанные, "xlsx",СобытиеЖР);
    
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыборЗавершения", ЭтотОбъект,ВыбранноеИмяФайла),
	"Выполнено",РежимДиалогаВопрос.ОК);
	
КонецПроцедуры 



&НаСервере
Процедура ОбработататьНаСервереДвДанные(ДвоичныеДанные, ТипФайла,СобытиеЖР)
	
	ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(ТипФайла);
	ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ТвояОбласть    = ТабличныйДокумент.ПолучитьОбласть();
	
	Формы.Очистить(); 
	
	Для к = 2 По ТвояОбласть.ВысотаТаблицы   Цикл 
		 НоваяСтрока = Формы.Добавить();   
		 НоваяСтрока.Имя     = ТвояОбласть.Область(к,1,к,1).Текст;
		 НоваяСтрока.Функция = ТвояОбласть.Область(к,2,к,2).Текст;
		 НоваяСтрока.Выход   = ТвояОбласть.Область(к,3,к,3).Текст;
		 НоваяСтрока.Вход    = ТвояОбласть.Область(к,4,к,4).Текст;
		 
	КонецЦикла;
	
	УдалитьФайлы(ФайлEXCELНаСервере);
	//

КонецПроцедуры 


&НаКлиенте
Процедура ВыборЗавершения(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		
	КонецЕсли;	
КонецПроцедуры
