
&НаКлиенте
Процедура ПолучитьОбъект(Команда)
	
	ПолучитьОбъектКлиент()
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбъектКлиент()
	
	СтруктураПараметров = Новый Структура("НайденныеОбъекты, БитаяСсылка, ГУИД, СписокОбъектов", НайденныеОбъекты, БитаяСсылка, ГУИД,СписокОбъектов);
	
	ПолучитьОбъектНаСервере(СтруктураПараметров);
	
	КопироватьДанныеФормы(СтруктураПараметров.НайденныеОбъекты, НайденныеОбъекты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров, "БитаяСсылка, ГУИД"); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьОбъектНаСервере(СтруктураПараметров)
	
	НайденныеОбъектыТЗ 	= ДанныеФормыВЗначение(СтруктураПараметров.НайденныеОбъекты, Тип("ТаблицаЗначений"));
	ГУИД 				= СтруктураПараметров.ГУИД;
	БитаяСсылка 		= СтруктураПараметров.БитаяСсылка;
	СписокОбъектов      = СтруктураПараметров.СписокОбъектов;
	
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	МассивЗначений = Новый Массив;
	НайденныеОбъектыТЗ.Очистить();
	
	Для к = 1 По ТвояОбласть.ВысотаТаблицы   Цикл
		Сообщить(ТвояОбласть.Область(к,1,к,1).Текст);
		
		СтрокаПоиска 		= ТвояОбласть.Область(к,1,к,1).Текст;
		Если СтрНайти(СтрокаПоиска,"<Объект не найден> (")>0  Тогда
			БитаяСсылка =   СтрокаПоиска;
		Иначе 	
			БитаяСсылка = "";
			ГУИД =  СтрокаПоиска;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(БитаяСсылка) Тогда 
			ГУИДУдОбъкта = СокрЛП(БитаяСсылка);
			
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъкта,"<Объект не найден> (","");
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,")","");
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,"0x","");
			ГУИДУдОбъктаСтр = Сред(ГУИДУдОбъктаСтр, Найти(ГУИДУдОбъктаСтр,":")+1, СтрДлина(ГУИДУдОбъктаСтр));
			// Преобразуем GUID
			ГУИД = Сред(ГУИДУдОбъктаСтр,25,8)+"-"+Сред(ГУИДУдОбъктаСтр,21,4)+"-"+Сред(ГУИДУдОбъктаСтр,17,4)+"-"+Сред(ГУИДУдОбъктаСтр,1,4)+"-"+Сред(ГУИДУдОбъктаСтр,5,12);			
			//и получаем ГУИД = 05dbe824-a4c6-11dd-bf56-00145e3710ab    
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГУИД) Тогда
			
			УИ = Новый УникальныйИдентификатор(ГУИД);
			// все объекты по которым можно получить ссылку
			ПолучитьСсылкуНоМенеджеруОбъекта(Справочники,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(Документы,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(ПланыВидовХарактеристик,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(ПланыСчетов,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(ПланыОбмена,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(БизнесПроцессы,УИ, НайденныеОбъектыТЗ);
			ПолучитьСсылкуНоМенеджеруОбъекта(Задачи,УИ, НайденныеОбъектыТЗ);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(НайденныеОбъектыТЗ, СтруктураПараметров.НайденныеОбъекты);
	СтруктураПараметров.ГУИД = ГУИД;
	СтруктураПараметров.БитаяСсылка = БитаяСсылка;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНоМенеджеруОбъекта(ОбъектыМенеджер,УникальныйИдентификатор, НайденныеОбъекты)
	
	Для Каждого Менеджер Из ОбъектыМенеджер Цикл
		НайденныйОбъект = Менеджер.ПолучитьСсылку(УникальныйИдентификатор);
		
		Если НайденныйОбъект.ПолучитьОбъект() <> Неопределено Тогда
			
			СтрокаТЗ = НайденныеОбъекты.Добавить();
			СтрокаТЗ.Объект = НайденныйОбъект;
			
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;	
	
КонецФункции

&НаКлиенте
Процедура ПолеБитаяСсылкаПриИзменении(Элемент)
	
	ПолучитьОбъектКлиент()
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьГУИД(Команда)
	ПолучитьГУИДСервер();
КонецПроцедуры

&НаСервере
Процедура ПолучитьГУИДСервер()
	//ГУИД = НайденныеОбъекты[0].Объект.УникальныйИдентификатор ();
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=1;
	Для каждого эл  Из НайденныеОбъекты  Цикл
		ГУИД = эл.Объект.УникальныйИдентификатор ();
		ТвояОбласть.Область(к,1,к,1).Текст =  ГУИД;
		к=к+1;
	КонецЦикла;
	СписокОбъектов.Вывести(ТвояОбласть);
КонецПроцедуры // ПолучитьГУИДСервер()

&НаКлиенте
Функция ПолучитьРегистраторы() Экспорт
	
	мРез = Новый Массив;
	Для Каждого Эл Из НайденныеОбъекты Цикл
		мРез.Добавить(Эл);
	КонецЦикла;
	
	Возврат мРез;
КонецФункции

&НаКлиенте
Функция ПолучитьНайденныеОбъекты() Экспорт 
	
	мРез = Новый Массив;
	Для Каждого Эл Из НайденныеОбъекты Цикл
		мРез.Добавить(Эл.Объект);
	КонецЦикла;
	
	Возврат мРез;
	
КонецФункции // ПолучитьНайденныеОбъекты()

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	Узел =    ПланОбменаРег.Код;
	Для каждого эл Из НайденныеОбъекты  Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(ПланОбменаРег,эл.Объект);     
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	ЗарегистрироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзДетальнойВедомости(Команда)
	Попытка
		ФормаДВ = ПолучитьФорму("ВнешняяОбработка.ДетальныеВедомости.Форма");
	Исключение
		Предупреждение("Ошибка открытия формы ""Детальные ведомости""" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Для Каждого Рег Из ФормаДВ.ПолучитьРегистраторы() Цикл
		НоваяСтрока = НайденныеОбъекты.Добавить();
		НоваяСтрока.Объект =  Рег;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзОбъектаНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НематериальныеАктивы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НематериальныеАктивы КАК НематериальныеАктивы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НайденныеОбъекты.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока =   НайденныеОбъекты.Добавить();  
		НоваяСтрока.Объект = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзОбъекта(Команда)
	ЗаполнитьИзОбъектаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобратьНоменклатуруНаСервере()
	Док =	Документы.АвансовыйОтчет.НайтиПоНомеру("ТОУХ-000002",Дата('2018.03.01 00:00:00'));
	
	//ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	//НайденныеОбъекты.Очистить();	
	//Для к = 1 По ТвояОбласть.ВысотаТаблицы   Цикл
	//	Сообщить(ТвояОбласть.Область(к,1,к,1).Текст);
	//	
	//	Номенклатура = ТвояОбласть.Область(к,1,к,1).Текст;
	//	НоменклатураКод = ТвояОбласть.Область(к,2,к,2).Текст;	
	//	ВидНоменклатуры	= ТвояОбласть.Область(к,3,к,3).Текст;
	//	НоменклатураПоиск = НайтиНоменклатуруПоКоду(НоменклатураКод);
	//	Если НоменклатураПоиск<>Неопределено Тогда
	//	   Если НоменклатураПоиск.ВидНоменклатуры.Наименование<>ВидНоменклатуры Тогда
	//	   	   НоваяСтрока =  НайденныеОбъекты.Добавить();
	//	       НоваяСтрока.Объект = НоменклатураПоиск;
	//	   КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция НайтиНоменклатуруПоКоду(НоменклатураКод)
	Если не ЗначениеЗаполнено(НоменклатураКод)  Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не Справочники.Номенклатура.НайтиПоКоду(НоменклатураКод).Пустая() Тогда 
		Возврат Справочники.Номенклатура.НайтиПоКоду(НоменклатураКод);	
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиНоменклатуруПоКоду()

&НаКлиенте
Процедура ОтобратьНоменклатуру(Команда)
	ОтобратьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбьектПоГУИДуНаСервере()
	
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=1;
	Для к = 1 По ТвояОбласть.ВысотаТаблицы   Цикл
		ГУИД = ТвояОбласть.Область(к,1,к,1).Текст;
		Идентификатор = Новый УникальныйИдентификатор(ГУИД);
		Ссылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Идентификатор);
		ОбъектПоГуиду = Ссылка.ПолучитьОбъект();
		Если ОбъектПоГуиду = Неопределено Тогда
			ОбъектПоГуиду = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбъектПоГуиду.УстановитьСсылкуНового(Ссылка);
			ОбъектПоГуиду.УстановитьНовыйКод();
			ОбъектПоГуиду.Записать();
			к=к+1;  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбьектПоГУИДу(Команда)
	СоздатьОбьектПоГУИДуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросОборотыНаСервере()
	МассивДляЗагрузки 	= Новый Массив;
	Рез 				= Новый Массив; 
	МассивДляЗагрузкиРС = Новый Массив; 
 
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("НачалоПериода",Период.ДатаНачала);
	ЗапросПараметры.Вставить("КонецПериода",КонецДня(Период.ДатаОкончания));  
	ЗапросПараметры.Вставить("Организация",Организация); 
	//ЗапросПараметры.Вставить("Регистратор",Документы.АвансовыйОтчет.НайтиПоНомеру("ТОУХ-000002",Дата('2018.03.01 00:00:00'))); 
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, , , Организация В ИЕРАРХИИ (&Организация), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Субконто1
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, , , Организация В ИЕРАРХИИ (&Организация), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Субконто2
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, , , Организация В ИЕРАРХИИ (&Организация), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Субконто3
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, , , Организация В ИЕРАРХИИ (&Организация), , ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Регистратор КАК Регистратор
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Регистратор";
	
	
	//мИзмерения = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
	мИзмерения = СтрРазделить("Регистратор",",",Ложь);
	
	Если ВыполнитьЗапросОбщийМодуль Тогда
		 
		Если ВыбратьОбъектНеНайден  Тогда
		     МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайденСервер(ЗапросПараметры,ВыбратьОбъектНеНайден);  
		 Иначе 
			 МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ВыполнитьЗапрос(ЗапросТекст, ЗапросПараметры, мИзмерения);
		КонецЕсли;
		
	Иначе
		МассивДляЗагрузки =	ВыполнитьЗапросОбороты(ЗапросТекст,ЗапросПараметры,мИзмерения); 
		МассивДляЗагрузкиРС = СобратьИзРС(Организация,МассивДляЗагрузкиРС);
	КонецЕсли;
	
	Если Отчет Тогда
		Если МассивДляЗагрузки.Количество()>0  Тогда
			Рез =	  КоличествоОбъектовПоТипу(МассивДляЗагрузки); 	
		КонецЕсли;
		
		СписокОбъектов.Очистить();
		ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
		к=2;
		ТвояОбласть.Область(1,1,1,1).Текст =  "Вид";
		ТвояОбласть.Область(1,2,1,2).Текст =  "Тип";
		ТвояОбласть.Область(1,3,1,3).Текст =  "Иерархия";
		ТвояОбласть.Область(1,4,1,4).Текст = "Владелец";
		ТвояОбласть.Область(1,5,1,5).Текст =  "Организация";
		ТвояОбласть.Область(1,6,1,6).Текст =  "Ссылка";
		
		Для каждого эл  Из Рез  Цикл
			ТвояОбласть.Область(к,1,к,1).Текст =  эл.Вид;
			ТвояОбласть.Область(к,2,к,2).Текст =  эл.Тип;
			ТвояОбласть.Область(к,3,к,3).Текст =  эл.Иерархия;
			ТвояОбласть.Область(к,4,к,4).Текст =  эл.Владелец;
			ТвояОбласть.Область(к,5,к,5).Текст =  эл.Организация;
			ТвояОбласть.Область(к,6,к,6).Текст =  эл.Ссылка;
			к=к+1;
		КонецЦикла;
		
		Для каждого эл Из МассивДляЗагрузкиРС Цикл
			ТвояОбласть.Область(к,1,к,1).Текст =  эл;
			к=к+1;
		КонецЦикла;	
		СписокОбъектов.Вывести(ТвояОбласть);
	КонецЕсли;	
	
	Для каждого эл  Из  МассивДляЗагрузки Цикл
		новаястрока = НайденныеОбъекты.Добавить();
		Если СтрокуВнутр Тогда
			новаястрока.Объект = ЗначениеИзСтрокиВнутр(эл);
		иначе
			новаястрока.Объект = эл;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция КоличествоОбъектовПоТипу(МассивДляЗагрузки)
	
	оОписание = ПолучитьОписаниеТиповДляТаблицыЗначениий();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	сОписание = Новый ОписаниеТипов(МассивТипов);  
	
	бМассивТипов = Новый Массив;
	бМассивТипов.Добавить(Тип("Булево"));
	бОписание = Новый ОписаниеТипов(бМассивТипов);
	
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("Ссылка",оОписание);  
	НоваяТЗ.Колонки.Добавить("Вид",сОписание);
	НоваяТЗ.Колонки.Добавить("Тип",сОписание); 
	НоваяТЗ.Колонки.Добавить("Иерархия",сОписание);
	НоваяТЗ.Колонки.Добавить("Владелец",сОписание); 
	НоваяТЗ.Колонки.Добавить("Организация",бОписание);

	Для Каждого Строка Из МассивДляЗагрузки Цикл 
		СтрокаНоваяТЗ = НоваяТЗ.Добавить();
		СтрокаНоваяТЗ.Ссылка =  Строка;       
		СтрокаНоваяТЗ.Вид 	 = ВидОбъектаПоСсылке(Строка);
		м = Строка.Метаданные(); 
		СтрокаНоваяТЗ.Тип =    м.Имя;
		Дерево = "";
		Владелец = "";	
		ЕстьОрганизация = Ложь;
		
		ТипЗначения = ТипЗнч(Строка);
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения); 
		Если  Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			Если м.Владельцы.Количество()>0 Тогда
				Владелец = "Владелец";
			Иначе
				Владелец = "";	
			КонецЕсли;
			
			Если  м.Иерархический Тогда
				Дерево = "Родитель";  
			Иначе 
				Дерево = "";	
			КонецЕсли;
			СтрокаНоваяТЗ.Иерархия = Дерево;
			СтрокаНоваяТЗ.Владелец = Владелец;  
		КонецЕсли; 
		
		Если  Метаданные.Справочники.Содержит(ОбъектМетаданных) или Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			р = м.Реквизиты;
			ЕстьОрганизация  =     НайтиРеквизитОрганизация(р);
			
			Если ЕстьОрганизация Тогда
				СтрокаНоваяТЗ.Организация = ЕстьОрганизация;  
			Иначе 
				СтрокаНоваяТЗ.Организация = ЕстьОрганизация;  
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСсылок.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(ТаблицаСсылок.Вид КАК СТРОКА(150)) КАК Вид,
	|	ВЫРАЗИТЬ(ТаблицаСсылок.Тип КАК СТРОКА(150)) КАК Тип,
	|	ВЫРАЗИТЬ(ТаблицаСсылок.Иерархия КАК СТРОКА(150)) КАК Иерархия,
	|	ВЫРАЗИТЬ(ТаблицаСсылок.Владелец КАК СТРОКА(150)) КАК Владелец,
	|	ВЫРАЗИТЬ(ТаблицаСсылок.Организация КАК БУЛЕВО) КАК Организация
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаСсылок КАК ТаблицаСсылок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Вид КАК Вид,
	|	ВТ.Тип КАК Тип,
	|	ВТ.Иерархия КАК Иерархия,
	|	ВТ.Владелец КАК Владелец,
	|	ВТ.Организация КАК Организация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.Ссылка) КАК Ссылка
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Вид,
	|	ВТ.Тип,
	|	ВТ.Иерархия,
	|	ВТ.Владелец,
	|	ВТ.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("ТаблицаСсылок",НоваяТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	//МенеджерВТ.Закрыть();
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции // КоличествоОбъектовПоТипу()

&НаСервере
Функция ПолучитьИнформациюКодовТиповПоМетаданным(МассивДляЗагрузки)
 	оОписание = ПолучитьОписаниеТиповДляТаблицыЗначениий();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	сОписание = Новый ОписаниеТипов(МассивТипов);  
	
	бМассивТипов = Новый Массив;
	бМассивТипов.Добавить(Тип("Булево"));
	бОписание = Новый ОписаниеТипов(бМассивТипов);
	
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("Ссылка",оОписание);  
	НоваяТЗ.Колонки.Добавить("Вид",сОписание);
	НоваяТЗ.Колонки.Добавить("Тип",сОписание); 
	НоваяТЗ.Колонки.Добавить("Иерархия",сОписание);
	НоваяТЗ.Колонки.Добавить("Владелец",сОписание); 
	НоваяТЗ.Колонки.Добавить("Организация",бОписание);

	Для Каждого Строка Из МассивДляЗагрузки Цикл 
		
		СтрокаНоваяТЗ = НоваяТЗ.Добавить();
		СтрокаНоваяТЗ.Ссылка =  Строка;       
		СтрокаНоваяТЗ.Вид 	 = ВидОбъектаПоСсылке(Строка);
		м = Строка.Метаданные(); 
		СтрокаНоваяТЗ.Тип =    м.Имя;  
		Пустая = Справочники[м.Имя].ПустаяСсылка();
		Дерево = "";
		Владелец = "";	
		ЕстьОрганизация = Ложь;
	
		
	КонецЦикла;
	
	//МенеджерВТ = Новый МенеджерВременныхТаблиц;
	//
	//Запрос = Новый Запрос;   
	//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаСсылок.Ссылка КАК Ссылка,
	//|	ВЫРАЗИТЬ(ТаблицаСсылок.Вид КАК СТРОКА(150)) КАК Вид,
	//|	ВЫРАЗИТЬ(ТаблицаСсылок.Тип КАК СТРОКА(150)) КАК Тип,
	//|	ВЫРАЗИТЬ(ТаблицаСсылок.Иерархия КАК СТРОКА(150)) КАК Иерархия,
	//|	ВЫРАЗИТЬ(ТаблицаСсылок.Владелец КАК СТРОКА(150)) КАК Владелец,
	//|	ВЫРАЗИТЬ(ТаблицаСсылок.Организация КАК БУЛЕВО) КАК Организация
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	&ТаблицаСсылок КАК ТаблицаСсылок
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Вид КАК Вид,
	//|	ВТ.Тип КАК Тип,
	//|	ВТ.Иерархия КАК Иерархия,
	//|	ВТ.Владелец КАК Владелец,
	//|	ВТ.Организация КАК Организация,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.Ссылка) КАК Ссылка
	//|ИЗ
	//|	ВТ КАК ВТ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ.Вид,
	//|	ВТ.Тип,
	//|	ВТ.Иерархия,
	//|	ВТ.Владелец,
	//|	ВТ.Организация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВТ";
	//
	//Запрос.УстановитьПараметр("ТаблицаСсылок",НоваяТЗ);
	//РезультатЗапроса = Запрос.Выполнить();
	////МенеджерВТ.Закрыть();
	
	//Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗапросОборотыКлиент(Команда)    
	ВыполнитьЗапросОборотыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьВПредставлениеСтрокиНаСервере()
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=1;
	Для каждого эл  Из НайденныеОбъекты  Цикл
		ГУИД = ЗначениеВСтрокуВнутр(эл.Объект);
		ТвояОбласть.Область(к,1,к,1).Текст =  ГУИД;
		к=к+1;
	КонецЦикла;
	СписокОбъектов.Вывести(ТвояОбласть);КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьВПредставлениеСтроки(Команда)
	ПреобразоватьВПредставлениеСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЦТ_ПолучитьПланыОбмена(ПланыОбменаПодсистемы)
	Для Каждого ПланОбмена Из Метаданные.ПланыОбмена Цикл
		Если (    Лев(ПланОбмена.Имя, 3) = "ЦТ_"
			Или Лев(ПланОбмена.Имя, 3) = "КС_")
			И ПланыОбменаПодсистемы.Найти(ПланОбмена) = Неопределено
			Тогда
			ПланыОбменаПодсистемы.Добавить(ПланОбмена);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция Орг(ИД)
	Если      ИД = "" Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	ИначеЕсли ИД = "ДД_ИС" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "339f85b9-e23d-11ec-80db-005056014a17");
	ИначеЕсли ИД = "ДД_МЦП" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "30e6d974-e9a7-11ec-80db-005056014a17");
	ИначеЕсли ИД = "ДД_ТЗ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "9cec02c1-a5cf-11ec-80d8-005056014a17");
	ИначеЕсли ИД = "ДД_ИМ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "d062db69-e513-11ec-80db-005056014a17");
	ИначеЕсли ИД = "ДД_ДД" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "364d726d-9fa4-11ec-80d8-005056014a17");
	ИначеЕсли ИД = "ДД" Тогда
		Рез = Новый Массив;
		Рез.Добавить(Орг("ДД_ИС"));
		Рез.Добавить(Орг("ДД_МЦП"));
		Рез.Добавить(Орг("ДД_ТЗ"));
		Рез.Добавить(Орг("ДД_ИМ"));
		Рез.Добавить(Орг("ДД_ДД"));
		Возврат Рез;
	ИначеЕсли ИД = "ДД+" Тогда
		Рез = Новый Массив;
		Рез.Добавить(Орг("ДД_ИС"));
		Рез.Добавить(Орг("ДД_МЦП"));
		Рез.Добавить(Орг("ДД_ТЗ"));
		Возврат Рез;
	ИначеЕсли ИД = "ОТ" Тогда	
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "73c02013-d82d-11ec-80da-005056014a17");	
	ИначеЕсли ИД = "ТОТ" Тогда	
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "fa5f4157-98d4-11ed-8b1e-7cb27df52e94");
	ИначеЕсли ИД = "ТОТ_К" Тогда	
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), " ");	
	ИначеЕсли ИД = "ДЛГ" Тогда	
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "a5cce63b-bbf8-11ed-8105-005056014a17");	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ВыполнитьЗапрос(ЗапросТекст, ЗапросПараметры, мИзмерения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;
	
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Ключ = ТекПар.Ключ;
		Зн = ТекПар.Значение;
		Если Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда
			//Зн = Орг(Зн);//XMLЗначение(Тип("CatalogRef.Организации"), "fa5f4157-98d4-11ed-8b1e-7cb27df52e94");
			//сообщить(Зн);
		КонецЕсли;       
		//Если Ключ = "КонецПериода" И ТипЗнч(Зн) = Тип("Строка") Тогда
		//	Зн = Дата('2018.01.31 00:00:00');
		//КонецЕсли; 
		//Если Ключ = "НачалоПериода" И ТипЗнч(Зн) = Тип("Строка") Тогда
		//	Зн = Дата('2018.01.01 00:00:00');
		//КонецЕсли;
		
		Запрос.УстановитьПараметр(Ключ, Зн);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из мИзмерения Цикл
			//            Стр.Вставить(Изм, ЗначениеВСтрокуВнутр(Выборка[Изм]));
			//Стр = Стр
			//    + ?(Сч = 0, "", Символы.ПС)
			//    + ЗначениеВСтрокуВнутр(Выборка[Изм])
			//;
			Стр.Добавить(ЗначениеВСтрокуВнутр(Выборка[Изм]));
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла;
	
	Возврат мРезультат;
КонецФункции

&НаСервере
Функция СтрокаИзУИД(ТипСтр, УИД) Экспорт
	Тип = Тип(ТипСтр);
	
	СтрПустое = ЗначениеВСтрокуВнутр(XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000"));
	
	Стр = УИД;
	// 123456789012345678901234567890123456
	// 1435823d-b0b3-11ec-9871-0050568d2260
	// 98710050568d226011ecb0b31435823d
	Стр = ""
	+ Сред(Стр, 20,  4)
	+ Сред(Стр, 25, 12)
	+ Сред(Стр, 15,  4)
	+ Сред(Стр, 10,  4)
	+ Сред(Стр,  1,  8)
	;
	Стр = СтрЗаменить(СтрПустое, "00000000000000000000000000000000", Стр);
	
	Возврат Стр;
КонецФункции

&НаСервере
Функция СтрТипЗнч(ЗнчСтр) Экспорт
	Знч = ЗначениеИзСтрокиВнутр(ЗнчСтр);
	Тип1 = ТипЗнч(Знч);
	Возврат XMLТип(Тип1).ИмяТипа;
КонецФункции

&НаСервере
Функция ВыполнитьЗапросОбороты(ЗапросТекст,ЗапросПараметры,мИзмерения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;		
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Ключ = ТекПар.Ключ;
		Зн = ТекПар.Значение;
		Если Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда
			Зн = Орг(Зн);//XMLЗначение(Тип("CatalogRef.Организации"), "fa5f4157-98d4-11ed-8b1e-7cb27df52e94");
		КонецЕсли;       
		
		Запрос.УстановитьПараметр(Ключ, Зн);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	нСоответствие = Новый Соответствие;
	мРезультат = Новый Массив;
	сч = 0;
	Пока Выборка.Следующий() Цикл
		Для Каждого Изм Из мИзмерения Цикл
			сч = МетаданныеОбъекта(Выборка[Изм],сч,мРезультат);
		КонецЦикла;
		сч=сч+1;
	КонецЦикла;
	
	СвернутыйМассив = Новый Массив;
	Для каждого Элемент Из мРезультат Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Сообщить(СвернутыйМассив.Количество());
	Возврат СвернутыйМассив;
КонецФункции   

&НаСервере
Функция СобратьИзРС(Организация,мРезультатРС)
	КоличествоРС = "Количество";
	Для каждого м Из Метаданные.РегистрыСведений Цикл
				мРеквизиты = м.Реквизиты;
				Дерево = "";
				мВладелец = "";
				
				ЗапросТекст = ""; 
				Если м.Измерения.Найти("Организация") <> неопределено Тогда
					ЗапросТекст = ТекстЗапросаРС("РегистрСведений",м.Имя,"Организация","Количество");
					Запрос	= Новый Запрос; 
					Если Не  ВыбратьОбъектНеНайден Тогда
						Запрос.УстановитьПараметр("Организация",Организация);
					КонецЕсли;
					Запрос.Текст = ЗапросТекст;
					Выборка = Запрос.Выполнить().Выбрать();
					сч = 0;	
					Пока Выборка.Следующий() Цикл  
						//Сообщить(Строка(сч) + " : " + м.Имя +": " +Выборка.Организация);  
						  Если Выборка.Количество <> null  Тогда
						       мРезультатРС.Добавить( "Регистр сведений: "+ м.Имя +", количество объектов: " +Выборка.Количество);
						  КонецЕсли;
						
						//ТвояОбласть.Область(сч,Колонка,сч,Колонка).Текст =  Строка(сч) + " : " + м.Имя +": " +Выборка.Организация;
						//Колонка = Колонка+1;
						//СписокОбъектов.Вывести(ТвояОбласть);
						////НаборЗаписей = РегистрыСведений[м.Имя].СоздатьНаборЗаписей();
						////НаборЗаписей.Отбор["Организация"].Установить(Выборка.Организация);
						////НаборЗаписей.Записывать = Истина;
						////НаборЗаписей.Записать(Истина);
						сч=сч+1;
					КонецЦикла;  
					//тМассив = Запрос.Выполнить().Выгрузить();     
					//Сообщить(""+м.Имя+":"+тМассив.Количество());				
				КонецЕсли; 
			КонецЦикла; 
	
  возврат мРезультатРС; 
  
КонецФункции // СобратьизРС()


&НаСервере
Функция МетаданныеОбъекта(ВыбОбъект,сч,мРезультат)
	сч = МетаданныеРеквизиты(ВыбОбъект,сч,мРезультат);
	
	Если ТипЗнч(ВыбОбъект)=Тип("Число") или ТипЗнч(ВыбОбъект)=Тип("Строка")
		или ТипЗнч(ВыбОбъект)=Тип("Булево") или ТипЗнч(ВыбОбъект)=Тип("Неопределено")
		или ТипЗнч(ВыбОбъект)=Тип("Дата") или ТипЗнч(ВыбОбъект)=Тип("Null")
		или  ТипЗнч(ВыбОбъект)=Тип("ХранилищеЗначения") или ТипЗнч(ВыбОбъект)=Тип("УникальныйИдентификатор")
		Тогда
		Возврат сч;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ВыбОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения); 
	Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Возврат сч;
	КонецЕсли;	
	
	мИменаТЧ  = ВыбОбъект.Метаданные().ТабличныеЧасти;
	Для каждого эл Из  мИменаТЧ Цикл
		Для каждого мСтрокаТЧ Из ВыбОбъект[эл.Имя] Цикл
			Для каждого   мКолонкаТабЧасти Из эл.Реквизиты  Цикл  
				зн = мСтрокаТЧ[мКолонкаТабЧасти.Имя];
				сч = МетаданныеРеквизиты(зн,сч,мРезультат);	
			КонецЦикла;	
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат сч;
КонецФункции // МетаданныеОбъекта()

&НаСервере
Функция МетаданныеРеквизиты(ВыбОбъект,сч,мРезультат)
	Попытка
		Если ТипЗнч(ВыбОбъект)=Тип("Число") или ТипЗнч(ВыбОбъект)=Тип("Строка")
			или ТипЗнч(ВыбОбъект)=Тип("Булево") или ТипЗнч(ВыбОбъект)=Тип("Неопределено")
			или ТипЗнч(ВыбОбъект)=Тип("Дата") или ТипЗнч(ВыбОбъект)=Тип("Null") 
			или  ТипЗнч(ВыбОбъект)=Тип("ХранилищеЗначения") или ТипЗнч(ВыбОбъект)=Тип("УникальныйИдентификатор")
			Тогда
			Возврат сч;
		КонецЕсли;
		ТипЗначения = ТипЗнч(ВыбОбъект);
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения); 
		Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
			Возврат сч;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыбОбъект) Тогда
			Если ВыбратьОбъектНеНайден Тогда
				Если Не СсылкаСуществует(ВыбОбъект) Тогда
					Если СтрокуВнутр Тогда 
						Если мРезультат.Найти(ВыбОбъект) = Неопределено Тогда
							мРезультат.Добавить(ЗначениеВСтрокуВнутр(ВыбОбъект));
							сч= сч+1;	
						КонецЕсли;
					Иначе 
						Если мРезультат.Найти(ВыбОбъект) = Неопределено Тогда
							мРезультат.Добавить(ВыбОбъект);
							сч= сч+1;  
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				Если СтрокуВнутр Тогда
					Если мРезультат.Найти(ВыбОбъект) = Неопределено Тогда
						мРезультат.Добавить(ЗначениеВСтрокуВнутр(ВыбОбъект));
						сч= сч+1; 
					КонецЕсли;
				Иначе 	
					Если мРезультат.Найти(ВыбОбъект) = Неопределено Тогда
						мРезультат.Добавить(ВыбОбъект);
						сч= сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		ВыбМетаданные = ВыбОбъект.Метаданные().Реквизиты;
		Для каждого эл Из ВыбМетаданные Цикл
			ПроверяемыйОбъект = ВыбОбъект[эл.Имя];       //вот это можно запихнуть в рекурсию в эту же функцию
			Попытка
				Если ТипЗнч(ПроверяемыйОбъект)=Тип("Число") или ТипЗнч(ПроверяемыйОбъект)=Тип("Строка")
					или ТипЗнч(ПроверяемыйОбъект)=Тип("Булево") или ТипЗнч(ПроверяемыйОбъект)=Тип("Неопределено")
					или ТипЗнч(ПроверяемыйОбъект)=Тип("Дата") или ТипЗнч(ПроверяемыйОбъект)=Тип("Null")
					или ТипЗнч(ПроверяемыйОбъект)=Тип("ХранилищеЗначения") или ТипЗнч(ПроверяемыйОбъект)=Тип("УникальныйИдентификатор") 
					Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПроверяемыйОбъект) Тогда
					Если ВыбратьОбъектНеНайден Тогда
						Если Не СсылкаСуществует(ПроверяемыйОбъект) Тогда
							Если СтрокуВнутр Тогда  
								Если мРезультат.Найти(ПроверяемыйОбъект) = Неопределено Тогда
									мРезультат.Добавить(ЗначениеВСтрокуВнутр(ПроверяемыйОбъект));
									сч= сч+1; 
								КонецЕсли;
							Иначе 	
								Если мРезультат.Найти(ПроверяемыйОбъект) = Неопределено Тогда
									мРезультат.Добавить(ПроверяемыйОбъект);
									сч= сч+1;   
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					Иначе 
						Если СтрокуВнутр Тогда
							Если мРезультат.Найти(ПроверяемыйОбъект) = Неопределено Тогда
								мРезультат.Добавить(ЗначениеВСтрокуВнутр(ПроверяемыйОбъект));
								сч= сч+1;
							КонецЕсли;
						Иначе 	
							Если мРезультат.Найти(ПроверяемыйОбъект) = Неопределено Тогда
								мРезультат.Добавить(ПроверяемыйОбъект);
								сч= сч+1; 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
				
			КонецПопытки;
		КонецЦикла;   
	Исключение
		
	КонецПопытки;
	Возврат сч; 
КонецФункции // МетаданныеРеквизиты()

&НаСервере
Функция МетаданныеТип(ВыбОбъект)
	ТипМетаданных = "";
	Если ТипЗнч(ВыбОбъект)=Тип("Число") или ТипЗнч(ВыбОбъект)=Тип("Строка")
		или ТипЗнч(ВыбОбъект)=Тип("Булево") или ТипЗнч(ВыбОбъект)=Тип("Неопределено")
		или ТипЗнч(ВыбОбъект)=Тип("Дата") или ТипЗнч(ВыбОбъект)=Тип("Null") 
		или  ТипЗнч(ВыбОбъект)=Тип("ХранилищеЗначения") или ТипЗнч(ВыбОбъект)=Тип("УникальныйИдентификатор")
		Тогда
		Возврат "Неопределено";
	КонецЕсли;
	ТипЗначения = ТипЗнч(ВыбОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения); 
	Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных	= "Перечисление";
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных	= "Справочник";	
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных	= "РегистрСведений";	
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных	= "Документ";	
	КонецЕсли;
	Возврат ТипМетаданных;
КонецФункции
	
&НаСервере
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ПолноеИмя();
	
КонецФункции

&НаСервере
Процедура цМетаданныеНаСервере()
	мРезультатРС = Новый Массив;
    мРезультат = Новый Массив;         

	оОписание = ПолучитьОписаниеТиповДляТаблицыЗначениий();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	сОписание = Новый ОписаниеТипов(МассивТипов);  
	
	бМассивТипов = Новый Массив;
	бМассивТипов.Добавить(Тип("Булево"));
	бОписание = Новый ОписаниеТипов(бМассивТипов);
	
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("Тип",сОписание);  
	НоваяТЗ.Колонки.Добавить("Вид",сОписание);
	НоваяТЗ.Колонки.Добавить("КодУИД",сОписание); 
	НоваяТЗ.Колонки.Добавить("ТипУИД",сОписание);
	НоваяТЗ.Колонки.Добавить("Иерархический",сОписание); 
	НоваяТЗ.Колонки.Добавить("Владелец",бОписание);  
	НоваяТЗ.Колонки.Добавить("Количество",сОписание);


	

	Если ВыполнитьЗапросОбщийМодуль Тогда
		Если РегистрыСведенийСобратьПоМетаданным  Тогда
			   мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервереРС(ВыбратьОбъектНеНайден);
		Иначе 
			   мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервере(ВыбратьОбъектНеНайден);
		КонецЕсли;
	Иначе 
		Если не РегистрыСведенийСобратьПоМетаданным  Тогда
			Для каждого м Из Метаданные.Справочники Цикл
				//Если не  м.Имя = "КлючиАналитикиУчетаЗатрат" Тогда       //тест
				//	 Продолжить;
				//КонецЕсли;
				
				мРеквизиты = м.Реквизиты;
				Дерево = "";
				мВладелец = "";
				Если м.Владельцы.Количество()>0 Тогда
					мВладелец = "Владелец";
				Иначе
					мВладелец = "";
				КонецЕсли;
				Если  м.Иерархический Тогда
					Дерево = "Родитель";  
				Иначе 
					Дерево = "";	
				КонецЕсли;
				
				ЗапросТекст = "";
				ЗапросТекст = ТекстЗапроса("Справочники",м.Имя);
				Запрос	= Новый Запрос;
				Запрос.Текст = ЗапросТекст;
				Выборка = Запрос.Выполнить().Выбрать();

				
				Если ОтчетТипыДанных Тогда
					Пустая = Справочники[м.Имя].ПустаяСсылка();
					Рез = ЗначениеВСтрокуВнутр(Пустая);
					ТипXml = СтрТипЗнч((ЗначениеВСтрокуВнутр(Справочники[м.Имя].ПустаяСсылка())));
					
					Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
					СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
					
					НоваяСтрока = НоваяТЗ.Добавить(); 
					НоваяСтрока.Тип           =  "Справочники";
					НоваяСтрока.Вид           =  ТипXml;
					НоваяСтрока.КодУИД        =  КодУИД;
					НоваяСтрока.ТипУИД        =  ТипУИД;
					НоваяСтрока.Иерархический =  ?(Дерево = "Родитель",Истина,Ложь);
					НоваяСтрока.Владелец      =  ?(мВладелец = "Владелец",Истина,Ложь);   
					НоваяСтрока.Количество    =  Запрос.Выполнить().Выгрузить()[0].Количество;
					
					Продолжить;
				Иначе
					сч = 0;	    
					Пока Выборка.Следующий() Цикл
						Если ПолучитьИерархиюСправочников Тогда
							//Если м.Имя = "БанковскиеСчета" Тогда
							Если  Дерево<>"" Тогда
								мРезультат = ПолучитьРодителяРекурсия(Выборка.Ссылка,мРезультат,м.Имя,Дерево);
								сч=сч+1;                      
							КонецЕсли; 
							Если  мВладелец<>"" Тогда
								мРезультат = ПолучитьРодителяРекурсия(Выборка.Ссылка,мРезультат,м.Имя,мВладелец);
								сч=сч+1;                      
							КонецЕсли;
							
							//КонецЕсли;
						Иначе
							сч = МетаданныеОбъекта(Выборка.Ссылка,сч,мРезультат);
							сч=сч+1;
						КонецЕсли;
					КонецЦикла;
					
					тМассив = Запрос.Выполнить().Выгрузить();     
					Сообщить(""+м.Имя+":"+тМассив.Количество());
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			к = 0;	
			Для каждого м Из Метаданные.РегистрыСведений Цикл
				мРеквизиты = м.Реквизиты;
				Дерево = "";
				мВладелец = "";
				
				Если ПосчитатьКоличествоРС Тогда
					к = к + 1;	
				   Продолжить;
				КонецЕсли;  
				
				НаборЗаписей = РегистрыСведений[м.Имя].СоздатьНаборЗаписей();
				НаборЗаписей.Прочитать();  
				
				Если ОтчетТипыДанных Тогда
					//Пустая = Справочники[м.Имя].ПустаяСсылка();
					//Рез = ЗначениеВСтрокуВнутр(Пустая);
					//ТипXml = СтрТипЗнч((ЗначениеВСтрокуВнутр(Справочники[м.Имя].ПустаяСсылка())));
					//
					//Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
					//СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
					//
					НоваяСтрока = НоваяТЗ.Добавить(); 
					НоваяСтрока.Тип           =  "РегистрСведений";
					НоваяСтрока.Вид           =  м.Имя;
					НоваяСтрока.КодУИД        =  "";
					НоваяСтрока.ТипУИД        =  "";
					НоваяСтрока.Иерархический =  "";
					НоваяСтрока.Владелец      =  "";   
					НоваяСтрока.Количество    = НаборЗаписей.Количество();
					
					Продолжить;
					
				Конецесли;

				
				мИзм = Новый Массив;
				Для каждого эл Из м.Измерения Цикл
				   мИзм.Добавить(эл);
				КонецЦикла;
				
				Для каждого эл Из м.Ресурсы Цикл
				   мИзм.Добавить(эл);
				КонецЦикла;

				Для каждого эл Из м.Реквизиты Цикл
					мИзм.Добавить(эл);
				КонецЦикла;
				
				сч = 0;
				Для каждого эл Из  НаборЗаписей Цикл
					Для каждого стр Из  мИзм Цикл
						сч = МетаданныеОбъекта(эл[стр.имя],сч,мРезультат);
					   сч=сч+1;
					КонецЦикла;
				КонецЦикла;
	 
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	Колонка=1;
	сч = 1;
	Для каждого эл Из мРезультатРС Цикл
		ТвояОбласть.Область(сч,Колонка,сч,Колонка).Текст = эл;
		сч = сч + 1;
	КонецЦикла; 
	СписокОбъектов.Вывести(ТвояОбласть);
	
	СвернутыйМассив = Новый Массив;
	Для каждого Элемент Из мРезультат Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Сообщить("СвернутыйМассив:" + СвернутыйМассив.Количество());
	
	
	//МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайден(ЗапросПараметры);
	Если ОтчетТипыДанных  Тогда   
		//Рез = 	ПолучитьИнформациюКодовТиповПоМетаданным(мРезультат);
	Иначе 	
		НайденныеОбъекты.Очистить();
		Для каждого эл  Из  СвернутыйМассив Цикл
			новаястрока = НайденныеОбъекты.Добавить();
			Если СтрокуВнутр Тогда
				новаястрока.Объект = ЗначениеИзСтрокиВнутр(эл);
			Иначе 
				новаястрока.Объект = эл;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;   
	
		
КонецПроцедуры

&НаСервере
Процедура СтрокаВнутрАнализ(СтрВн, Смв = "", Тип = "", Код = "", УИД = "")
	Смв = ""; Тип = ""; Код = ""; УИД = "";
	
	мСтр = СтрРазделить(Сред(СтрВн, 2, СтрДлина(СтрВн) - 2), ",", Истина);
	КолВо = мСтр.Количество();
	
	Смв = Сред(мСтр[0], 2, 1);
	
	Если КолВо < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Тип = мСтр[1];
	
	Если КолВо < 3 Тогда
		Возврат;
	КонецЕсли;
	
	мКодУИД = СтрРазделить(мСтр[2], ":", Истина);
	Код = мКодУИД[0];
	УИД = мКодУИД[1];
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителяРекурсия(Ссылка,сРодители,Вид,Дерево)
	Тип = "Справочник";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"+Вид+"."+Дерево+" КАК "+Дерево+"
	|ИЗ
	|	"+Тип+"."+Вид+" КАК "+Вид+"
	|ГДЕ
	|	"+Вид+".Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи[Дерево])  Тогда
			Если СтрокуВнутр  Тогда
				сРодители.Добавить(ЗначениеВСтрокуВнутр(ВыборкаДетальныеЗаписи[Дерево]));
			Иначе
				сРодители.Добавить(ВыборкаДетальныеЗаписи[Дерево]); 
			КонецЕсли;  
			Если Дерево = "Родитель"  Тогда
				ПолучитьРодителяРекурсия(ВыборкаДетальныеЗаписи.Родитель,сРодители,Вид,Дерево);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат  сРодители;
	
КонецФункции

&НаСервере
Функция МДИзмерения(Знач Тип, Вид)
	
	мИзмерения = Новый Массив;
	
	Если      Тип = "Константы" Тогда
		//Если Внешняя Тогда // ? Запрос ?
		//	Возврат Подключение.Константы[Вид].Получить();
		//Иначе
		//	Возврат Подключение.Константы[Вид].Получить();
		//КонецЕсли;
	ИначеЕсли Тип = "Справочники" Или Тип = "Документы" Или Тип = "ПланыВидовХарактеристик" Тогда
		мИзмерения.Добавить("Ссылка");
		
	ИначеЕсли Тип = "РегистрыСведений" или Тип = "РегистрСведений" Тогда  
		Тип = "РегистрыСведений";
		#Если НаКлиенте Тогда
			МД = Подключение.Метаданные[Тип][Вид];
			Независимый = Подключение.Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Подключение.Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		#Иначе
			МД = Метаданные[Тип][Вид];
			Независимый = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		#КонецЕсли
		
		Для Каждого ТекИзм Из МД.Измерения Цикл
			Если Тип = "РегистрыСведений" И Не ТекИзм.ОсновнойОтбор Тогда
				Продолжить;
			КонецЕсли;
			мИзмерения.Добавить(ТекИзм.Имя);
		КонецЦикла;
		
		Если Тип = "РегистрыСведений" Тогда
			Если Не МД.РежимЗаписи = Независимый Тогда
				мИзмерения.Добавить("Регистратор");
			КонецЕсли;
			Если МД.ПериодичностьРегистраСведений <> Непериодический Тогда
				мИзмерения.Добавить("Период");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		мИзмерения.Добавить("Регистратор");
		
	ИначеЕсли Тип = "Последовательности" Тогда
		мИзмерения.Добавить("Организация"); // ?
		мИзмерения.Добавить("Регистратор");
		мИзмерения.Добавить("Период");
		мИзмерения.Добавить("МоментВремени");
		мИзмерения.Добавить("СостояниеПроведения");
		
	КонецЕсли;
	
	Возврат мИзмерения;
КонецФункции

&НаСервере
Функция ТекстЗапроса(Тип,Вид)  //количество объектов
	
	Результат = "";    
	
	Если ОтчетТипыДанных  Тогда
	    Результат = "Количество";
	КонецЕсли;
	
	Если Результат = "Количество" Тогда
		мИзмерения = Новый Массив;
		мИзмерения.Добавить("Количество");
	Иначе
		мИзмерения = МДИзмерения(Тип, Вид);
	КонецЕсли;
	//Рез.Вставить("Поля", мИзмерения);
	
	Если Тип = "Справочники" Тогда
		Тип = "Справочник";
	ИначеЕсли Тип = "Документы"  Тогда 
		 Тип = "Документ";
	ИначеЕсли Тип = "РегистрыСведений"  Тогда 
		 Тип = "РегистрСведений";
	КонецЕсли;

	ЗапросТекст = 
	"ВЫБРАТЬ // Первые 100
	|	" + ?(Результат = "Количество", "Сумма(1) КАК Количество", СтрСоединить(мИзмерения, ", ")) + "
	|ИЗ
	|	" + Тип + "." + Вид + "
	|";
	
	ЗапросПараметры = Новый Структура;
	
	//ЗапросТекст = ЗапросТекст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);
	Возврат ЗапросТекст;
	
КонецФункции // ТекстЗапроса()  

&НаСервере
Функция ТекстЗапросаРС(Тип,Вид,Измерение,Результат)
	//Результат = "";
	Если Измерение <> "" Тогда
		мИзмерения = Новый Массив;
		мИзмерения.Добавить(Измерение);
	Иначе
		мИзмерения = МДИзмерения(Тип, Вид);
	КонецЕсли;
	//Рез.Вставить("Поля", мИзмерения);
	 
	Если ВыбратьОбъектНеНайден Тогда
		УсловиеЗапроса = "ГДЕ	"+Вид+".Сотрудник.Код"  + "= &Код
		| и ВидСобытия = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение)";
		//УсловиеЗапроса = "ГДЕ	"+Вид+"." +  СтрСоединить(мИзмерения)+".Наименование ЕСТЬ NULL"; 
	Иначе 	
	   УсловиеЗапроса = "ГДЕ	"+Вид+".Организация"  + "= &Организация"; 
	КонецЕсли;
	
	ЗапросТекст = 
	"ВЫБРАТЬ // Первые 100
	|	" + ?(Результат = "Количество", "Сумма(1) КАК Количество", ""+Вид+"."+ СтрСоединить(мИзмерения, ", ")) + "
	|ИЗ
	|	" + Тип + "." + Вид + " Как "+ Вид +"
	|"+УсловиеЗапроса+"
	|";
	
	ЗапросПараметры = Новый Структура;
	//Рекурсия = "";
	//ЗапросТекст = ЗапросТекст + ЗапросУсловие(Тип, Вид, "Организация", Организация, Рекурсия, ЗапросПараметры);
	Возврат ЗапросТекст;
	
КонецФункции // ТекстЗапроса()

&НаСервере
Функция ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры)
	мУсловие = Новый Массив;
	Если Тип = "РегистрыСведений" И Вид = "СоответствияОбъектовИнформационныхБаз" Тогда
		//мУсловие.Добавить("УзелИнформационнойБазы В (" + ПолучитьКомСоединение().ТекстЗапросаПланОбмена() + ")");
		//Если СоответствияРазные Тогда
		//	мУсловие.Добавить("УникальныйИдентификаторПриемника <> УникальныйИдентификаторИсточникаСтрокой");
		//КонецЕсли;
	КонецЕсли;
	
	Если Тип = "Документы" Тогда
		//Если ЗначениеЗаполнено(ВыборкаПериод) Тогда
		//	мУсловие.Добавить("Дата Между &НачалоПериода И &КонецПериода");
		//	ЗапросПараметры.Вставить("НачалоПериода", ВыборкаПериод.ДатаНачала);
		//	ЗапросПараметры.Вставить("КонецПериода" , КонецДня(ВыборкаПериод.ДатаОкончания));
		//КонецЕсли;
		//Если ВыборкаПроведенные Тогда
		//	мУсловие.Добавить("Проведен");
		//КонецЕсли;
		//Если ВыборкаНеПроведенные Тогда
		//	мУсловие.Добавить("Не Проведен");
		//КонецЕсли;
	КонецЕсли;
	
	
	Если РеквОрг <> Неопределено И РеквОрг <> "" Тогда
		Если ОргИД = "" Тогда
			мУсловие.Добавить(РеквОрг + " = &Организация");
		Иначе
			ПлюсПустая = Ложь;
			Если (Тип = "Справочники" И Вид = "СтатьиЗатрат")
			 Или (Тип = "Справочники" И Вид = "ПрочиеДоходыИРасходы")
			 Или (Тип = "Справочники" И Вид = "Календари")
			 Или (Тип = "РегистрыСведений" И Вид = "СтатьиЗатратПоЗарплате")
			Тогда
				ПлюсПустая = Истина;
			КонецЕсли;
			
			мУсловие.Добавить(
				РеквОрг + " В ИЕРАРХИИ(&Организация)"
				+ ?(ПлюсПустая, " Или " + РеквОрг + " = Значение(Справочник.Организации.ПустаяСсылка)", "")
			);
		КонецЕсли;
		ЗапросПараметры.Вставить("Организация", Организация);
	КонецЕсли;
	
	
	//Если ЗначениеЗаполнено(Рекурсия) Тогда
	//	мИЛИ = Новый Массив;
	//	Сч = 0;
	//	Для Каждого Усл Из СтрРазделить(Рекурсия, ",", Ложь) Цикл
	//		Сч = Сч + 1;
	//		мРавно = СтрРазделить(Усл, "=", Ложь);
	//		мТипВид = СтрРазделить(мРавно[1], ".", Ложь);
	//		
	//		мИЛИ.Добавить(мРавно[0] + " В (&Значения" + Сч + ")");
	//		
	//		Значения = ОбъектыВыборка(Истина, мТипВид[0], мТипВид[1], РеквОрг, ОргИд);
	//		ЗапросПараметры.Вставить("Значения" + Сч, Значения);
	//	КонецЦикла;
	//	мУсловие.Добавить("(" + СтрСоединить(мИЛИ, Символы.ПС + " ИЛИ ") + ")");
	//	
	//	
	//КонецЕсли;
	
	Если мУсловие.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат " "
			+ "ГДЕ" + Символы.ПС
			+ СтрСоединить(мУсловие, Символы.ПС + "И ")
			+ Символы.ПС
		;
КонецФункции


&НаКлиенте
Процедура цМетаданные(Команда)
	цМетаданныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	|	ХозрасчетныйОбороты.Субконто3 КАК Субконто3,
	|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет = &Счет, , Организация В ИЕРАРХИИ (&Организация), , ) КАК ХозрасчетныйОбороты";
	
	//Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	//Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// 
	
	ЗапросТекст = Запрос.Текст;
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("НачалоПериода",Период.ДатаНачала);
	ЗапросПараметры.Вставить("КонецПериода",КонецДня(Период.ДатаОкончания));  
	ЗапросПараметры.Вставить("Организация",Организация);  
	ЗапросПараметры.Вставить("Счет",Счет); 
	//ЗапросПараметры.Вставить("Регистратор",Документы.АвансовыйОтчет.НайтиПоНомеру("ТОУХ-000002",Дата('2018.03.01 00:00:00'))); 
	// мИзмерения = СтрРазделить("Регистратор",",",Ложь);  
	мИзмерения = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
	
	Если ВыполнитьЗапросОбщийМодуль Тогда
		МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ВыполнитьЗапрос(ЗапросТекст, ЗапросПараметры, мИзмерения);  
	Иначе
		МассивДляЗагрузки =	ВыполнитьЗапрос(ЗапросТекст, ЗапросПараметры, мИзмерения);  
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	Строка=1;
	Колонка=1;
	Для каждого эл  Из МассивДляЗагрузки  Цикл
		Для каждого мСтр  Из эл  Цикл
			ТвояОбласть.Область(Строка,Колонка,Строка,Колонка).Текст =  мСтр;
			Колонка = Колонка+1;
			СписокОбъектов.Вывести(ТвояОбласть);
		КонецЦикла;	
		СписокОбъектов.Вывести(ТвояОбласть);
		Строка = Строка + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала    =  Дата('2023.01.01 00:00:00');
	Период.ДатаОкончания =  Дата('2023.01.31 23:59:59');
	Организация = "ТОТ";
КонецПроцедуры

&НаСервере
Функция ПолучитьПланСчетовНаСервере()  Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка,
	|	Хозрасчетный.Код КАК Код
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	мПлансСчетов = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мПлансСчетов.Вставить(ВыборкаДетальныеЗаписи.Код,ЗначениеВСтрокуВнутр(ВыборкаДетальныеЗаписи.Ссылка));	
	КонецЦикла;
	
	Возврат  мПлансСчетов;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьПланСчетов(Команда)
	рез =	ПолучитьПланСчетовНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиРеквизитОрганизация(РеквизитыОбъекта)
	ОрганизацияЕсть = Ложь;
	Для каждого эл Из РеквизитыОбъекта Цикл
	        Если эл.Имя = "Организация" Тогда
				ОрганизацияЕсть =  Истина;	
			КонецЕсли;
	 КонецЦикла;
	
   Возврат  ОрганизацияЕсть;
КонецФункции // НайтиРеквизитОрганизация()


#Область ТехническиеПроцедурыИФункции

&НаСервере
Процедура ЗначениеИзСтрокиВнутрНаСервере()
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	МассивЗначений = Новый Массив;
	НайденныеОбъекты.Очистить();
	
	Для к = 1 По ТвояОбласть.ВысотаТаблицы   Цикл
		ОбъектРез = ЗначениеИзСтрокиВнутр(ТвояОбласть.Область(к,1,к,1).Текст);     
		НоваяСтрока = НайденныеОбъекты.Добавить();
		НоваяСтрока.Объект = ОбъектРез;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗначениеВСтрокуВнутрНаСервере()
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=1;
	Для каждого эл  Из НайденныеОбъекты  Цикл
		ГУИД = ЗначениеВСтрокуВнутр(эл.Объект);
		ТвояОбласть.Область(к,1,к,1).Текст =  ГУИД;
		к=к+1;
	КонецЦикла;
	СписокОбъектов.Вывести(ТвояОбласть);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеВСтрокуВнутр1(Команда)
	ЗначениеВСтрокуВнутрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеИзСтрокиВнутр1(Команда)
	ЗначениеИзСтрокиВнутрНаСервере();
КонецПроцедуры

&НаСервере
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	ТипСсылки = ТипЗнч(Ссылка);
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "Справочник";

	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "Документ";

	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "БизнесПроцесс";

	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "ПланВидовХарактеристик";

	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "ПланСчетов";

	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "ПланВидовРасчета";

	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "Задача";

	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "ПланОбмена";

	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат "Перечисление";

	Иначе
		Возврат "";

	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьОписаниеТиповДляТаблицыЗначениий() Экспорт 
    НоваяТЗ = Новый ТаблицаЗначений;  
	оОписание = Новый ОписаниеТипов;
	оОписание = Новый ОписаниеТипов(оОписание, Справочники.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Документы.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Перечисления.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыСчетов.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыВидовХарактеристик.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Задачи.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыВидовРасчета.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыОбмена.ТипВсеСсылки().Типы());
	
	Возврат  оОписание 
	
КонецФункции // ПолучитьТипизированнуюТаблицу()

&НаСервере
Функция СсылкаСуществует(ЛюбаяСсылка) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|    Ссылка
	|ИЗ
	|    [ИмяТаблицы]
	|ГДЕ
	|    Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ИмяТаблицыПоСсылке(ЛюбаяСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ПолучитьЗначениеРСпоОбъектуНаСервере()
	МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ПолучитьСпособыУчетаЗарплаты();  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗначениеРСпоОбъекту(Команда)
	ПолучитьЗначениеРСпоОбъектуНаСервере();
КонецПроцедуры

&НаСервере
Функция РСмПоискбъектНеНайден(Выборка,сч,мРезультат,Измерение,ИмяРС)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ДанныеДляОбработки.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	РегистрСведений.ДанныеДляОбработки КАК ДанныеДляОбработки
	//|ГДЕ
	//|	ДанныеДляОбработки.Номенклатура.Наименование ЕСТЬ NULL";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//// Удаление записей с <Объект не найден>
	//Пока Выборка.Следующий() Цикл 
	//	
		НаборЗаписей = РегистрыСведений[ИмяРС].СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор[Измерение].Установить(Выборка.Организация);
		
		//НаборЗаписей.Записывать = Истина;
		//НаборЗаписей.Записать(Истина);	
	//			
	//КонецЦикла;
КонецФункции

&НаСервере
Функция ПолучитьГуидПоБитойСсылке(БитаяСсылка)
   Если ЗначениеЗаполнено(БитаяСсылка) Тогда 
			ГУИДУдОбъкта = СокрЛП(БитаяСсылка);
			
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъкта,"<Объект не найден> (","");
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,")","");
			ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,"0x","");
			ГУИДУдОбъктаСтр = Сред(ГУИДУдОбъктаСтр, Найти(ГУИДУдОбъктаСтр,":")+1, СтрДлина(ГУИДУдОбъктаСтр));
			// Преобразуем GUID
			ГУИД = Сред(ГУИДУдОбъктаСтр,25,8)+"-"+Сред(ГУИДУдОбъктаСтр,21,4)+"-"+Сред(ГУИДУдОбъктаСтр,17,4)+"-"+Сред(ГУИДУдОбъктаСтр,1,4)+"-"+Сред(ГУИДУдОбъктаСтр,5,12);			
			//и получаем ГУИД = 05dbe824-a4c6-11dd-bf56-00145e3710ab    
		КонецЕсли;

	
 Возврат ГУИД
КонецФункции // ПолучитьГуидПоБитойСсылке()

&НаСервере
Функция СоздатьИзГУИДА(БитаяСсылка,ТипОбъекта)
	тМассив = СтрРазделить(ТипОбъекта,".");  
	рВид = тМассив[0];
	рТип = тМассив[1]; 
	ТекGUID =  ПолучитьГуидПоБитойСсылке(БитаяСсылка);

	Рез = Ложь;
	
	Попытка
		УникальныйИд = Новый УникальныйИдентификатор(ТекGUID);
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное); 
		Рез = Ложь;
	КонецПопытки;
	
	Дерево 	 = "";
	Владелец = "";
	Если рВид = "CatalogRef" Тогда
		
		Если ЗначениеЗаполнено(Вид) Тогда
			Если не  рТип = Вид Тогда       //тест
				Возврат Ложь;
			КонецЕсли
		КонецЕсли;
				
		ОбъектЭ = Справочники[рТип].СоздатьЭлемент();				
		ОбъектЭ.УстановитьСсылкуНового(Справочники[рТип].ПолучитьСсылку(УникальныйИд)); 	
		ОбъектЭ.Наименование =    "Восстановленный из :" +УникальныйИд;   
		ОбъектЭ.ОбменДанными.Загрузка=Истина;
		ОбъектЭ.Записать();  
		м = ОбъектЭ.Метаданные();  
		
		Если м.Владельцы.Количество()>0 Тогда
			Владелец = "Владелец";
		Иначе
			Владелец = "";	
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Владелец) Тогда
		//
		//КонецЕсли;
		
		Если  м.Иерархический Тогда
			Дерево = "Родитель";  
		Иначе 
			Дерево = "";	
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Дерево) Тогда
			Если Не Справочники[рТип].НайтиПоНаименованию("Восстановленные").Пустая() Тогда;
				Группа = Справочники[рТип].НайтиПоНаименованию("Восстановленные");
				Попытка
				//	ОбъектЭ = ОбъектЭ.ПолучитьОбъект();
					ОбъектЭ.Родитель = Группа;
					ОбъектЭ.ОбменДанными.Загрузка = Истина;
					ОбъектЭ.Записать();
					Рез = Истина;	
				Исключение
					Рез = Ложь;
				КонецПопытки;
			Иначе
				Попытка
					ОбъектГ = Справочники[рТип].СоздатьГруппу();
					ОбъектГ.Наименование = "Восстановленные"; 
					ОбъектГ.ОбменДанными.Загрузка = Истина;	
					ОбъектГ.Записать();
					
					//ОбъектЭ = ОбъектЭ.ПолучитьОбъект();
					ОбъектЭ.Родитель = ОбъектГ.Ссылка;
					ОбъектЭ.ОбменДанными.Загрузка = Истина;
					ОбъектЭ.Записать();
					Рез = Истина;					
				Исключение
					Рез = Ложь;
				КонецПопытки;
			КонецЕсли;	
		//КонецЕсли;   
		
			
		//Объект.СоздатьГруппу();  				
		//ИначеЕсли ТипОбъекта = "Документ" Тогда
		//	Объект = Документы[ИмяОбъекта].СоздатьДокумент();
		//	Объект.УстановитьСсылкуНового(Документы[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		//	Объект = ПланыВидовХарактеристик[ИмяОбъекта].СоздатьЭлемент();
		//	Объект.УстановитьСсылкуНового(ПланыВидовХарактеристик[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//	//Объект.СоздатьГруппу();
		//ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
		//	Объект = ПланыСчетов[ИмяОбъекта].СоздатьСчет();
		//	Объект.УстановитьСсылкуНового(ПланыСчетов[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
		//	Объект = ПланыВидовРасчета[ИмяОбъекта].СоздатьВидРасчета();
		//	Объект.УстановитьСсылкуНового(ПланыВидовРасчета[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//ИначеЕсли ТипОбъекта = "ПланОбмена" Тогда
		//	Объект = ПланыОбмена[ИмяОбъекта].СоздатьУзел();
		//	Объект.УстановитьСсылкуНового(ПланыОбмена[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//ИначеЕсли ТипОбъекта = "БизнесПроцесс" Тогда
		//	Объект = БизнесПроцессы[ИмяОбъекта].СоздатьБизнесПроцесс();
		//	Объект.УстановитьСсылкуНового(БизнесПроцессы[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//ИначеЕсли ТипОбъекта = "Задача" Тогда
		//	Объект = Задачи[ИмяОбъекта].СоздатьЗадачу();
		//	Объект.УстановитьСсылкуНового(Задачи[ИмяОбъекта].ПолучитьСсылку(УникальныйИд));
		//Иначе
		//	Предупреждение("Выбран не ссылочный тип! Сообщите пожалуйста разработчику : сайт W1C.ru");
		//	Возврат;
	КонецЕсли; 
	
	Возврат Рез;
КонецФункции // СоздатьИзГУИДА()

&НаСервере
Процедура ВосстановитьБитыеСсылкиСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦТ_ОбъектыОбмен.ОбъектВнутр КАК ОбъектВнутр
	|ИЗ
	|	РегистрСведений.ЦТ_ОбъектыОбмен КАК ЦТ_ОбъектыОбмен
	|ГДЕ
	//|	ЦТ_ОбъектыОбмен.ВИсточникеНет = ИСТИНА   И
	|  ЦТ_ОбъектыОбмен.БылВосстановлен = ЛОЖЬ";
	
	Если ВосстановитьОбъектыВДочке Тогда
		
		Запрос.Текст =  СтрЗаменить(Запрос.Текст,  "ЦТ_ОбъектыОбмен.БылВосстановлен = ЛОЖЬ", "ЦТ_ОбъектыОбмен.ВИсточникеНет = ИСТИНА   И   ЦТ_ОбъектыОбмен.БылВосстановлен = ЛОЖЬ");
	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	эл = РезультатЗапроса.Выбрать();
	сч = 0;	
	Пока эл.Следующий() Цикл
		Если сч>0  Тогда
			//Прервать;	
		КонецЕсли;	
		МенеджерЗаписи = РегистрыСведений.ЦТ_ОбъектыОбмен.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектВнутр = эл.ОбъектВнутр;   
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ОбъектСтрока = ЗначениеИзСтрокиВнутр(эл.ОбъектВнутр);
		МенеджерЗаписи.Откуда =  МенеджерЗаписи.Откуда;
		МенеджерЗаписи.ВИсточникеНет =  МенеджерЗаписи.ВИсточникеНет; 
		Попытка
					МенеджерЗаписи.ТипОбъекта = СтрТипЗнч(эл.ОбъектВнутр);  
		Исключение
		     Сообщить("Не типизируется обьект: " + эл.ОбъектВнутр); 
			 Продолжить;
		КонецПопытки;
  
		Если  СсылкаСуществует(ЗначениеИзСтрокиВнутр(эл.ОбъектВнутр)) Тогда
			МенеджерЗаписи.БылВосстановлен = Истина;	
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				Сообщить("Объект не найден: " + эл + " не записан!");
			КонецПопытки;  
			
			Продолжить;	
		КонецЕсли;
	
		Рез = СоздатьИзГУИДА(ЗначениеИзСтрокиВнутр(эл.ОбъектВнутр),СтрТипЗнч(эл.ОбъектВнутр));
		Если Рез = Истина Тогда
			МенеджерЗаписи.БылВосстановлен = Истина;	
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				Сообщить("Объект не найден: " + эл + " не записан!");
			КонецПопытки;  
		сч = сч + 1;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВосстановитьБитыеСсылкиСервер()

&НаСервере
Процедура УдалитьНепосредственно()
	Для каждого эл Из НайденныеОбъекты Цикл
		Об =  эл.Объект.ПолучитьОбъект(); 
		Об.ОбменДанными.Загрузка = Истина;
		Об.Удалить();
	КонецЦикла; 
	Для каждого эл Из Буфер Цикл
		Если   СтрНайти(Строка(ТипЗнч(эл.Значение)),"Регистр сведений")>0 Тогда
			МенеджерЗаписи =  РегистрыСведений[Вид].СоздатьМенеджерЗаписи();  
			//МенеджерЗаписи.Заполнить(эл.Значение);     
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, эл.Значение);
			
			//Если  МенеджерЗаписи.Прочитать() Тогда
				МенеджерЗаписи.Удалить(); 
			//КонецЕсли;
		ИначеЕсли   МетаданныеТип(эл.Значение) = "Справочник" Тогда
			Об =  эл.Значение.ПолучитьОбъект(); 
			Об.ОбменДанными.Загрузка = Истина;
			Об.Удалить();
		КонецЕсли;
	КонецЦикла;
	Буфер.Очистить();
	НайденныеОбъекты.Очистить();	
КонецПроцедуры // УдалитьНепосредственно()     


&НаСервере
Процедура ПометитьНаУдалениеСервер()
	Для каждого эл Из НайденныеОбъекты Цикл
		Об =  эл.Объект.ПолучитьОбъект(); 
		//Об.ОбменДанными.Загрузка = Истина;
		Об.ПометкаУдаления = Истина;  
		Об.Записать();
	КонецЦикла; 
	//Для каждого эл Из Буфер Цикл
	//	Если   СтрНайти(Строка(ТипЗнч(эл.Значение)),"Регистр сведений")>0 Тогда
	//		МенеджерЗаписи =  РегистрыСведений[Вид].СоздатьМенеджерЗаписи();  
	//		//МенеджерЗаписи.Заполнить(эл.Значение);     
	//		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, эл.Значение);
	//		
	//		//Если  МенеджерЗаписи.Прочитать() Тогда
	//			МенеджерЗаписи.Удалить(); 
	//		//КонецЕсли;
	//	ИначеЕсли   МетаданныеТип(эл.Значение) = "Справочник" Тогда
	//		Об =  эл.Значение.ПолучитьОбъект(); 
	//		Об.ОбменДанными.Загрузка = Истина;
	//		Об.Удалить();
	//	КонецЕсли;
	//КонецЦикла;
	Буфер.Очистить();
	НайденныеОбъекты.Очистить();	
КонецПроцедуры // УдалитьНепосредственно()


&НаКлиенте
Процедура ВосстановитьБитыеСслыки(Команда)
	ВосстановитьБитыеСсылкиСервер();
КонецПроцедуры

&НаСервере
Процедура ПочиститьРСпоБитойСсылкеНаСервере()
	мРезультатРС = новый Массив;		
	к = 0;	
	СписокОбъектов.Очистить();   
	Буфер.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	Колонка = 1;
	Если Не ЗначениеЗаполнено(Тип) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен тип";
		Сообщение.Поле = "Тип";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для каждого м Из Метаданные[Тип] Цикл
		мРеквизиты = м.Реквизиты;
		Дерево = "";
		мВладелец = "";
		
		Если ПосчитатьКоличествоРС Тогда
			к = к + 1;	
			Продолжить;
		КонецЕсли; 
		
		Если  ЗначениеЗаполнено(Вид) Тогда
			Если м.Имя <>  Вид Тогда
				к = к + 1;	
				Продолжить;
			КонецЕсли;  
		КонецЕсли;
		
		//НаборЗаписей = РегистрыСведений[м.Имя].СоздатьНаборЗаписей();
		//НаборЗаписей.Прочитать();
		
		мРек = Новый Массив;
		Для каждого эл Из м.Реквизиты Цикл
			мРек.Добавить(эл.Имя); 
		КонецЦикла;
		
		обМетаданные ="";
		Если Тип = "РегистрыСведений" Тогда
			мИзм = Новый Массив;
			
			Для каждого эл Из м.Измерения Цикл
				мИзм.Добавить(эл.Имя); 
			КонецЦикла;
			Измерение = "";
			Измерение = СтрСоединить(мИзм,",");
			
			мРес = Новый Массив;
			
			Для каждого эл Из м.Ресурсы Цикл
				мРес.Добавить(эл.Имя); 
			КонецЦикла;
			Ресурс = "";
			Ресурсы = СтрСоединить(мРес,",");
			
			обМетаданные =  м.Измерения;
			обМетаданныеР = м.Ресурсы;
			
			Измерение = Измерение +","+ Ресурсы;
			
			мРес = Новый Массив;
			Для каждого эл Из м.Ресурсы Цикл
				мРес.Добавить(эл);
			КонецЦикла;
			
		ИначеЕсли Тип = "Справочники" Тогда   
			мРек.Добавить("Ссылка");
			Измерение = "";
			Измерение = СтрСоединить(мРек,",");
			обМетаданные =  м.Реквизиты;
		КонецЕсли;

		сч = 0;
	
		ЗапросТекст = ""; 
		Если обМетаданные.Найти("Организация") <> неопределено или обМетаданныеР.Найти("Организация") <> Неопределено Тогда
			 
			Если Тип = "РегистрыСведений" Тогда  
				ЗапросТекст = ТекстЗапросаРС("РегистрСведений",м.Имя,Измерение,"");	
			ИначеЕсли Тип = "Справочники" Тогда 
				ЗапросТекст = ТекстЗапросаРС("Справочник",м.Имя,Измерение,"");	
			КонецЕсли;
				
			Запрос	= Новый Запрос; 
			Если Не  ВыбратьОбъектНеНайден Тогда
				Запрос.УстановитьПараметр("Организация",Организация);
			КонецЕсли;
			Запрос.Текст = ЗапросТекст;
			Выборка = Запрос.Выполнить().Выбрать();
			сч = 1;	
			НайденныеОбъекты.Очистить();
			Пока Выборка.Следующий() Цикл  
				//Сообщить(Строка(сч) + " : " + м.Имя +": " +Выборка.Организация); 
				Если м.Имя = "ЦТ_ОбъектыОбмен" Тогда
					Продолжить;
				КонецЕсли;
				мРезультатРС.Добавить(Строка(сч) + " : " + м.Имя +": " +Выборка.Организация); 
				ТвояОбласть.Область(сч,Колонка,сч,Колонка).Текст =  Строка(сч) + " : " + м.Имя +": " +Выборка.Организация;
				//Колонка = Колонка+1;
				СписокОбъектов.Вывести(ТвояОбласть);  
				
				Если Тип = "РегистрыСведений" Тогда    
					Отбор = Новый Структура();         
					Для каждого изм Из мИзм Цикл
						Отбор.Вставить(изм); 
					КонецЦикла;   
					ЗаполнитьЗначенияСвойств(Отбор,Выборка);
					Значение = РегистрыСведений[Вид].СоздатьКлючЗаписи(Отбор);
					НоваяСтрока = Буфер.Добавить();  
					НоваяСтрока.Значение =   Значение;
				ИначеЕсли Тип = "Справочники" Тогда  
					Отбор = Новый Структура();         
					Для каждого изм Из мРек Цикл
						Отбор.Вставить(изм); 
					КонецЦикла;   
					ЗаполнитьЗначенияСвойств(Отбор,Выборка);
					Значение =  Выборка.Ссылка;
					НоваяСтрока = Буфер.Добавить();  
					НоваяСтрока.Значение =   Значение;
				КонецЕсли;
				сч=сч+1;
			КонецЦикла; 
			Если м.Имя = "ЦТ_ОбъектыОбмен" Тогда
				Продолжить;
			КонецЕсли;
			Если Выборка.Количество()>0 Тогда
				Если м.Имя = Вид Тогда
					//НаборЗаписей = РегистрыСведений[м.Имя].СоздатьНаборЗаписей();
					//НаборЗаписей.Отбор["Организация"].Установить(Выборка.Организация);
					//НаборЗаписей.Записывать = Истина;
					//НаборЗаписей.Записать(Истина);
					
				Иначе 
					Сообщить(м.Имя +": есть битая организация");	
				КонецЕсли;
				
			КонецЕсли;
			//тМассив = Запрос.Выполнить().Выгрузить();     
			//Сообщить(""+м.Имя+":"+тМассив.Количество());				
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПочиститьРСпоБитойСсылке(Команда)
	ПочиститьРСпоБитойСсылкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНепосредственноПоОтборуНаСервере()
	 УдалитьНепосредственно();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНепосредственноПоОтбору(Команда)
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
//	Ответ = Вопрос("Удалить непосредственно? Да - удалить, Нет - пометка удаления",Режим, 0);
//	Если Ответ = КодВозвратаДиалога.Да Тогда
          УдалитьНепосредственноПоОтборуНаСервере();
  // КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляУдаленияНаСервере()  
	
	//
    мРезультатРС = новый Массив;		
    к = 0;	
    СписокОбъектов.Очистить();   
    Буфер.Очистить();
    ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
    Колонка = 1;
    Если Не ЗначениеЗаполнено(Тип) Тогда
    	Сообщение = Новый СообщениеПользователю;
    	Сообщение.Текст = "Не заполнен тип";
    	Сообщение.Поле = "Тип";
    	Сообщение.Сообщить();
    	Возврат;
    КонецЕсли;
    
    Для каждого м Из Метаданные[Тип] Цикл
    	мРеквизиты = м.Реквизиты;
    	Дерево = "";
    	мВладелец = "";
    	
    	Если ПосчитатьКоличествоРС Тогда
    		к = к + 1;	
    		Продолжить;
    	КонецЕсли; 
    	
    	Если  ЗначениеЗаполнено(Вид) Тогда
    		Если м.Имя <>  Вид Тогда
    			к = к + 1;	
    			Продолжить;
    		КонецЕсли;  
    	КонецЕсли;
    	
    	мРек = Новый Массив;
    	Для каждого эл Из м.Реквизиты Цикл
    		мРек.Добавить(эл.Имя); 
    	КонецЦикла;
    	
    	обМетаданные ="";
    	Если Тип = "РегистрыСведений" Тогда
    		мИзм = Новый Массив;
    		
    		Для каждого эл Из м.Измерения Цикл
    			мИзм.Добавить(эл.Имя); 
    		КонецЦикла;
    		Измерение = "";
    		Измерение = СтрСоединить(мИзм,",");
    		
    		мРес = Новый Массив;
    		
    		Для каждого эл Из м.Ресурсы Цикл
    			мРес.Добавить(эл.Имя); 
    		КонецЦикла;
    		Ресурс = "";
    		Ресурсы = СтрСоединить(мРес,",");
    		
    		обМетаданные =  м.Измерения;
    		обМетаданныеР = м.Ресурсы;
    		
    		Измерение = Измерение +","+ Ресурсы;
    		
    		мРес = Новый Массив;
    		Для каждого эл Из м.Ресурсы Цикл
    			мРес.Добавить(эл);
    		КонецЦикла;
    		
    	ИначеЕсли Тип = "Справочники" Тогда   
    		мРек.Добавить("Ссылка");
    		Измерение = "";
    		Измерение = СтрСоединить(мРек,",");
    		обМетаданные =  м.Реквизиты;
    	КонецЕсли;

    	сч = 0;
    
    	ЗапросТекст = ""; 
    	//Если обМетаданные.Найти("Организация") <> неопределено или обМетаданныеР.Найти("Организация") <> Неопределено Тогда
    		 
    		Если Тип = "РегистрыСведений" Тогда  
    			ЗапросТекст = ТекстЗапросаРС("РегистрСведений",м.Имя,Измерение,"");	
    		ИначеЕсли Тип = "Справочники" Тогда 
    			ЗапросТекст = ТекстЗапросаРС("Справочник",м.Имя,Измерение,"");	
    		КонецЕсли;
    			
    		Запрос	= Новый Запрос; 
    		Запрос.УстановитьПараметр("Код","00ЗК-00146");
    		Запрос.Текст = ЗапросТекст;
    		Выборка = Запрос.Выполнить().Выбрать();
    		сч = 1;	
    		НайденныеОбъекты.Очистить();
    		Пока Выборка.Следующий() Цикл  
    			//Сообщить(Строка(сч) + " : " + м.Имя +": " +Выборка.Организация); 
    			Если м.Имя = "ЦТ_ОбъектыОбмен" Тогда
    				Продолжить;
    			КонецЕсли;
    			мРезультатРС.Добавить(Строка(сч) + " : " + м.Имя); 
    			ТвояОбласть.Область(сч,Колонка,сч,Колонка).Текст =  Строка(сч) + " : " + м.Имя;
    			//Колонка = Колонка+1;
    			СписокОбъектов.Вывести(ТвояОбласть);  
    			
    			Если Тип = "РегистрыСведений" Тогда    
    				Отбор = Новый Структура();         
    				Для каждого изм Из мИзм Цикл
    					Отбор.Вставить(изм); 
    				КонецЦикла;   
    				ЗаполнитьЗначенияСвойств(Отбор,Выборка);
    				Значение = РегистрыСведений[Вид].СоздатьКлючЗаписи(Отбор);
    				НоваяСтрока = Буфер.Добавить();  
    				НоваяСтрока.Значение =   Значение;
    			ИначеЕсли Тип = "Справочники" Тогда  
    				Отбор = Новый Структура();         
    				Для каждого изм Из мРек Цикл
    					Отбор.Вставить(изм); 
    				КонецЦикла;   
    				ЗаполнитьЗначенияСвойств(Отбор,Выборка);
    				Значение =  Выборка.Ссылка;
    				НоваяСтрока = Буфер.Добавить();  
    				НоваяСтрока.Значение =   Значение;
    			КонецЕсли;
    			сч=сч+1;
    		КонецЦикла; 
    		Если м.Имя = "ЦТ_ОбъектыОбмен" Тогда
    			Продолжить;
    		КонецЕсли;
 
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДляУдаления(Команда)
	ЗаполнитьДляУдаленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоДокументамБезПроводокНаСервере()
	мРезультатРС = Новый Массив;
    мРезультат = Новый Массив;

	Если ВыполнитьЗапросОбщийМодуль Тогда
		Если РегистрыСведенийСобратьПоМетаданным  Тогда
			  // мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервереРС(ВыбратьОбъектНеНайден);
		Иначе 
			   //мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервере(ВыбратьОбъектНеНайден);
		КонецЕсли;
	Иначе 
			Для каждого м Из Метаданные.Документы Цикл
				Если не  м.Имя = "ПлатежноеПоручение" Тогда       //тест
					 Продолжить;
				КонецЕсли;
				
				ЗапросТекст = "";
				ЗапросТекст = ТекстЗапроса("Документы",м.Имя);
				Запрос	= Новый Запрос;
				Запрос.Текст = ЗапросТекст;
				Выборка = Запрос.Выполнить().Выбрать();
				сч = 0;	    
				Пока Выборка.Следующий() Цикл
						сч = МетаданныеОбъекта(Выборка.Ссылка,сч,мРезультат);
						сч=сч+1;
				КонецЦикла;
				
				тМассив = Запрос.Выполнить().Выгрузить();     
				Сообщить(""+м.Имя+":"+тМассив.Количество()); 
			КонецЦикла; 
 
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	Колонка=1;
	сч = 1;
	Для каждого эл Из мРезультатРС Цикл
		ТвояОбласть.Область(сч,Колонка,сч,Колонка).Текст = эл;
		сч = сч + 1;
	КонецЦикла; 
	СписокОбъектов.Вывести(ТвояОбласть);
	
	СвернутыйМассив = Новый Массив;
	Для каждого Элемент Из мРезультат Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Сообщить("СвернутыйМассив:" + СвернутыйМассив.Количество());
	
	
	//МассивДляЗагрузки =	ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайден(ЗапросПараметры);
	НайденныеОбъекты.Очистить();
	Для каждого эл  Из  СвернутыйМассив Цикл
		новаястрока = НайденныеОбъекты.Добавить();
		Если СтрокуВнутр Тогда
			новаястрока.Объект = ЗначениеИзСтрокиВнутр(эл);
		Иначе 
			новаястрока.Объект = эл;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоДокументамБезПроводок(Команда)
	ПоДокументамБезПроводокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИменаПредопределенныхДанныхНаСервере()   
	ОбъектПроверяемый = "СтатьиЗатрат";
	Выб  = ОбменДаннымиПереопределяемый.ПолучитьИменаПредопределенныхДанных(ОбъектПроверяемый);	// Вставить содержимое обработчика. 
	
	мРезультат = Новый Массив;
	Для Каждого эл Из Выб Цикл
	  мРезультат.Добавить(эл);
	КонецЦикла;

	
	КС = Новый КвалификаторыСтроки(150);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("ИмяПредопределенныхДанных",ОписаниеТиповС);  
	пСоответствие = Новый Соответствие;

	Для Каждого Строка Из Выб Цикл 
		СтрокаНоваяТЗ = НоваяТЗ.Добавить();
		зн = Справочники.СтатьиЗатрат[Строка];  
		Если Строка = "АмортизационнаяПремия" Тогда
		    пСоответствие.Вставить(Строка,"АмортизационнаяПремия1");
		Иначе 	
			пСоответствие.Вставить(Строка,зн.Наименование);
		КонецЕсли;
		
		//СтрокаНоваяТЗ.ИмяПредопределенныхДанных = Строка;
	КонецЦикла;
	
	Для Каждого Строка Из пСоответствие Цикл 
		зн = Справочники.СтатьиЗатрат[Строка.Ключ];   
		Если зн.Наименование = Строка.Значение Тогда
			Продолжить;
		КонецЕсли; 
		спрОб =  зн.ПолучитьОбъект();  
		спрОб.Наименование = Строка.Значение;
		спрОб.Записать();
	КонецЦикла;
	
	//Возврат пСоответствие;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИменаПредопределенныхДанных(Команда)
	ОбновитьИменаПредопределенныхДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьДанныевТЧНаСервере()
	//Текст = ТекстЗапроса(Тип,Вид);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиУчетаНДС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаНДС КАК КлючиАналитикиУчетаНДС
		|ГДЕ
		|	КлючиАналитикиУчетаНДС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока =	НайденныеОбъекты.Добавить();   
		НоваяСтрока.Объект = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДанныевТЧ(Команда)
	ВыбратьДанныевТЧНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ВыбратьМетаданные() Экспорт 
	
	//СписокОбъектов.	
	
КонецФункции // ВыбратьМетаданные¶()

 &НаСервере
Процедура ОтчетТипыДанныхНаСервере()   Экспорт
	
	с = ОтчетТипыДанныхНаСервереФ();
	
КонецПроцедуры


&НаСервере
Функция ОтчетТипыДанныхНаСервереФ()   Экспорт
	
	ОтчетТипыДанных = Истина;
	МассивОбъектов = Новый Массив; 
	
	Если ЧтоПроверяем = "Справочники"  Тогда
		МассивОбъектов.Добавить("Справочники");
	ИначеЕсли ЧтоПроверяем = "Документы" Тогда 	
		МассивОбъектов.Добавить("Документы");
	ИначеЕсли ЧтоПроверяем = "РегистрыСведений" Тогда
		МассивОбъектов.Добавить("РегистрыСведений");
	ИначеЕсли ЧтоПроверяем = "ФункциональныеОпции" Тогда
		МассивОбъектов.Добавить("ФункциональныеОпции");
	ИначеЕсли ЧтоПроверяем = "Константы" Тогда
		МассивОбъектов.Добавить("Константы");
	Иначе
		МассивОбъектов.Добавить("Справочники");
		МассивОбъектов.Добавить("Документы");
		МассивОбъектов.Добавить("РегистрыСведений");	
	КонецЕсли;
	
	//МассивОбъектов = Новый Массив; 
	//МассивОбъектов.Добавить("HTTPСервисы");
	//МассивОбъектов.Добавить("WebСервисы");
	//МассивОбъектов.Добавить("WSСсылки");
	//МассивОбъектов.Добавить("АвторскиеПрава");
	//МассивОбъектов.Добавить("АдресИнформацииОКонфигурации");
	//МассивОбъектов.Добавить("АдресИнформацииОПоставщике");
	//МассивОбъектов.Добавить("АдресКаталогаОбновлений");
	//МассивОбъектов.Добавить("БизнесПроцессы");
	//МассивОбъектов.Добавить("ВариантВстроенногоЯзыка");
	//МассивОбъектов.Добавить("Версия");
	//МассивОбъектов.Добавить("ВключатьСправкуВСодержание");
	//МассивОбъектов.Добавить("Документы");
	//МассивОбъектов.Добавить("ДополнительныеСловариПолнотекстовогоПоиска");
	//МассивОбъектов.Добавить("ЖурналыДокументов");
	//МассивОбъектов.Добавить("Задачи");
	//МассивОбъектов.Добавить("Заставка");
	//МассивОбъектов.Добавить("Имя");
	//МассивОбъектов.Добавить("Интерфейсы");
	//МассивОбъектов.Добавить("Комментарий");
	//МассивОбъектов.Добавить("Константы");
	//МассивОбъектов.Добавить("КраткаяИнформация");
	//МассивОбъектов.Добавить("КритерииОтбора");
	//МассивОбъектов.Добавить("Логотип");
	//МассивОбъектов.Добавить("МодульВнешнегоСоединения");
	//МассивОбъектов.Добавить("МодульПриложения");
	//МассивОбъектов.Добавить("МодульСеанса");
	//МассивОбъектов.Добавить("НумераторыДокументов");
	//МассивОбъектов.Добавить("Обработки");
	//МассивОбъектов.Добавить("ОбщиеКартинки");
	//МассивОбъектов.Добавить("ОбщиеМакеты");
	//МассивОбъектов.Добавить("ОбщиеМодули");
	//МассивОбъектов.Добавить("ОбщиеФормы");
	//МассивОбъектов.Добавить("ОсновнаяРоль");
	//МассивОбъектов.Добавить("ОсновнаяФормаКонстант");
	//МассивОбъектов.Добавить("ОсновнойИнтерфейс");
	//МассивОбъектов.Добавить("ОсновнойСтиль");
	//МассивОбъектов.Добавить("ОсновнойЯзык");
	//МассивОбъектов.Добавить("Отчеты");
	//МассивОбъектов.Добавить("ПакетыXDTO");
	//МассивОбъектов.Добавить("ПараметрыСеанса");
	//МассивОбъектов.Добавить("Перечисления");
	//МассивОбъектов.Добавить("ПланыВидовРасчета");
	//МассивОбъектов.Добавить("ПланыВидовХарактеристик");
	//МассивОбъектов.Добавить("ПланыОбмена");
	//МассивОбъектов.Добавить("ПланыСчетов");
	//МассивОбъектов.Добавить("ПодпискиНаСобытия");
	//МассивОбъектов.Добавить("ПодробнаяИнформация");
	//МассивОбъектов.Добавить("Подсистемы");
	//МассивОбъектов.Добавить("Последовательности");
	//МассивОбъектов.Добавить("Поставщик");
	//МассивОбъектов.Добавить("РегистрыБухгалтерии");
	//МассивОбъектов.Добавить("РегистрыНакопления");
	//МассивОбъектов.Добавить("РегистрыРасчета");
	//МассивОбъектов.Добавить("РегистрыСведений");
	//МассивОбъектов.Добавить("РегламентныеЗадания");
	//МассивОбъектов.Добавить("РежимАвтонумерацииОбъектов");
	//МассивОбъектов.Добавить("РежимУправленияБлокировкойДанных");
	//МассивОбъектов.Добавить("РодительскиеКонфигурации");
	//МассивОбъектов.Добавить("Роли");
	//МассивОбъектов.Добавить("СвойстваОбъектов");
	//МассивОбъектов.Добавить("Синоним");
	//МассивОбъектов.Добавить("Справка");
	//МассивОбъектов.Добавить("Справочники");
	//МассивОбъектов.Добавить("Стили");
	//МассивОбъектов.Добавить("ЭлементыСтиля");
	//МассивОбъектов.Добавить("Языки");
	//МассивОбъектов.Добавить("Константы");	
	
	оОписание = ПолучитьОписаниеТиповДляТаблицыЗначениий();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	сОписание = Новый ОписаниеТипов(МассивТипов);  
	
	бМассивТипов = Новый Массив;
	бМассивТипов.Добавить(Тип("Булево"));
	бОписание = Новый ОписаниеТипов(бМассивТипов);
	
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("ОбъектМетаданных",сОписание); 
	НоваяТЗ.Колонки.Добавить("Представление",сОписание);
	НоваяТЗ.Колонки.Добавить("Вид",сОписание);
	НоваяТЗ.Колонки.Добавить("КодУИД",сОписание); 
	НоваяТЗ.Колонки.Добавить("ТипУИД",сОписание);
	НоваяТЗ.Колонки.Добавить("Иерархический",сОписание); 
	НоваяТЗ.Колонки.Добавить("Владелец",бОписание); 
	НоваяТЗ.Колонки.Добавить("Количество",сОписание);  
	
	СодержаниеОбьекта = Новый ТаблицаЗначений;
	СодержаниеОбьекта.Колонки.Добавить("ОбъектМетаданных",сОписание); 
	СодержаниеОбьекта.Колонки.Добавить("Представление",сОписание);
	СодержаниеОбьекта.Колонки.Добавить("Вид",сОписание);
	СодержаниеОбьекта.Колонки.Добавить("КодУИД",сОписание); 
	СодержаниеОбьекта.Колонки.Добавить("ТипУИД",сОписание);
	СодержаниеОбьекта.Колонки.Добавить("Иерархический",сОписание); 
	СодержаниеОбьекта.Колонки.Добавить("Владелец",бОписание); 

	
	Дерево 	  = "";
	мВладелец = "";	
	Пустая = Неопределено;  
	ОбъектМетаданных = Неопределено;  
	КоличествоОб = 0;  
	
	пРезВывод = Новый Массив;
	
	Для каждого мО Из МассивОбъектов Цикл
		
		//Если не  м.Имя = "КлючиАналитикиУчетаЗатрат" Тогда       //тест
		//	 Продолжить;
		//КонецЕсли;
		Для каждого м Из Метаданные[мО] Цикл
			
			//Метаданные.Справочники
			//
			
			Если мО = "Справочники"  Тогда
				
				Если ЗначениеЗаполнено(Вид) Тогда
					
					Если м.Имя <> Вид Тогда
					
						Продолжить;
					
					КонецЕсли;
								
				КонецЕсли;
				
				ЗапросТекст = "";
				ЗапросТекст = ТекстЗапроса("Справочники",м.Имя);
				Запрос	= Новый Запрос;
				Запрос.Текст = ЗапросТекст;
				КоличествоОб = Запрос.Выполнить().Выгрузить()[0].Количество;
				
				мРеквизиты = м.Реквизиты;
				Дерево = "";
				мВладелец = "";
				Если м.Владельцы.Количество()>0 Тогда
					мВладелец = "Владелец";
				Иначе
					мВладелец = "";
				КонецЕсли;
				Если  м.Иерархический Тогда
					Дерево = "Родитель";  
				Иначе 
					Дерево = "";	
				КонецЕсли; 
				Пустая = Справочники[м.Имя].ПустаяСсылка();
				ОбъектМетаданных =   Справочники;  
				
				Рез = ЗначениеВСтрокуВнутр(Пустая);
				ТипXml = СтрТипЗнч((ЗначениеВСтрокуВнутр(ОбъектМетаданных[м.Имя].ПустаяСсылка())));
				
				Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
				СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
				
				УпкаоватьСоставОбъекта(м,СодержаниеОбьекта);
				
			ИначеЕсли мО = "Документы" Тогда  
				
				ЗапросТекст = "";
				ЗапросТекст = ТекстЗапроса("Документы",м.Имя);
				Запрос	= Новый Запрос;
				Запрос.Текст = ЗапросТекст;  
				Выборка = Запрос.Выполнить().Выбрать();
				КоличествоОб = Запрос.Выполнить().Выгрузить()[0].Количество;
				
				Пустая = Документы[м.Имя].ПустаяСсылка(); 
				ОбъектМетаданных =   Документы;   
				
				Рез = ЗначениеВСтрокуВнутр(Пустая);
				ТипXml = СтрТипЗнч(ЗначениеВСтрокуВнутр(ОбъектМетаданных[м.Имя].ПустаяСсылка()));
				ТипXml = м.Имя;
				
				Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
				СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);

				
			ИначеЕсли мО = "РегистрыСведений" Тогда
				Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
				ТипXml = м.Имя;
				
				// Регистр сведений не имеет иерархии и владельца
				Дерево = "";
				мВладелец = "";
				
				// Количество записей считается запросом, чтобы не загружать набор записей в память
				ЗапросТекст = ТекстЗапроса("РегистрыСведений", м.Имя);
				Запрос = Новый Запрос;
				Запрос.Текст = ЗапросТекст;
				КоличествоОб = Запрос.Выполнить().Выгрузить()[0].Количество;  
			ИначеЕсли мО = "Константы" Тогда
				Тыц 	= Константы[м.Имя].Получить(); 
				Рез 	= ЗначениеВСтрокуВнутр(Константы[м.Имя]);
				ТипXml  = м.Имя;   
				
				Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";   
				КодУИД  = Тыц; 
				//СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
				
			КонецЕсли;
			
			СтрН = Новый Структура;
			
			НоваяСтрока = НоваяТЗ.Добавить(); 
			НоваяСтрока.ОбъектМетаданных           =  мО;
			НоваяСтрока.Представление           =  м;
			НоваяСтрока.Вид           =  ТипXml;
			НоваяСтрока.КодУИД        =  КодУИД;
			НоваяСтрока.ТипУИД        =  ТипУИД;
			НоваяСтрока.Иерархический =  ?(Дерево = "Родитель",Истина,Ложь);
			НоваяСтрока.Владелец      =  ?(мВладелец = "Владелец",Истина,Ложь);
			НоваяСтрока.Количество    =  КоличествоОб;  
			Если  КоличествоОб <> "" и КоличествоОб <> Null Тогда
				СтрН.Вставить("Тип",мО);  
				СтрВ =  СтрЗаменить(ТипXml,"CatalogRef.","");
				СтрН.Вставить("Вид",СтрВ);
				СтрН.Вставить("Количество",Число(КоличествоОб));
				пРезВывод.Добавить(СтрН);
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЦикла; 
	
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=2;
	ТвояОбласть.Область(1,1,1,1).Текст =  "ОбъектМетаданных";
	ТвояОбласть.Область(1,2,1,2).Текст =  "Представление";
	ТвояОбласть.Область(1,3,1,3).Текст =  "Вид";
	ТвояОбласть.Область(1,4,1,4).Текст =  "КодУИД";
	ТвояОбласть.Область(1,5,1,5).Текст =  "ТипУИД";
	ТвояОбласть.Область(1,6,1,6).Текст =  "Иерархический";
	ТвояОбласть.Область(1,7,1,7).Текст =  "Владелец";     
	ТвояОбласть.Область(1,8,1,8).Текст =  "Количество";
	
	Для каждого эл  Из НоваяТЗ  Цикл
		
		ТвояОбласть.Область(к,1,к,1).Текст =  эл.ОбъектМетаданных;
		ТвояОбласть.Область(к,2,к,2).Текст =  эл.Представление;
		ТвояОбласть.Область(к,3,к,3).Текст =  эл.Вид;
		ТвояОбласть.Область(к,4,к,4).Текст =  эл.КодУИД;
		ТвояОбласть.Область(к,5,к,5).Текст =  эл.ТипУИД;
		ТвояОбласть.Область(к,6,к,6).Текст =  эл.Иерархический;
		ТвояОбласть.Область(к,7,к,7).Текст =  эл.Владелец;
		ТвояОбласть.Область(к,8,к,8).Текст =  эл.Количество;
		к=к+1;
	КонецЦикла;    
	
	СписокОбъектов.Вывести(ТвояОбласть); 
	
	Возврат пРезВывод; 
	
КонецФункции


&НаСервере
Функция УпкаоватьСоставОбъекта(м,СодержаниеОбьекта)
	
	мРеквизиты = м.Реквизиты;
	
	Если      ТипЗнч(мРеквизиты) = Тип("КоллекцияОбъектовМетаданных") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из мРеквизиты Цикл
			НоваяСтрока = СодержаниеОбьекта.Добавить();  
			НоваяСтрока.ОбъектМетаданных  =   Стр.Имя;
			НоваяСтрока.Представление     =   Стр.Синоним;
			ТипД                          =   Стр.Тип.Типы()[0];
			Если Метаданные.НайтиПоТипу(ТипД)<> Неопределено  Тогда
				
				Если  Метаданные.Справочники.Содержит(Метаданные.НайтиПоТипу(ТипД)) Тогда
					НоваяСтрока.Вид               =   "Справочники";	
					
					//Пустая = Справочники[Стр.Имя].ПустаяСсылка();
					//ОбъектМетаданных =   Справочники; 
					//ТипXml = СтрТипЗнч((ЗначениеВСтрокуВнутр(ОбъектМетаданных[Стр.Имя].ПустаяСсылка())));
				КонецЕсли;			
				
			ИначеЕсли ТипД = Тип("Строка") Тогда  
					НоваяСтрока.Вид               =   "Строка";
			ИначеЕсли ТипД = Тип("Булево") Тогда  
					НоваяСтрока.Вид               =   "Булево";
			ИначеЕсли ТипД = Тип("Число") Тогда  
					НоваяСтрока.Вид               =   "Число";
		
			Иначе
				    НоваяСтрока.Вид               =   "Неопределен";	
			КонецЕсли;
						
			//НоваяСтрока.ТипУИД            =
			//НоваяСтрока.Иерархический     =
			//НоваяСтрока.Владелец          =
			//НоваяСтрока.ОбъектМетаданных  =
			
		КонецЦикла;
	КонецЕсли;
	//Рез = РазборРеквизитовОбъектаМетаданных(мРеквизиты);
	
	Возврат СодержаниеОбьекта;

	
	//СодержаниеОбьекта.Колонки.Добавить("ОбъектМетаданных",сОписание); 
	//СодержаниеОбьекта.Колонки.Добавить("Представление",сОписание);
	//СодержаниеОбьекта.Колонки.Добавить("Вид",сОписание);
	//СодержаниеОбьекта.Колонки.Добавить("КодУИД",сОписание); 
	//СодержаниеОбьекта.Колонки.Добавить("ТипУИД",сОписание);
	//СодержаниеОбьекта.Колонки.Добавить("Иерархический",сОписание); 
	//СодержаниеОбьекта.Колонки.Добавить("Владелец",бОписание); 

КонецФункции // УпкаоватьСоставОбъекта()



//Функция РазборРеквизитовОбъектаМетаданных(Знач Зн)
//	Тип = ТипЗнч(Зн);
//	Если      Тип = Тип("КоллекцияОбъектовМетаданных") Тогда
//		Рез = Новый Структура;
//		Для Каждого Стр Из Зн Цикл
//			Рез.Вставить(Стр.Имя, Стр.Синоним);
//		КонецЦикла;
//		
//	ИначеЕсли Тип = Тип("Массив") Тогда
//		Рез = Новый Массив;
//		Для Каждого Стр Из Зн Цикл
//			Рез.Добавить(АдаптироватьТипы(Стр, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
//		КонецЦикла;
//		
//	Иначе
//		Рез = Зн;
//	КонецЕсли;
//	
//	Возврат Типы;
//КонецФункции


//&НаКлиенте
//Функция Адаптировать(Знач Зн, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы)
//	Тип = ТипЗнч(Зн);
//	Если      Тип = Тип("Структура") Тогда
//		Рез = Новый Структура;
//		Для Каждого Стр Из Зн Цикл
//			Рез.Вставить(Стр.Ключ, Адаптировать(Стр.Значение, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
//		КонецЦикла;
//		
//	ИначеЕсли Тип = Тип("Массив") Тогда
//		Рез = Новый Массив;
//		Для Каждого Стр Из Зн Цикл
//			Рез.Добавить(Адаптировать(Стр, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
//		КонецЦикла;
//		
//	Иначе
//		Рез = Зн;
//		
//		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
//			Соо = СоответствияОбъектов.Получить(Рез);
//			Если Соо <> Неопределено Тогда
//				Рез = Соо;
//			КонецЕсли;
//		КонецЕсли;
//		
//		
//		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
//		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
//		
//		Если Смв = "#" И УИД <> "" Тогда // Ссылка
//			Пустое = Типы.Получить(ТипУИД);
//			Если Пустое = Неопределено Тогда
//				Если НаружуИстинаВнутрьЛожь = Истина Тогда // Наружу
//					ТипСтр = СтрТипЗнч(Рез);
//					Пустое = Подключение.ОбменДаннымиПереопределяемый.СтрокаПустогоЗначения(ТипСтр);
//				Иначе
//					ТипСтр = Подключение.ОбменДаннымиПереопределяемый.СтрТипЗнч(Рез);
//					Пустое = СтрокаПустогоЗначения(ТипСтр);
//				КонецЕсли;
//				Типы.Вставить(ТипУИД, Пустое);
//			КонецЕсли;
//			
//			СтрокаВнутрАнализ(Пустое,, ТипУИД, КодУИД, );
//			
//			Рез = СтрокаВнутрСинтез(Смв, ТипУИД, КодУИД, УИД);
//		КонецЕсли;
//		
//		
//		Если НаружуИстинаВнутрьЛожь = Истина И СоответствияОбъектов <> Неопределено Тогда
//			Соо = СоответствияОбъектов.Получить(Рез);
//			Если Соо <> Неопределено Тогда
//				Рез = Соо;
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;
//	Возврат Рез;
//КонецФункции 

&НаКлиенте
Процедура ОтчетТипыДанных(Команда)
	ОтчетТипыДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтчетПоОбъектНеНайденНаСервере()
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦТ_ОбъектыОбмен.ОбъектВнутр) КАК ОбъектВнутр,
	|	ЦТ_ОбъектыОбмен.ТипОбъекта КАК ТипОбъекта,
	|	ЦТ_ОбъектыОбмен.БылВосстановлен КАК БылВосстановлен
	|ИЗ
	|	РегистрСведений.ЦТ_ОбъектыОбмен КАК ЦТ_ОбъектыОбмен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦТ_ОбъектыОбмен.ТипОбъекта,
	|	ЦТ_ОбъектыОбмен.БылВосстановлен
	|
	|УПОРЯДОЧИТЬ ПО
	|	БылВосстановлен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокОбъектов.Очистить();
	ТвояОбласть    = СписокОбъектов.ПолучитьОбласть();
	к=2;
	ТвояОбласть.Область(1,1,1,1).Текст =  "ОбъектВнутр";
	ТвояОбласть.Область(1,2,1,2).Текст =  "ТипОбъекта";
	ТвояОбласть.Область(1,3,1,3).Текст =  "БылВосстановлен";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТвояОбласть.Область(к,1,к,1).Текст =  ВыборкаДетальныеЗаписи.ОбъектВнутр;
		ТвояОбласть.Область(к,2,к,2).Текст =  ВыборкаДетальныеЗаписи.ТипОбъекта;
		ТвояОбласть.Область(к,3,к,3).Текст =  ВыборкаДетальныеЗаписи.БылВосстановлен;
		к=к+1;
	КонецЦикла;
	СписокОбъектов.Вывести(ТвояОбласть);

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОбъектНеНайден(Команда)
	ОтчетПоОбъектНеНайденНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьПоРегистраторуНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудников.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|ГДЕ
		|	ЕСТЬNULL(КадроваяИсторияСотрудников.Регистратор.Сотрудник, 0) = 0
		|	И КадроваяИсторияСотрудников.Регистратор ССЫЛКА Документ.Увольнение";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.КадроваяИсторияСотрудников.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор); 
		НаборЗаписей.Записать();
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоРегистратору(Команда)
	УдалитьПоРегистраторуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	ПометитьНаУдалениеСервер();
КонецПроцедуры

#КонецОбласти