&НаКлиенте
Перем КэшКомСоединение;
&НаКлиенте
Перем КэшТипы;   

&НаКлиенте
Перем КэшСоответствияОбъектовИнформационныхБаз;


&НаКлиенте
Функция ПолучитьКомСоединение()
	Если КэшКомСоединение <> Неопределено Тогда
		Возврат КэшКомСоединение;
	КонецЕсли;
	
	Попытка
		КэшКомСоединение = ПолучитьФорму("ВнешняяОбработка.COMСоединение.Форма");
		Возврат КэшКомСоединение;
	Исключение
		Сообщить("Ошибка открытия формы ""COM Соединение""" + Символы.ПС + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ПолучитьПодключение()
	КомСоединение = ПолучитьКомСоединение();
	Возврат КомСоединение.ПолучитьПодключение();
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствияОбъектов()
	Если  КэшСоответствияОбъектовИнформационныхБаз<>Неопределено Тогда
	    Возврат  КэшСоответствияОбъектовИнформационныхБаз;
	КонецЕсли;
	
	КомСоединение = ПолучитьКомСоединение();
	Возврат КомСоединение.ПолучитьСоответствияОбъектов();
КонецФункции

&НаСервереБезКонтекста
Процедура МассивИзВыборки(Выб, ИзВнутр = Истина)
	Если Выб.Результат = "Количество" Тогда
		Кол = 0;
		Если Не Выб.Выборка.Количество() = 0 Тогда
			Кол = Выб.Выборка[0][0];
		КонецЕсли;
		Если ИзВнутр Тогда
			Кол = ЗначениеИзСтрокиВнутр(Кол);
		КонецЕсли;
		Если Кол = NULL Тогда
			Кол = 0;
		КонецЕсли;
		Выб.Вставить("Количество", Кол);
		Возврат;
	КонецЕсли;
	
	Кол = Выб.Поля.Количество();
	Тип = Выб.Тип; Вид = Выб.Вид;
	Измерения = Выб.Поля;
	сИзмерения = СтрСоединить(Измерения, ",");
	Отбор = Новый Структура(сИзмерения);
	
	Поля = Новый Соответствие; Сч = 0;
	Для Каждого Поле Из Поля Цикл
		Поля.Вставить(Поле, Сч);
		Сч = Сч + 1;
	КонецЦикла;
	
	Если      Тип = "РегистрыСведений" Тогда
		Рег = РегистрыСведений;
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		Рег = РегистрыНакопления;
	КонецЕсли;
	
	Рез = Новый Массив;
	
	Для Каждого ТекСтр Из Выб.Выборка Цикл
		Если Тип = "Последовательности" Тогда
			Отбор = Новый Структура(сИзмерения);
		КонецЕсли;
		
		Флаг = Ложь;
		
		Для Сч = 0 По Кол - 1 Цикл
			Поле = ТекСтр[Сч];
			Если ИзВнутр Тогда
				Поле = ЗначениеИзСтрокиВнутр(Поле);  
				ПроверкаНаБитуюСсылку(Поле,Флаг);
			КонецЕсли;
			
			Если Тип = "РегистрыСведений"
			 Или Тип = "РегистрыНакопления"
			 Или Тип = "Последовательности"
			Тогда
				Отбор[Измерения[Сч]] = Поле;
			Иначе
				Значение = Поле; // Ссылка
			КонецЕсли;
		КонецЦикла;
		
		Если Тип = "РегистрыСведений"
		 Или Тип = "РегистрыНакопления"
		Тогда
			Значение = Рег[Вид].СоздатьКлючЗаписи(Отбор);
			Если Тип = "РегистрыСведений" И Вид = "РасчетПоказателейОтложенногоНалога" Тогда
				Значение = Отбор.Регистратор;
			КонецЕсли;
		ИначеЕсли Тип = "Последовательности" Тогда
			Значение = Отбор;
		КонецЕсли;
		
		Если Флаг Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Рез.Добавить(Значение);
	КонецЦикла;
	
	Выб.Вставить("Результат", Рез);
КонецПроцедуры

 &НаСервереБезКонтекста
Процедура ПроверкаНаБитуюСсылку(Поле, Флаг) 
	  
	  Попытка
		  Стр = Строка(Поле); 
		  
		  Если СтрНайти(Стр,"<Объект не найден>")>0 Тогда
			  
			  Флаг =  Истина	
			  
		  КонецЕсли;   
		  
	  Исключение
		   Сообщение = Новый СообщениеПользователю;
		   Сообщение.Текст =  ОписаниеОшибки();
		   Сообщение.Сообщить();
	  КонецПопытки;   
	  
 КонецПроцедуры // ПроверкаНаБитуюСсылку()
 

#Если НаКлиенте Тогда // Функция одновременно на клиенте и на сервере )))
&НаКлиенте
Функция МДИзмерения(Знач Внешняя, Подключение, Тип, Вид)
	Внешняя = Ложь;
	Если Не Внешняя Тогда
		Возврат МДНаСервере(Тип, Вид, ВыборкаПроведенные,ПометкаУдаления);
	КонецЕсли;
	#Если НаКлиенте И НаСервере Тогда // Никогда
	КонецФункции
	#КонецЕсли
#Иначе
&НаСервереБезКонтекста
Функция МДНаСервере(Тип, Вид, ВыборкаПроведенные,ПометкаУдаления)
#КонецЕсли
	
	мИзмерения = Новый Массив;
	
	Если      Тип = "Константы" Тогда
		//Если Внешняя Тогда // ? Запрос ?
		//	Возврат Подключение.Константы[Вид].Получить();
		//Иначе
		//	Возврат Подключение.Константы[Вид].Получить();
		//КонецЕсли;
	ИначеЕсли Тип = "Справочники" Или Тип = "Документы" Или Тип = "ПланыВидовХарактеристик" Тогда
		
		мИзмерения.Добавить("Ссылка");
		
		Если Тип = "Документы"  Тогда
			Если  ВыборкаПроведенные Тогда
				//мИзмерения.Добавить("Проведен");
			КонецЕсли;
		КонецЕсли;
		
		Если Тип = "Справочники" Тогда 
			 Если  ПометкаУдаления Тогда
				мИзмерения.Добавить("ПометкаУдаления");
			КонецЕсли;		
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыСведений" Тогда
		#Если НаКлиенте Тогда
			МД = Подключение.Метаданные[Тип][Вид];
			Независимый = Подключение.Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Подключение.Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		#Иначе
			МД = Метаданные[Тип][Вид];
			Независимый = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		#КонецЕсли
		
		Для Каждого ТекИзм Из МД.Измерения Цикл
			Если Тип = "РегистрыСведений" И Не ТекИзм.ОсновнойОтбор Тогда
				Продолжить;
			КонецЕсли;
			мИзмерения.Добавить(ТекИзм.Имя);
		КонецЦикла;
		
		Если Тип = "РегистрыСведений" Тогда
			Если Не МД.РежимЗаписи = Независимый Тогда
				мИзмерения.Добавить("Регистратор");
			КонецЕсли;
			Если МД.ПериодичностьРегистраСведений <> Непериодический Тогда
				мИзмерения.Добавить("Период");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		мИзмерения.Добавить("Регистратор");
		
	ИначеЕсли Тип = "Последовательности" Тогда
		мИзмерения.Добавить("Организация"); // ?
		мИзмерения.Добавить("Регистратор");
		мИзмерения.Добавить("Период");
		мИзмерения.Добавить("МоментВремени");
		мИзмерения.Добавить("СостояниеПроведения");
		
	КонецЕсли;

	Возврат мИзмерения;
КонецФункции

&НаКлиенте
Функция ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры)
	мУсловие = Новый Массив;
	Если Тип = "РегистрыСведений" И Вид = "СоответствияОбъектовИнформационныхБаз" Тогда
		мУсловие.Добавить("УзелИнформационнойБазы В (" + ПолучитьКомСоединение().ТекстЗапросаПланОбмена() + ")");
		Если СоответствияРазные Тогда
			мУсловие.Добавить("УникальныйИдентификаторПриемника <> УникальныйИдентификаторИсточникаСтрокой");
		КонецЕсли;
	КонецЕсли;
	
	Если Тип = "Документы" Тогда
		Если ЗначениеЗаполнено(ВыборкаПериод) Тогда
			мУсловие.Добавить("Дата Между &НачалоПериода И &КонецПериода");
			ЗапросПараметры.Вставить("НачалоПериода", ВыборкаПериод.ДатаНачала);
			ЗапросПараметры.Вставить("КонецПериода" , КонецДня(ВыборкаПериод.ДатаОкончания));
		КонецЕсли;
		Если ВыборкаПроведенные Тогда
			мУсловие.Добавить("Проведен");
		КонецЕсли;
		Если ВыборкаНеПроведенные Тогда
			мУсловие.Добавить("Не Проведен");
		КонецЕсли;
	КонецЕсли;
	
	
	Если РеквОрг <> Неопределено И РеквОрг <> "" Тогда
		Если ОргИД = "" Тогда
			мУсловие.Добавить(РеквОрг + " = &Организация");
		Иначе
			ПлюсПустая = Ложь;
			Если (Тип = "Справочники" И Вид = "СтатьиЗатрат")
			 Или (Тип = "Справочники" И Вид = "ПрочиеДоходыИРасходы")
			 Или (Тип = "Справочники" И Вид = "Календари")
			 Или (Тип = "РегистрыСведений" И Вид = "СтатьиЗатратПоЗарплате")
			Тогда
				ПлюсПустая = Истина;
			КонецЕсли;
			
			мУсловие.Добавить(
				РеквОрг + " В ИЕРАРХИИ(&Организация)"
				+ ?(ПлюсПустая, " Или " + РеквОрг + " = Значение(Справочник.Организации.ПустаяСсылка)", "")
			);
		КонецЕсли;
		ЗапросПараметры.Вставить("Организация", ОргИД);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Рекурсия) Тогда
		мИЛИ = Новый Массив;
		Сч = 0;
		Для Каждого Усл Из СтрРазделить(Рекурсия, ",", Ложь) Цикл
			Сч = Сч + 1;
			мРавно = СтрРазделить(Усл, "=", Ложь);
			мТипВид = СтрРазделить(мРавно[1], ".", Ложь);
			
			мИЛИ.Добавить(мРавно[0] + " В (&Значения" + Сч + ")");
			
			Значения = ОбъектыВыборка(Истина, мТипВид[0], мТипВид[1], РеквОрг, ОргИд);
			ЗапросПараметры.Вставить("Значения" + Сч, Значения);
		КонецЦикла;
		мУсловие.Добавить("(" + СтрСоединить(мИЛИ, Символы.ПС + " ИЛИ ") + ")");
		
		
	КонецЕсли;
	
	Если мУсловие.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат " "
			+ "ГДЕ" + Символы.ПС
			+ СтрСоединить(мУсловие, Символы.ПС + "И ")
			+ Символы.ПС
		;
КонецФункции

&НаКлиенте
Процедура СтрокаВнутрАнализ(СтрВн, Смв = "", Тип = "", Код = "", УИД = "")
	Смв = ""; Тип = ""; Код = ""; УИД = "";
	
	мСтр = СтрРазделить(Сред(СтрВн, 2, СтрДлина(СтрВн) - 2), ",", Истина);
	КолВо = мСтр.Количество();
	
	Смв = Сред(мСтр[0], 2, 1);
	
	Если КолВо < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Тип = мСтр[1];
	
	Если КолВо < 3 Тогда
		Возврат;
	КонецЕсли;
	
	мКодУИД = СтрРазделить(мСтр[2], ":", Истина);
	Код = мКодУИД[0];
	УИД = мКодУИД[1];
КонецПроцедуры
	
&НаКлиенте
Функция СтрокаВнутрСинтез(Смв, Тип, Код, УИД)
	Возврат "{"
		+ """" + Смв + """" + ","
		+ Тип + ","
		+ Код + ":"
		+ УИД
		+ "}"
	;
КонецФункции

&НаСервереБезКонтекста
Функция СтуктураВИзСтрокиВнутр(Зн, ВИстинаИзЛожь)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, СтуктураВИзСтрокиВнутр(Стр.Значение, ВИстинаИзЛожь));
		КонецЦикла;
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(СтуктураВИзСтрокиВнутр(Стр, ВИстинаИзЛожь));
		КонецЦикла;
	Иначе
		Рез = ?(ВИстинаИзЛожь, ЗначениеВСтрокуВнутр(Зн), ЗначениеИзСтрокиВнутр(Зн));
	КонецЕсли;
	Возврат Рез;
КонецФункции  

Функция СтуктураВИзСтрокиВнутрНорм(Зн)
	//Тип = ТипЗнч(Зн);
	//Если      Тип = Тип("Структура") Тогда
	//	Рез = Новый Структура;
	//	Для Каждого Стр Из Зн Цикл
	//		Рез.Вставить(Стр.Ключ, СтуктураВИзСтрокиВнутр(Стр.Значение, ВИстинаИзЛожь));
	//	КонецЦикла;
	//ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Для Каждого мСтр Из Стр Цикл
				Если мСтр = "{""B"",0}" Тогда
					Продолжить;	
				КонецЕсли;
				Рез.Добавить(ЗначениеИзСтрокиВнутр(мСтр));	
			КонецЦикла;
			
		КонецЦикла;
	//Иначе
	//	Рез = ?(ВИстинаИзЛожь, ЗначениеВСтрокуВнутр(Зн), ЗначениеИзСтрокиВнутр(Зн));
	//КонецЕсли;
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция Адаптировать(Знач Зн, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, Адаптировать(Стр.Значение, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
		КонецЦикла;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(Адаптировать(Стр, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
		КонецЦикла;
		
	Иначе
		Рез = Зн;
		
		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
		
		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
		
		Если Смв = "#" И УИД <> "" Тогда // Ссылка
			Пустое = Типы.Получить(ТипУИД);
			Если Пустое = Неопределено Тогда
				Если НаружуИстинаВнутрьЛожь = Истина Тогда // Наружу
					ТипСтр = СтрТипЗнч(Рез);
					Пустое = Подключение.ОбменДаннымиПереопределяемый.СтрокаПустогоЗначения(ТипСтр);
				Иначе
					ТипСтр = Подключение.ОбменДаннымиПереопределяемый.СтрТипЗнч(Рез);
					Пустое = СтрокаПустогоЗначения(ТипСтр);
				КонецЕсли;
				Типы.Вставить(ТипУИД, Пустое);
			КонецЕсли;
			
			СтрокаВнутрАнализ(Пустое,, ТипУИД, КодУИД, );
			
			Рез = СтрокаВнутрСинтез(Смв, ТипУИД, КодУИД, УИД);
		КонецЕсли;
		
		
		Если НаружуИстинаВнутрьЛожь = Истина И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	Возврат Рез;
КонецФункции   

&НаКлиенте     
Функция АдаптироватьHTTP(Знач Зн, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, АдаптироватьHTTP(Стр.Значение, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(АдаптироватьHTTP(Стр, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	Иначе
		Рез = Зн;
		
		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
		
		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
		
		Если Смв = "#" И УИД <> "" Тогда // Ссылка
			Пустое = Типы.Получить(ТипУИД);
			Если Пустое = Неопределено Тогда
				Если НаружуИстинаВнутрьЛожь = Истина Тогда // Наружу
					ТипСтр = СтрТипЗнч(Рез);
					//Пустое = Подключение.ОбменДаннымиПереопределяемый.СтрокаПустогоЗначения(ТипСтр);
				Иначе
					тТипСтр = мТипы.Получить(ТипУИД); 
					Пустое = СтрокаПустогоЗначения(тТипСтр);
				КонецЕсли;
				Типы.Вставить(ТипУИД, Пустое);
			КонецЕсли;
			
			СтрокаВнутрАнализ(Пустое,, ТипУИД, КодУИД, );
			
			Рез = СтрокаВнутрСинтез(Смв, ТипУИД, КодУИД, УИД);
		КонецЕсли;
		
		
		Если НаружуИстинаВнутрьЛожь = Истина И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаКлиенте 
Функция АдаптироватьТипы(Знач Зн, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, АдаптироватьТипы(Стр.Значение, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
		КонецЦикла;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(АдаптироватьТипы(Стр, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы));
		КонецЦикла;
		
	Иначе
		Рез = Зн;
		
		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
		
		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
		
		Если Смв = "#" И УИД <> "" Тогда // Ссылка
			Пустое = Типы.Получить(ТипУИД);
			Если Пустое = Неопределено Тогда
				ТипСтр =СтрТипЗнч(Рез);
				Пустое = СтрокаПустогоЗначения(ТипСтр);
				Типы.Вставить(ТипУИД, ТипСтр);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Типы;
КонецФункции

&НаКлиенте
Функция СинтезТипов(Результат)
	
	Типы = Новый Соответствие;   
	НаружуИстинаВнутрьЛожь  = Ложь;
	Подключение = Неопределено;
	СоответствияОбъектов  =Неопределено;
	
	Типы = АдаптироватьТипы(Результат, НаружуИстинаВнутрьЛожь, Подключение, СоответствияОбъектов, Типы); 
	
	тРезультат = Новый Массив;
	Для Каждого КлючЗначение Из Типы Цикл
		кРезультат = Новый Массив;
		кРезультат.Добавить(КлючЗначение.Ключ);
		кРезультат.Добавить(КлючЗначение.Значение); 
		тРезультат.Добавить(кРезультат);	
	КонецЦикла;	
	возврат тРезультат;
КонецФункции

&НаСервереБезКонтекста
Функция СтрТипЗнч(ЗнчСтр) Экспорт
	Знч = ЗначениеИзСтрокиВнутр(ЗнчСтр);
	Тип = ТипЗнч(Знч);
	Возврат XMLТип(Тип).ИмяТипа;
КонецФункции

&НаКлиенте
Функция ВыполнитьЗапросВнешний(ЗапросТекст, Поля, ЗапросПараметры, АдаптироватьПоСоответствиям = Истина)
	
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	Если поHTTP  Тогда
		СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
		//ЗапросПараметрыВнешний = АдаптироватьHTTP(ЗапросПараметрыВнешний, Истина, СоответствияОбъектов, КэшТипы.Наружу,мТипы);
		
		// Получение данных из базы-приемника
		ДанныеЗапроса = Новый Структура();   
		ДанныеЗапроса.Вставить("ЗапросПараметры",ЗапросПараметры);
		ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
		ДанныеЗапроса.Вставить("Поля",Поля);

		//ЗаполнитьЗначенияСвойств(ДанныеЗапроса, ЭтаФорма);
		
		Путь = "";
		Рез  = ЗапросКБазеПриемнику("V1/Список", ДанныеЗапроса, Путь);
		Выб  = Рез[0];
		мТипы = новый Соответствие;
		тВыб = Рез[1]; 
		Для каждого стр Из тВыб Цикл
				 мТипы.Вставить( стр[0], стр[1]);
		КонецЦикла;
		
		Если Выб = Неопределено Тогда
		КонецЕсли;
	Иначе 
		Подключение = ПолучитьПодключение();
		СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
		ЗапросПараметрыВнешний = Адаптировать(ЗапросПараметрыВнешний, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу);
		Выб = Подключение.ОбменДаннымиПереопределяемый.ВыполнитьЗапрос(ЗапросТекст,ЗапросПараметры, Поля);    //ЗапросПараметрыВнешний
	КонецЕсли;
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мСтр = Новый Массив;
		Для Каждого Зн Из ТекСтр Цикл
			мСтр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(мСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	
	
	Если поHTTP  Тогда
		мРезультат = АдаптироватьHTTP(мРезультат, Ложь, СоответствияОбъектов, КэшТипы.Внутрь,мТипы);
	Иначе 
		мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);
	КонецЕсли;
	
	Возврат мРезультат;
КонецФункции

&НаКлиенте
Функция СделатьВыборкуВнешний(Рез, ЗапросТекст, ЗапросПараметры, Внутр = Ложь, АдаптироватьПоСоответствиям = Истина)
	Рез.Вставить("Выборка",
		ВыполнитьЗапросВнешний(ЗапросТекст, Рез.Поля, ЗапросПараметры, АдаптироватьПоСоответствиям)
	);
	
	Если Не Внутр Тогда
		МассивИзВыборки(Рез);
	КонецЕсли;
КонецФункции
	
&НаСервереБезКонтекста
Функция ВыполнитьЗапрос(ЗапросТекст, Поля, ЗапросПараметры, Внутр)
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;
	
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Ключ = ТекПар.Ключ;
		Зн = ТекПар.Значение;
		
		Если Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда // Орг
			Зн = Орг(Зн);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Ключ, Зн);
	КонецЦикла;
	
	Попытка
	
		Выборка = Запрос.Выполнить().Выбрать();	
	
	Исключение
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЗапросТекст;
		//Сообщение.Поле = "";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
	КонецПопытки;
	
	
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из Поля Цикл
			Зн = Выборка[Изм];
			Если Внутр Тогда
				Если ТипЗнч(Выборка[Изм]) = Тип("УникальныйИдентификатор") Тогда
					Зн1 = Строка(Выборка[Изм]);   
					Зн = ЗначениеВСтрокуВнутр(Зн1);
				Иначе 	
					Зн = ЗначениеВСтрокуВнутр(Зн);
				КонецЕсли;
				
			КонецЕсли;
			Стр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла;
	
	Возврат мРезультат;
КонецФункции
	
&НаСервереБезКонтекста
Функция СделатьВыборку(Рез, ЗапросТекст, ЗапросПараметры, Внутр = Ложь)
	
	Рез.Вставить("Выборка",
		ВыполнитьЗапрос(ЗапросТекст, Рез.Поля, ЗапросПараметры, Внутр)
	);
	
	Если Не Внутр Тогда
		МассивИзВыборки(Рез, Ложь);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ТипСсылкиВСтроку(Зн) Экспорт
	СтрЗнч = ЗначениеВСтрокуВнутр(Зн);
	Если Лев(СтрЗнч, 5) <> "{""#""," Тогда
		Возврат "";
	КонецЕсли;
	
	Тип = ТипЗнч(Зн);
	Возврат XMLТип(Тип).ИмяТипа;
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаИзУИД(ТипСтр, УИД)
	Возврат XMLЗначение(Тип(ТипСтр), УИД);
КонецФункции

&НаСервереБезКонтекста
Функция ПустоеЗначение(Знач Тип) Экспорт
	Если Тип =  "DocumentRef.Трансляция" или Тип = "DocumentRef.ТрансформационнаяКорректировка" Тогда
	 	Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		ТипСтр = Тип;
		Тип = Тип(Тип);
	Иначе // Тип
		ТипСтр = XMLТип(Тип).ИмяТипа;
	КонецЕсли;
	
	ТипСтр = СтрРазделить(ТипСтр, ".")[0];
	
	Если      ТипСтр = "EnumRef" Тогда
		Возврат XMLЗначение(Тип, "");
	Иначе//Если СтрТип = "CatalogRef" Тогда
		Возврат XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция СтрокаПустогоЗначения(Знач Тип) Экспорт
	Возврат ЗначениеВСтрокуВнутр(ПустоеЗначение(Тип));
КонецФункции
	
&НаКлиенте
Функция СтрокаИзУИД(Знач Стр)
	
	
	//// ???????????????????
	
		// 123456789012345678901234567890123456
		// 1435823d-b0b3-11ec-9871-0050568d2260
		// 98710050568d226011ecb0b31435823d
		Стр = ""
			+ Сред(Стр, 20,  4)
			+ Сред(Стр, 25, 12)
			+ Сред(Стр, 15,  4)
			+ Сред(Стр, 10,  4)
			+ Сред(Стр,  1,  8)
		;
	
	
	Возврат Стр;
КонецФункции

&НаКлиенте
Функция УИДИзСтроки(Знач Стр)
	Стр = Сред(Стр, 2, СтрДлина(Стр) - 2);
	Стр = СтрРазделить(Стр, ",", Истина);
	Стр = Стр[2];
	Стр = Сред(Стр, СтрНайти(Стр, ":") + 1);
	// 12345678901234567890123456789012
	// a7a1c69a2240a3ee11ec90c8c4a3db7a
	// c4a3db7a-90c8-11ec-a7a1-c69a2240a3ee
	Стр = ""
		+ Сред(Стр, 25,  8) + "-"
		+ Сред(Стр, 21,  4) + "-"
		+ Сред(Стр, 17,  4) + "-"
		+ Сред(Стр,  1,  4) + "-"
		+ Сред(Стр,  5, 12)
	;
	Возврат Стр;
КонецФункции

&НаСервереБезКонтекста
Функция Орг2(Знач ИД)
	Если      ИД = "" Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	ИначеЕсли ИД = "ОЭ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "07e4439f-5297-11ec-8d39-b89a2ab8c2ce");
	ИначеЕсли ИД = "ТЭ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "57e44974-0fc5-11e7-8cb3-40490f86beb6");
	ИначеЕсли ИД = "ТБ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "72ec8356-e68a-11ee-a6ef-00505601b51a");
	ИначеЕсли ИД = "СО" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "0304d402-390c-11e6-8845-000c29c0d2ee");
	ИначеЕсли ИД = "ГС" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "8030c21a-e8b2-11ec-98d4-50ebf64365f0");
	ИначеЕсли ИД = "НН" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "99ac51cb-b4e1-11ec-8d50-b89a2ab8c2ce");
	//ИначеЕсли ИД = "ДД+" Тогда
	//	Рез = Новый Массив;
	//	Рез.Добавить(Орг("ДД_ИС"));
	//	Рез.Добавить(Орг("ДД_МЦП"));
	//	Рез.Добавить(Орг("ДД_ТЗ"));
	//	Возврат Рез;
	ИначеЕсли ИД = "АЛ" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "c01f7687-df56-11ed-8421-b42e99d5aa06");  
	ИначеЕсли ИД = "CH" Тогда
		Возврат XMLЗначение(Тип("CatalogRef.Организации"), "8a08d01c-679e-11ef-a6fb-00505601b51a"); 	
		
	//ИначеЕсли ИД = "ТОТ" Тогда
	//	Возврат XMLЗначение(Тип("CatalogRef.Организации"), "e0b25d3d-8a8c-11e8-8008-000c2954055e");
	//ИначеЕсли ИД = "ТОТ_К" Тогда
	//	Возврат XMLЗначение(Тип("CatalogRef.Организации"), "888df512-66eb-11ec-80d8-005056014a17");
	//ИначеЕсли ИД = "ДЛГ" Тогда
	//	Возврат XMLЗначение(Тип("CatalogRef.Организации"), "3e14e9d9-8a8d-11e8-8008-000c2954055e");
	КонецЕсли;
	Возврат Неопределено; 
КонецФункции   

&НаСервереБезКонтекста
Функция Орг(Знач ИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EMS_КодСопоставленияОрганизации.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.EMS_КодСопоставленияОрганизации КАК EMS_КодСопоставленияОрганизации
		|ГДЕ
		|	EMS_КодСопоставленияОрганизации.Code = &Code";
	
	Запрос.УстановитьПараметр("Code", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат XMLЗначение(Тип("CatalogRef.Организации"),ВыборкаДетальныеЗаписи.ГУИД); 
	КонецЦикла;
	
 	Возврат Неопределено; 
КонецФункции  

&НаКлиенте
Процедура СообщитьМассив(Выб)
	//ОчиститьСообщения();
	Если ВыборкаРезультат = "Количество" Тогда
		Сообщить("Количество = " + Выб);
	Иначе
		Сообщить("Массив (" + Выб.Количество() + ")");
		//Для Каждого Зн Из Выб Цикл
		//	Если ТипЗнч(Зн) = Тип("Массив") Тогда
		//		Соо = "";
		//		Для Каждого ПодЗн Из Зн Цикл
		//			Соо = Соо + ПодЗн + " | ";
		//		КонецЦикла;
		//		Сообщить(Соо);
		//	Иначе
		//		Сообщить(Зн);
		//	КонецЕсли;
		//КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьМассивСтроку(Знач мСтр, Пре)
	Сооб = "";
	Сооб = Пре + "|";
	Для Каждого Стр Из мСтр Цикл
		Зн = ЗначениеИзСтрокиВнутр(Стр);
		Попытка  
			Если ТипЗнч(Зн)  = Тип("Строка") 
				или  ТипЗнч(Зн)  = Тип("Булево")
				или  Зн = Null
				Тогда
				Уид = "";  	
			Иначе 
				Уид = Зн.УникальныйИдентификатор();
			КонецЕсли;
		Исключение
			Уид = "";
		КонецПопытки;
		
		Сооб = Сооб
			+ Зн  + ","
			+ Уид + ","
			+ Стр + "|"
		;
	КонецЦикла;
	Сообщить(Сооб);
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура СообщитьМассивСтрокуЗн(Знач мСтр, Пре)
	Сооб = "";
	Сооб = Пре + "|";
	Для Каждого Стр Из мСтр Цикл
		Зн = ЗначениеИзСтрокиВнутр(Стр);
				
		Сооб = Сооб
			+ Зн  + ","
			+ "|"
		;
	КонецЦикла;
	Сообщить(Сооб);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоответствияПрочитатьЗаписатьНаСервере(ДействиеЗаписать, Выб, УзелТекстЗапроса)
	Запрос = Новый Запрос(УзелТекстЗапроса);
	Узел = Запрос.Выполнить().Выгрузить()[0].Узел;
	
	МЗ = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьМенеджерЗаписи();
	Стр = Новый Структура(
		"УзелИнформационнойБазы, "
		+ "ТипИсточника, УникальныйИдентификаторИсточника, УникальныйИдентификаторИсточникаСтрокой, "
		+ "ТипПриемника, УникальныйИдентификаторПриемника",
		Узел
	);
	
	Сч = 0;
	Для Каждого Зн Из Выб Цикл
		Сч = Сч + 1;
		
		ТипПриемника = Зн.ТипИсточника;
		УИДПриемника = "" + Зн.УникальныйИдентификаторИсточника.УникальныйИдентификатор();
		СлкПриемника = СсылкаИзУИД(ТипПриемника, УИДПриемника);
		
		ТипИсточника = Зн.ТипПриемника;
		УИДИсточника = Зн.УникальныйИдентификаторПриемника;
		СлкИсточника = СсылкаИзУИД(ТипИсточника, УИДИсточника);
		
		Стр.ТипИсточника = ТипИсточника;
		Стр.УникальныйИдентификаторИсточника = СлкИсточника;
		Стр.УникальныйИдентификаторИсточникаСтрокой = УИДИсточника;
		
		Стр.ТипПриемника = ТипПриемника;
		Стр.УникальныйИдентификаторПриемника = УИДПриемника;
		
		Если Не ДействиеЗаписать Тогда
			ЗаполнитьЗначенияСвойств(МЗ, Стр);
			МЗ.Прочитать();
			Если Не МЗ.Выбран() Тогда
				Сообщить("Не выбран: " + СлкИсточника);
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(МЗ, Стр);
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(МЗ, Стр);
			МЗ.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПрочитатьЗаписать(Команда)
	Если Вопрос("Выполнить обработку соответствий?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, , ) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеЗаписать = Команда.Имя = "СоответствияЗаписать";
	
	ОчиститьСообщения();
	
	Выб = ОбъектыВыборка(Истина, "РегистрыСведений", "СоответствияОбъектовИнформационныхБаз",,,,,, Ложь);
	
	СоответствияПрочитатьЗаписатьНаСервере(ДействиеЗаписать, Выб, ПолучитьКомСоединение().ТекстЗапросаПланОбмена());
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Лево = Истина, Право = Истина, Индекс = 0, Сообщать = Ложь)
	
	Сообщать = ВыводитьСообщение;
	
	Если Сообщать Тогда
		ОчиститьСообщения();
		Сообщить("Л " + соЛокал.Количество() + ", В " + соВнешн.Количество());
	КонецЕсли;
	
	соРазница = Новый Соответствие;
	мРазница = Новый Соответствие;  
	мКлючЗаписиРС = Новый Массив;
	//	Состояние("Внутренний запрос - сравнение");
	Если ЗначениеЗаполнено(СтрокаВнтурПредставление) Тогда
		Сообщать = ложь;
	КонецЕсли; 
	
	Если Лево Тогда
		Для Каждого Стр Из соЛокал Цикл
			Если соВнешн.Получить(Стр.Ключ) = Неопределено Тогда
				мСтр = Стр.Значение;
				Если Сообщать Тогда
					Если УпрощенныйВывод Тогда
					 СообщитьМассивСтрокуЗн(мСтр, "Л<В");
					Иначе 	
					 СообщитьМассивСтроку(мСтр, "Л<В");
					КонецЕсли;
				КонецЕсли;   
				Если Индекс = Неопределено Тогда
				  мКлючЗаписиРС.Добавить(Стр.Значение);   
				Иначе 	
				   соРазница.Вставить(мСтр[Индекс]); 
				КонецЕсли;
				//Если   СтрНайти(мСтр[2],СтрокаВнтурПредставление)>0 Тогда
				//	СообщитьМассивСтрокуЗн(мСтр, "Л<В");
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
//	Состояние("Внешний запрос - сравнение");
	Если Право Тогда
		Для Каждого Стр Из соВнешн Цикл
			Если соЛокал.Получить(Стр.Ключ) = Неопределено Тогда
				мСтр = Стр.Значение;
				Если Сообщать Тогда
					Если УпрощенныйВывод Тогда
					  СообщитьМассивСтрокуЗн(мСтр, "В<Л");
					Иначе 	
					 СообщитьМассивСтроку(мСтр, "В<Л");
					КонецЕсли;
				КонецЕсли;
				//Если    СтрНайти(мСтр[2],СтрокаВнтурПредставлениеВнеш)>0   Тогда
				//	СообщитьМассивСтрокуЗн(мСтр, "В<Л");
				//КонецЕсли; 
				Если Индекс = Неопределено Тогда
				  мКлючЗаписиРС.Добавить(Стр.Значение);      
				Иначе 
				соРазница.Вставить(мСтр[Индекс]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
//	Рез = МассивРазниц(соРазница);
	Рез = Новый Массив;
	Для Каждого Стр Из соРазница Цикл
		мСтр = Новый Массив;
		мСтр.Добавить(Стр.Ключ);
//		Зн = Стр.Ключ;
//		Зн = ЗначениеИзСтрокиВнутр(Зн);
		Рез.Добавить(мСтр);
	КонецЦикла; 
	
	Если мКлючЗаписиРС.Количество()>0   Тогда
		 Возврат мКлючЗаписиРС;
	КонецЕсли;
	
	Если Сообщать Тогда
		Сообщить("Разниц: " + Рез.Количество());
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция ПолучитьКлючиСтр(Внешн, ИнС = Неопределено) Экспорт
	соВнешн = Новый Соответствие;
	//ИнС = Поля.Найти("ИдентификаторЗаписи");
	Для Каждого Стр Из Внешн Цикл
		Ключ = "";   
		сч = 0;
		Для Каждого Зн Из Стр Цикл  
			Если  ИнС = сч Тогда
				Продолжить;	
			КонецЕсли;
			
			Ключ = Ключ + Зн + ","; 
			сч = сч +1;
		КонецЦикла;
		
		соВнешн.Вставить(Ключ, Стр);
	КонецЦикла;
	
	Возврат соВнешн;
КонецФункции

&НаКлиенте
Функция ПолучитьРезультат(Текст, Поля, ЗапросПараметры, База, Результат = "Выборка", Лево = Ложь, Право = Истина, Индекс = 0, Сообщать = Ложь, Рез = Неопределено)
	Внутр = База <> "Локальная";
	
	Если База = "Локальная" // Внутренний запрос
	 Или База = "Разница"
	Тогда
		Локал = ВыполнитьЗапрос       (Текст, Поля, ЗапросПараметры, Внутр);
	КонецЕсли;
	
	Если База = "Внешняя" // Внешний запрос
	 Или База = "Разница"
	Тогда
		Внешн = ВыполнитьЗапросВнешний(Текст, Поля, ЗапросПараметры, Истина);
	КонецЕсли;
		
	Если      База = "Локальная" Тогда
		Выборка = Локал;
		
	ИначеЕсли База = "Внешняя"   Тогда
		Выборка = Внешн;
		
	ИначеЕсли База = "Разница" Тогда
				
		// Разница в составе субконто
		//ИнСчет = Поля.Найти("ИдентификаторЗаписи");
		ИнСбк1 = Поля.Найти("ИдентификаторЗаписи");
		//ИнСбк2 = Поля.Найти("Субконто2");
		//ИнСбк3 = Поля.Найти("Субконто3");
		
		//Для Каждого Стр Из Локал Цикл
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c205}" Тогда // 90.02.1
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли; 
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c163}" Тогда // 66.03
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли;  
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c170}" Тогда // 67.03
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли;
			
		//КонецЦикла;
		соЛокал = ПолучитьКлючиСтр(Локал,ИнСбк1);
		
		//Для Каждого Стр Из Внешн Цикл
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c205}" Тогда // 90.02.1
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли;
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c20e}" Тогда // 90.08.1
			//	Стр[ИнСбк2] = "{""L""}";
			//	Стр[ИнСбк3] = "{""L""}";
			//КонецЕсли;  
			//
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c163}" Тогда // 66.03 Деменко Андрей Николаевич  2 записи в рс соответствия 
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли;  
			//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,41:9bd9000c2954055e11e8845deff5c170}" Тогда // 67.03 Деменко Андрей Николаевич
			//	Стр[ИнСбк1] = "{""L""}";
			//КонецЕсли;

		//КонецЦикла;
		соВнешн = ПолучитьКлючиСтр(Внешн,ИнСбк1);
		
		Выборка = ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Лево, Право, Индекс, Сообщать);
		
	КонецЕсли;
	
	Если      Результат = "Выборка" Тогда

		Если Рез.Тип = "Справочники" или Рез.Тип = "Документы" или  Индекс <> Неопределено Тогда
			
			Если Внутр Тогда
				Выборка = СтуктураВИзСтрокиВнутрНорм(Выборка);
			КонецЕсли;  
			Возврат Выборка;
		Иначе 
			
			Возврат Выборка;	
		КонецЕсли;
		
	ИначеЕсли Результат = "Ссылки" Тогда
		соСсылки = Новый Соответствие;
		Для Каждого Стр Из Выборка Цикл
			Для Каждого Зн Из Стр Цикл
				ЭтоСсылка = Ложь;
				Если Внутр Тогда
					ЭтоСсылка = Лев(Зн, 5) = "{""#"",";
				Иначе
					Тип = ТипЗнч(Зн);
					ЭтоСсылка = Истина
						И Тип <> Тип("Число")
						И Тип <> Тип("Дата")
						И Тип <> Тип("Булево")
						И Тип <> Тип("Неопределено")
						И Тип <> Тип("NULL")
					;
				КонецЕсли;
				
				Если ЭтоСсылка Тогда
					соСсылки.Вставить(Зн, );
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Ссылки = Новый Массив;
		Для Каждого Зн Из соСсылки Цикл
			Ссылки.Добавить(Зн.Ключ);
		КонецЦикла;
		
		Если Внутр Тогда
			Ссылки = СтуктураВИзСтрокиВнутр(Ссылки, Ложь);
		КонецЕсли;
		
		Возврат Ссылки;
		
	ИначеЕсли Результат = "Количество" Тогда
		Возврат Выборка.Количество();
		
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ОбъектыВыборка(Внешняя, Тип, Вид, РеквОрг = Неопределено, ОргИД = Неопределено, Рекурсия = Неопределено,  Результат = "Выборка", Внутр = Ложь, АдаптироватьПоСоответствиям = Истина) Экспорт
	Если Внешняя Тогда
		 Подключение = ПолучитьПодключениеHTTPКлиент();
	КонецЕсли;
	
	Рез = Новый Структура("Тип, Вид, Результат, Внутр", Тип, Вид, Результат, Внутр);
	
	Если      Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	ИначеЕсли Тип = "РегистрыСведений" Тогда
		ТипЗапрос = "РегистрСведений";
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		ТипЗапрос = "РегистрНакопления";
	ИначеЕсли Тип = "ПланыВидовХарактеристик" Тогда
		ТипЗапрос = "ПланВидовХарактеристик";
	ИначеЕсли Тип = "Последовательности" Тогда
		ТипЗапрос = "Последовательность";
	КонецЕсли;
	
	Если Результат = "Количество" Тогда
		мИзмерения = Новый Массив;
		мИзмерения.Добавить("Количество");
	Иначе
		мИзмерения = МДИзмерения(Внешняя, Подключение, Тип, Вид);
	КонецЕсли;
	Рез.Вставить("Поля", мИзмерения);
	
	ЗапросТекст = 
		"ВЫБРАТЬ // Первые 100
		|	" + ?(Результат = "Количество", "Сумма(1) КАК Количество", СтрСоединить(мИзмерения, ", ")) + "
		|ИЗ
		|	" + ТипЗапрос + "." + Вид + "
		|";
	
	ЗапросПараметры = Новый Структура;
	
	ЗапросТекст = ЗапросТекст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);
	
	Если Внешняя Тогда
		СделатьВыборкуВнешний(Рез, ЗапросТекст, ЗапросПараметры, Внутр, АдаптироватьПоСоответствиям);
	Иначе
		СделатьВыборку       (Рез, ЗапросТекст, ЗапросПараметры, Внутр);
	КонецЕсли;
	
	Если Результат = "Количество" Тогда
		Возврат Рез.Количество;
	КонецЕсли;
	
	Если Не Внутр Тогда
		Возврат Рез.Результат;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция ОбъектыВыборкаОтбор(Внешняя, Тип, Вид, РеквОрг = Неопределено, ОргИД = Неопределено, Рекурсия = Неопределено,  Результат = "Выборка", Внутр = Ложь, АдаптироватьПоСоответствиям = Истина) Экспорт
	Если Внешняя Тогда
		 Подключение = ПолучитьПодключениеHTTPКлиент();
	КонецЕсли;
	
	Рез = Новый Структура("Тип, Вид, Результат, Внутр", Тип, Вид, Результат, Внутр);
	
	Если      Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	ИначеЕсли Тип = "РегистрыСведений" Тогда
		ТипЗапрос = "РегистрСведений";
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		ТипЗапрос = "РегистрНакопления";
	ИначеЕсли Тип = "ПланыВидовХарактеристик" Тогда
		ТипЗапрос = "ПланВидовХарактеристик";
	ИначеЕсли Тип = "Последовательности" Тогда
		ТипЗапрос = "Последовательность";
	КонецЕсли;
	
	Если Результат = "Количество" Тогда
		мИзмерения = Новый Массив;
		мИзмерения.Добавить("Количество");
	Иначе
		мИзмерения = МДИзмерения(Внешняя, Подключение, Тип, Вид);
	КонецЕсли;
	Рез.Вставить("Поля", мИзмерения);
	
	ЗапросТекст = 
		"ВЫБРАТЬ // Первые 100
		|	" + ?(Результат = "Количество", "Сумма(1) КАК Количество", СтрСоединить(мИзмерения, ", ")) + "
		|ИЗ
		|	" + ТипЗапрос + "." + Вид + "
		|";
	
	ЗапросПараметры = Новый Структура;
	
	ЗапросТекст = ЗапросТекст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);
	
	//Если Внешняя Тогда
	//	СделатьВыборкуВнешний(Рез, ЗапросТекст, ЗапросПараметры, Внутр, АдаптироватьПоСоответствиям);
	//Иначе
	//	СделатьВыборку       (Рез, ЗапросТекст, ЗапросПараметры, Внутр);
	//КонецЕсли;
	//
	//Если Результат = "Количество" Тогда
	//	Возврат Рез.Количество;
	//КонецЕсли;
	//
	//Если Не Внутр Тогда
	//	Возврат Рез.Результат;
	//КонецЕсли;
	//    
	Рез.Вставить("мИзмерения", мИзмерения);
	Рез.Вставить("ЗапросТекст", ЗапросТекст);
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция ОбъектыРазница(Тип, Вид, ОргРекв, ОргИД, Рекурсия) Экспорт
	Локальн = ОбъектыВыборка(Ложь  , Тип, Вид, ОргРекв, ОргИД, Рекурсия,, Истина);
	Внешняя = ОбъектыВыборка(Истина, Тип, Вид, ОргРекв, ОргИД,         ,, Истина);
	
	соВнешняя = Новый Соответствие;
	Для Каждого Тек Из Внешняя.Выборка Цикл
		Ключ = "";
		Для Каждого Зн Из Тек Цикл
			Ключ = Ключ + Зн + ",";
		КонецЦикла;
		соВнешняя.Вставить(Ключ, Тек);
	КонецЦикла;
	
	мРазница = Новый Массив;
	Для Каждого Тек Из Локальн.Выборка Цикл
		Ключ = "";
		Для Каждого Зн Из Тек Цикл
			Ключ = Ключ + Зн + ",";
		КонецЦикла;
		
		Если соВнешняя.Получить(Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		мРазница.Добавить(Тек);
	КонецЦикла;
	
	Выб = Новый Структура("Тип, Вид, Результат, Внутр, Поля, Выборка", Тип, Вид, "Выборка", Ложь, Локальн.Поля, мРазница);
	
	МассивИзВыборки(Выб);
	
	Возврат Выб.Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьШаблонЗапроса(СчетКод, ВариантаШаблона)
	
	Если ВариантаШаблона = "бух" Тогда
		
		Шаблон = "ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Организация КАК Организация,
		|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
		|	ХозрасчетныйОбороты.Счет КАК Счет,
		|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
		|	ХозрасчетныйОбороты.Субконто3 КАК Субконто3,
		|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУОборотДт,
		|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаНУОборотКт,
		|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПРОборотДт,
		|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК СуммаПРОборотКт,
		|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВРОборотДт,
		|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК СуммаВРОборотКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, &УсловиеСчета, , &Условие, , ) КАК ХозрасчетныйОбороты";
		
		Шаблон = СтрЗаменить(Шаблон, "&УсловиеСчета", ?(СчетКод <> "", "Счет.Код = """ + СчетКод + """", ""));

			
	ИначеЕсли  ВариантаШаблона = "зуп"  тогда 
			Шаблон = "ВЫБРАТЬ
		|	Начисления.Регистратор КАК Регистратор,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
		|	Начисления.Результат КАК Результат
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|	&Условие"

				
	КонецЕсли; 
	
	Возврат Шаблон; 
	
КонецФункции // ПолучитьШаблон()

&НаКлиенте
Функция ОборотыОбъект(Тип, Вид
	, ОргИД = Неопределено, Период= Неопределено, СчетКод="",   Режим="Разница", Результат = "Выборка", Лево = Ложь, Право = Ложь, Сообщать = Ложь
	)       
	СчетКод="";
	Результат = "Выборка";
	Режим="Разница";
	//Лево = Истина;
	//Право = Истина; 
	Сообщать = Ложь;
	
	Рез = Новый Структура;
	
	// Внешняя = ОбъектыВыборка(Истина, Тип, Вид, ОргРекв, ОргИД,         ,, Истина);   
	
	Если  Тип = "РегистрыРасчета" Тогда 
		Шаблон = ПолучитьШаблонЗапроса(СчетКод,"зуп");
		Текст = СтрЗаменить(Шаблон, "&Условие", " Где ГоловнаяОрганизация В ИЕРАРХИИ (&Организация)"); 
		Поля =  СтрРазделить("Регистратор,Сотрудник,ФизическоеЛицо,ГоловнаяОрганизация,СторноТекущегоПериода,Результат",",",Ложь);
		Рез.Вставить("мИзмерения", Поля);
		Рез.Вставить("ЗапросТекст", Текст);  
		Рез.Вставить("Тип", "РегистрыРасчета");
		
	Иначе 
		Рез   =   ОбъектыВыборкаОтбор(Ложь,Тип,Вид,ВыборкаОргРекв,ОргИД,,,Истина); 
		Поля  =   Рез.мИзмерения;
		Текст =   Рез.ЗапросТекст;
		//Текст = СтрЗаменить(Шаблон, "&Условие", "Организация В ИЕРАРХИИ (&Организация)");	
	КонецЕсли;
	
	//	
	ЗапросПараметры = Новый Структура;
	Если Период <> Неопределено Тогда
		ЗапросПараметры.Вставить("НачалоПериода", Период.ДатаНачала);
		ЗапросПараметры.Вставить("КонецПериода" , КонецДня(Период.ДатаОкончания));
	КонецЕсли;
	
	ЗапросПараметры.Вставить("Организация", ОргИД);
	
	//Поля = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
	//Поля =  СтрРазделить("Регистратор,Сотрудник,ФизическоеЛицо,ГоловнаяОрганизация,СторноТекущегоПериода,Результат",",",Ложь);
	
	//Текст = Рез.ЗапросТекст;
	
	Если Рез.Тип = "РегистрБухгалтерии" Или Рез.Тип = "РегистрНакопления" или Рез.Тип = "РегистрыРасчета"  Тогда
		ИнРег = Поля.Найти("Регистратор");
	Иначе  
		ИнРег = Неопределено;  
	КонецЕсли;
	
	соРазница = ПолучитьРезультат(Текст, Поля, ЗапросПараметры, Режим, Результат, Лево, Право, ИнРег, Сообщать, Рез);
	
	Если ИнРег = Неопределено  Тогда
		Рез.Вставить("Выборка", соРазница);
		Если Рез.Тип = "РегистрыСведений" Тогда 	
			МассивИзВыборки(Рез); 
			Возврат Рез.Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат соРазница

КонецФункции

&НаСервере
Процедура ОбъединитьРез(соРазница, Рез, Тип)
	
	Для каждого эл Из соРазница Цикл
		
		Если Тип = "РегистрыСведений"  Тогда
			Рез.Добавить(эл);	
		Иначе
			Если эл.ПолучитьОбъект()<> Неопределено Тогда 
				Рез.Добавить(эл);	                               
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОбъединитьРез()


&НаКлиенте
Функция Обороты(ОргИД = Неопределено, Период= Неопределено, СчетКод="",   Режим="Разница", Результат = "Выборка", Лево = Истина, Право = Истина, Сообщать = Ложь
	) Экспорт
	
	Если ОргИД = Неопределено Тогда
		ОргИД = ВыборкаОргИД;
	КонецЕсли;
	Если Период = Неопределено Тогда
		Период = ВыборкаПериод;
	КонецЕсли;
	
	Рез = Новый Массив;
	
	Для каждого эл Из ВыборкаМетаданные Цикл
		Если эл.Выбор Тогда
			соРазница =  ОборотыОбъект(эл.Тип, эл.Вид,ОргИД,Период,,,,Лево,Право);//, ,,,   Режим="Разница", Результат = "Выборка", 
			//Лево = Истина, Право = Истина, Сообщать = Ложь);
				ОбъединитьРез(соРазница, Рез, эл.Тип);
		КонецЕсли;
	КонецЦикла;  
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция Реквизит(Тип, Вид, Имя, РеквОрг, ОргИд, Рекурсия,   Режим, Результат = "Выборка", Лево = Ложь, Право = Истина, Сообщать = Ложь) Экспорт
	Если      Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	Иначе
		Возврат Новый Массив;
	КонецЕсли;

	Текст = "ВЫБРАТЬ Ссылка, " + Имя + " ИЗ " + ТипЗапрос + "." + Вид;
	
	ЗапросПараметры = Новый Структура;
	Текст = Текст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);

	Поля = СтрРазделить("Ссылка, " + Имя, ", ", Ложь);
	
	соРазница = Реквизит(Текст, Поля, ЗапросПараметры, Режим, Результат, Лево, Право, 0, Сообщать);
	
	Возврат соРазница;
КонецФункции 

&НаКлиенте
Функция Родитель(Тип, Вид, Имя, РеквОрг, ОргИд, Рекурсия,   Режим, Результат = "Выборка", Лево = Ложь, Право = Истина, Сообщать = Ложь) Экспорт
	Если      Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	Иначе
		Возврат Новый Массив;
	КонецЕсли;

	//Текст = "ВЫБРАТЬ Ссылка, " + Имя + " ИЗ " + ТипЗапрос + "." + Вид;
	//
	//ЗапросПараметры = Новый Структура;
	//Текст = Текст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);

	//Поля = СтрРазделить("Ссылка, " + Имя, ", ", Ложь);
	//
	соРазница = ВнешнийИерархия(ОргИД, Сообщать = Ложь);
	
	Возврат соРазница;
КонецФункции

&НаКлиенте
Функция ВСписке(Тип, Вид, Ссылка,   Режим, Результат = "Выборка", Лево = Ложь, Право = Истина, Сообщать = Ложь) Экспорт
	Если      Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	Иначе
		Возврат Новый Массив;
	КонецЕсли;

	Текст = "ВЫБРАТЬ Ссылка ИЗ " + ТипЗапрос + "." + Вид + " ГДЕ Ссылка В (&Ссылка)";
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("Ссылка", Ссылка);

	Поля = СтрРазделить("Ссылка", ", ", Ложь);
	
	соРазница = ПолучитьРезультат(Текст, Поля, ЗапросПараметры, Режим, Результат, Лево, Право, 0, Сообщать);
	
	Возврат соРазница;
КонецФункции

&НаКлиенте
Функция Запрос(ТекстЗапроса, Поля,   Режим, Результат = "Выборка", Лево = Ложь, Право = Истина, Сообщать = Ложь) Экспорт
	мПоля = СтрРазделить(Поля, ", ", Ложь);
	
	соРазница = ПолучитьРезультат(ТекстЗапроса, мПоля, Новый Структура, Режим, Результат, Лево, Право, 0, Сообщать);
	
	Возврат соРазница;
КонецФункции

&НаКлиенте
Функция СписокФункций() Экспорт
	Возврат "
		|ПолучитьРазницуПоКлючам|соЛокал, соВнешн, Лево = Истина, Право = Истина, Индекс = 0, Сообщать = Ложь|&.Разница
		|ОбъектыВыборка|&.Внешняя, &.Тип, &.Вид, &.РеквОрг, &.ОргИД, &.Рекурсия|&.Ссылка
		|ОбъектыРазница|&.Тип, &.Вид, &.РеквОрг, &.ОргИД, &.Рекурсия|&.Ссылка
		|Обороты|&.ОргИД, &.Период, &.СчетКод,  ""Локальная/Внешняя/Разница"", ""Выборка/Ссылки/Количество""|&.Ссылка
		|Реквизит|&.Тип, &.Вид, &.Имя, &.РеквОрг, &.ОргИд, &.Рекурсия,  ""Локальная/Внешняя/Разница"", ""Выборка/Ссылки/Количество""|&.Ссылка
		|ВСписке|&.Тип, &.Вид, &.Ссылка,  ""Локальная/Внешняя/Разница"", ""Выборка/Ссылки/Количество""|&.Ссылка
		|Запрос|&.ТекстЗапроса, &.Поля,  ""Локальная/Внешняя/Разница"", ""Выборка/Ссылки/Количество""|&.Ссылка
		|";
КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	ВыборкаВнешняя = ВыборкаБаза = "Внешняя";
	ВыборкаРежим = ?(ВыборкаБаза <> "Разница", ВыборкаБаза = "Локальная", Неопределено);
	
	Если      ВыборкаФункция = "Объекты" Тогда
		Если ВыборкаБаза <> "Разница" Тогда
			Выб = ОбъектыВыборка(ВыборкаВнешняя,
				ВыборкаТип, ВыборкаВид,
				ВыборкаОргРекв, ВыборкаОргИД, ВыборкаРекурсия,
				ВыборкаРезультат
			);
			
			Если ВыборкаРезультат = "Количество" Тогда
				Сообщить(Выб);
				Возврат;
			КонецЕсли;
			
		Иначе
			Выб = ОбъектыРазница(
				ВыборкаТип, ВыборкаВид,
				ВыборкаОргРекв, ВыборкаОргИД, ВыборкаРекурсия
			);
			
		КонецЕсли;
		
	ИначеЕсли ВыборкаФункция = "Обороты" Тогда
		Выб = Обороты(
			ВыборкаОргИД, ВыборкаПериод, "",
			ВыборкаБаза, ВыборкаРезультат, РеквизитЛево, РеквизитПраво, Истина
		);
		
	ИначеЕсли ВыборкаФункция = "Реквизит" Тогда
		Выб = Реквизит(
		ВыборкаТип, ВыборкаВид, РеквизитИмя, ВыборкаОргРекв, ВыборкаОргИД, ВыборкаРекурсия,
		ВыборкаБаза, ВыборкаРезультат, РеквизитЛево, РеквизитПраво, Истина
		); 
	ИначеЕсли ВыборкаФункция = "Родитель" Тогда
		Выб = Родитель(
		ВыборкаТип, ВыборкаВид, РеквизитИмя, ВыборкаОргРекв, ВыборкаОргИД, ВыборкаРекурсия,
		ВыборкаБаза, ВыборкаРезультат, РеквизитЛево, РеквизитПраво, Истина
		);	
		
	ИначеЕсли ВыборкаФункция = "ВСписке" Тогда
		Выб = ВСписке(
			ВыборкаТип, ВыборкаВид, Неопределено,
			ВыборкаБаза, ВыборкаРезультат, РеквизитЛево, РеквизитПраво, Истина
		);
		
	ИначеЕсли ВыборкаФункция = "Запрос" Тогда
		Выб = Запрос(
			"", "",
			ВыборкаБаза, ВыборкаРезультат, РеквизитЛево, РеквизитПраво, Истина
		);
		
	ИначеЕсли ВыборкаФункция = "ОборотыHTTP" Тогда 
		//Выб = ОбъектыВыборка(ВыборкаВнешняя,
		//ВыборкаТип, ВыборкаВид,
		//ВыборкаОргРекв, ВыборкаОргИД, ВыборкаРекурсия,
		//ВыборкаРезультат
		//);
		//
		
	ИначеЕсли ВыборкаФункция = "ВыборкаСоответствияHTTP" Тогда 
	ИначеЕсли ВыборкаФункция = "ВыборкаОбъекНеНайденHTTP" Тогда 
		
	КонецЕсли;
	
	СообщитьМассив(Выб);
КонецПроцедуры

   //rsh
&НаКлиенте
Функция ВыполнитьЗапросОборотыВнешнийОбъектНеНайден(ЗапросПараметры,АдаптироватьПоСоответствиям = Истина)
    Подключение = ПолучитьПодключение();
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	
	//ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
	ЗапросПараметрыВнешний = Адаптировать(ЗапросПараметрыВнешний, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу);
	
	Выб = Подключение.ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайденСервер(ЗапросПараметры, ВыбратьОбъектНеНайден);
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мРезультат.Добавить(ТекСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);

	Возврат мРезультат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьЗапросВнешнийИерархия(ЗапросПараметры,АдаптироватьПоСоответствиям = Истина)
    Подключение = ПолучитьПодключение();
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	
	//ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
	ЗапросПараметрыВнешний = Адаптировать(ЗапросПараметрыВнешний, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу);
	
	Выб = Подключение.ОбменДаннымиПереопределяемый.цМетаданныеИерархия();
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мРезультат.Добавить(ТекСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);

	Возврат мРезультат;
	
	//Подключение = ПолучитьПодключение();
	//СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную, Неопределено);
	//Выб = Подключение.ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайден();
	//
	//мРезультат = Новый Массив;
	//Для Каждого Зн Из Выб Цикл
	//	//Стр = Новый Массив;
	//	//Для Каждого Зн Из ТекСтр Цикл
	//		Если АдаптироватьПоСоответствиям Тогда
	//			Соо = СоответствияОбъектов.Получить(Зн);
	//			Если Соо <> Неопределено Тогда
	//				Зн = Соо;
	//			КонецЕсли;
	//		КонецЕсли;
	//		АдаптироватьСтроку(Зн, Подключение);
	//		//Стр.Добавить();
	//		
	//	//КонецЦикла;
	//	мРезультат.Добавить(Зн);
	//КонецЦикла;
	//
	//Возврат мРезультат;
КонецФункции

&НаКлиенте
Функция ОборотыОбъектНеНайден(Знач ОргИД = Неопределено, Знач Период = Неопределено, Сообщать = Ложь) Экспорт
	Если ОргИД = Неопределено Тогда
		ОргИД = ВыборкаОргИД;
		Сообщить(ОргИД);
	КонецЕсли;
	Если Период = Неопределено Тогда
		Период = ВыборкаПериод;
		Сообщить(Период.ДатаНачала);
		Сообщить(Период.ДатаОкончания);
	КонецЕсли;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("НачалоПериода", Период.ДатаНачала);
	ЗапросПараметры.Вставить("КонецПериода" , КонецДня(Период.ДатаОкончания));
	ЗапросПараметры.Вставить("Организация", ОргИД);
//	
	Поля = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
//	Состояние("Внешний запрос");
	Внешн = ВыполнитьЗапросОборотыВнешнийОбъектНеНайден(ЗапросПараметры,Истина);
	
// Разница в составе субконто
	ИнСчет = Поля.Найти("Счет");
	ИнСбк1 = Поля.Найти("Субконто1");
	ИнСбк2 = Поля.Найти("Субконто2");
	ИнСбк3 = Поля.Найти("Субконто3");
	
	//Для Каждого Стр Из Внешн Цикл
		//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,64:8b1e7cb27df52e9411ed98d4cf3b680f}" Тогда // 90.02.1
		//	Стр[ИнСбк3] = "{""L""}";
		//КонецЕсли;
		//Если Стр[ИнСчет] = "{""#"",6f58a5c7-f511-498f-abeb-390cf5afab39,64:8b1e7cb27df52e9411ed98d4cf3b6818}" Тогда // 90.08.1
		//	Стр[ИнСбк2] = "{""L""}";
		//	Стр[ИнСбк3] = "{""L""}";
		//КонецЕсли;
	//КонецЦикла;

	Рез = МассивДвумерныйИзСтрокиВнутр(Внешн);
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция ВнешнийИерархия(Знач ОргИД = Неопределено, Сообщать = Ложь) Экспорт
	Если ОргИД = Неопределено Тогда
		ОргИД = ВыборкаОргИД;
		Сообщить(ОргИД);
	КонецЕсли;
	//Если Период = Неопределено Тогда
		Период = ВыборкаПериод;
		Сообщить(Период.ДатаНачала);
		Сообщить(Период.ДатаОкончания);
	//КонецЕсли;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("НачалоПериода", Период.ДатаНачала);
	ЗапросПараметры.Вставить("КонецПериода" , КонецДня(Период.ДатаОкончания));
	ЗапросПараметры.Вставить("Организация", ОргИД);
//	
	Поля = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
//	Состояние("Внешний запрос");
	Внешн =  ВыполнитьЗапросВнешнийИерархия(ЗапросПараметры,Истина);
	
// Разница в составе субконто
	ИнСчет = Поля.Найти("Счет");
	ИнСбк1 = Поля.Найти("Субконто1");
	ИнСбк2 = Поля.Найти("Субконто2");
	ИнСбк3 = Поля.Найти("Субконто3");
	
	Рез = МассивДвумерныйИзСтрокиВнутрМ(Внешн);
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПолучитьДеревоРодителя(Рез)
	
	сРодители = Новый Массив;
	Для каждого мСтр Из Рез Цикл
		  ПолучитьРодителяРекурсия(мСтр,сРодители) 
	КонецЦикла;
	
	СвернутыйМассив = Новый Массив;
	Для каждого Элемент Из сРодители Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Сообщить(СвернутыйМассив.Количество());
	Возврат СвернутыйМассив;
	
КонецФункции   

&НаСервере
Функция ПолучитьРодителяРекурсия(Ссылка,сРодители)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Родитель КАК Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сРодители.Добавить(ВыборкаДетальныеЗаписи.Родитель);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Родитель)  Тогда
		    ПолучитьРодителяРекурсия(ВыборкаДетальныеЗаписи.Родитель,сРодители)
		КонецЕсли;
	КонецЦикла;
	
	Возврат  сРодители;
	
КонецФункции // ПолучитьРодителяРекурсия()

	 
&НаСервереБезКонтекста
Функция МассивДвумерныйИзСтрокиВнутр(Внешн)
	Рез = Новый Массив;
	Для Каждого Стр Из Внешн Цикл
		//Для каждого кСтр Из Стр Цикл
			Зн = ЗначениеИзСтрокиВнутр(Стр);
			Рез.Добавить(Зн);	
		//КонецЦикла;
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция МассивДвумерныйИзСтрокиВнутрМ(Внешн)
	Рез = Новый Массив;
	Для Каждого Стр Из Внешн Цикл
		//Для каждого кСтр Из Стр Цикл
			Зн = ЗначениеИзСтрокиВнутр(Стр);
			Рез.Добавить(Зн);	
		//КонецЦикла;
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция МассивйИзЗначенияВСтрокуВнутр(Внешн)
	Рез = Новый Массив;
	Для Каждого Стр Из Внешн Цикл
		//Для каждого кСтр Из Стр Цикл
			Зн = ЗначениеВСтрокуВнутр(Стр);
			Рез.Добавить(Зн);	
		//КонецЦикла;
	КонецЦикла;
	Возврат Рез;
КонецФункции



&НаКлиенте
Процедура НайтиОбъектНеНайденИзОборотов(Команда)
	Выб = ОборотыОбъектНеНайден(ВыборкаОргИД, ВыборкаПериод,	Истина);
КонецПроцедуры

&НаКлиенте
Процедура цМетаданныеНаСервереКлиент(Команда)
  Выб = цМетаданныеНаСервереОб(ВыборкаОргИД, ВыборкаПериод,	Истина);
КонецПроцедуры

&НаКлиенте
Функция цМетаданныеНаСервереОб(Знач ОргИД = Неопределено, Знач Период = Неопределено, Сообщать = Ложь) Экспорт
	Если ОргИД = Неопределено Тогда
		ОргИД = ВыборкаОргИД;
		Сообщить(ОргИД);
	КонецЕсли;
	Если Период = Неопределено Тогда
		Период = ВыборкаПериод;
		Сообщить(Период.ДатаНачала);
		Сообщить(Период.ДатаОкончания);
	КонецЕсли;
	Внешн = ВыполнитьЗапросцМетаданныеОбъектНеНайден(Истина);
	Рез = МассивДвумерныйИзСтрокиВнутр(Внешн);
	
	Возврат Рез;
КонецФункции


&НаКлиенте
Функция ВыполнитьЗапросцМетаданныеОбъектНеНайден(АдаптироватьПоСоответствиям = Истина)
    Подключение = ПолучитьПодключение();
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	
	//ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
	ЗапросПараметрыВнешний = Адаптировать(ЗапросПараметрыВнешний, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу);
	Если  ИщемОбъектыВРС Тогда
	  Выб = Подключение.ОбменДаннымиПереопределяемый.цМетаданныеНаСервереРС(ВыбратьОбъектНеНайден);
 	Иначе 
	  Выб = Подключение.ОбменДаннымиПереопределяемый.цМетаданныеНаСервере(ВыбратьОбъектНеНайден);
	КонецЕсли;
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мРезультат.Добавить(ТекСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);

	Возврат мРезультат;
	
	//Подключение = ПолучитьПодключение();
	//СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную, Неопределено);
	//Выб = Подключение.ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайден();
	//
	//мРезультат = Новый Массив;
	//Для Каждого Зн Из Выб Цикл
	//	//Стр = Новый Массив;
	//	//Для Каждого Зн Из ТекСтр Цикл
	//		Если АдаптироватьПоСоответствиям Тогда
	//			Соо = СоответствияОбъектов.Получить(Зн);
	//			Если Соо <> Неопределено Тогда
	//				Зн = Соо;
	//			КонецЕсли;
	//		КонецЕсли;
	//		АдаптироватьСтроку(Зн, Подключение);
	//		//Стр.Добавить();
	//		
	//	//КонецЦикла;
	//	мРезультат.Добавить(Зн);
	//КонецЦикла;
	//
	//Возврат мРезультат;
КонецФункции

&НаКлиенте
Процедура ВыбратьПоОбъектуИзРС(Команда)
	Выб = мВыбратьПоОбъектуИзРС(ВыборкаОргИД, ВыборкаПериод,	Истина);
КонецПроцедуры    

&НаКлиенте
Функция мВыбратьПоОбъектуИзРС(Знач ОргИД = Неопределено, Знач Период = Неопределено, Сообщать = Ложь) Экспорт
	Если ОргИД = Неопределено Тогда
		ОргИД = ВыборкаОргИД;
		Сообщить(ОргИД);
	КонецЕсли;
	Если Период = Неопределено Тогда
		Период = ВыборкаПериод;
		Сообщить(Период.ДатаНачала);
		Сообщить(Период.ДатаОкончания);
	КонецЕсли;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("НачалоПериода", Период.ДатаНачала);
	ЗапросПараметры.Вставить("КонецПериода" , КонецДня(Период.ДатаОкончания));
	ЗапросПараметры.Вставить("Организация", ОргИД);
//	
	Поля = СтрРазделить("Организация, Подразделение, Счет, Субконто1, Субконто2, Субконто3, КорСчет, Регистратор, СуммаОборотДт, СуммаОборотКт, СуммаНУОборотДт, СуммаНУОборотКт, СуммаПРОборотДт, СуммаПРОборотКт, СуммаВРОборотДт, СуммаВРОборотКт", ", ", Ложь);
//	Состояние("Внешний запрос");
	Внешн = ВыбратьПоОбъектуИзРСЗапрос(ЗапросПараметры,Истина);
	
// Разница в составе субконто
	ИнСчет = Поля.Найти("Счет");
	ИнСбк1 = Поля.Найти("Субконто1");
	ИнСбк2 = Поля.Найти("Субконто2");
	ИнСбк3 = Поля.Найти("Субконто3");
	
	Рез = МассивДвумерныйИзСтрокиВнутр(Внешн);

	Рез = ПолучитьВыборкуИзПорядокОтраженияЗарплатыВБухУчете(Рез);
	
	Возврат Рез;
КонецФункции


&НаСервере
Функция ПолучитьВыборкуИзПорядокОтраженияЗарплатыВБухУчете(СпособыОтраженияЗарплатыВБухУчете)
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
		|	ПорядокОтраженияЗарплатыВБухУчете.ЕНВД КАК ЕНВД,
		|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК Счет,
		|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК Субконто1,
		|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК Субконто2,
		|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК Субконто3,
		|	ПорядокОтраженияЗарплатыВБухУчете.ОтражениеВУСН КАК ОтражениеВУСН,
		|	ПорядокОтраженияЗарплатыВБухУчете.СчетНУ КАК СчетНУ,
		|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ1 КАК СубконтоНУ1,
		|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ2 КАК СубконтоНУ2,
		|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ3 КАК СубконтоНУ3
		|ИЗ
		|	РегистрСведений.ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
		|ГДЕ
		|	ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете В(&СпособОтраженияЗарплатыВБухУчете)";
	
	Запрос.УстановитьПараметр("СпособОтраженияЗарплатыВБухУчете", СпособыОтраженияЗарплатыВБухУчете);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыбМассив = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Выборка = мВыборки[СтрЗапрос.Значение.Номер].Выбрать();
		//КонецЕсли;
		
		//Пока Выборка.Следующий() Цикл
		//	Если Посчитать Тогда
			//	Сообщить(Выборка.Тип + " - " + Выборка.Количество);
		//	Иначе
				//Если Лев(СтрЗапрос.Ключ, 16) = "РегистрСведений." Тогда
					Отбор = Новый Структура("СпособОтраженияЗарплатыВБухУчете,ЕНВД");
					ЗаполнитьЗначенияСвойств(Отбор, ВыборкаДетальныеЗаписи);
					Значение = РегистрыСведений.ПорядокОтраженияЗарплатыВБухУчете.СоздатьКлючЗаписи(Отбор);
					ВыбМассив.Добавить(Значение);	
				//Иначе
				//	Значение = Выборка.Ссылка;
					
				//КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат ВыбМассив;
	

КонецФункции // ПолучитьВыборкуИзПорядокОтраженияЗарплатыВБухУчете()



&НаКлиенте
Функция ВыбратьПоОбъектуИзРСЗапрос(ЗапросПараметры,АдаптироватьПоСоответствиям = Истина)
    Подключение = ПолучитьПодключение();
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	
	//ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ЛокальнаяВоВнешнюю, Неопределено);
	ЗапросПараметрыВнешний = Адаптировать(ЗапросПараметрыВнешний, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу);
	
	Выб = Подключение.ОбменДаннымиПереопределяемый.ПолучитьСпособыУчетаЗарплаты();
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мРезультат.Добавить(ТекСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);

	Возврат мРезультат;
	
КонецФункции


&НаСервере
Функция ПереименоватьПредопределенныеСтатьиНаСервере(Выб)
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МассивПредопределенных.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&МассивПредопределенных КАК МассивПредопределенных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиЗатрат.Наименование КАК Наименование,
	|	СтатьиЗатрат.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|ГДЕ
	|	СтатьиЗатрат.ИмяПредопределенныхДанных В
	|			(ВЫБРАТЬ
	|				ВТ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|			ИЗ
	|				ВТ КАК ВТ)";  
	
	Запрос.УстановитьПараметр("МассивПредопределенных",Выб);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	пСоответствие = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		пСоответствие.Вставить(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных,ВыборкаДетальныеЗаписи.Наименование);
	КонецЦикла;
Возврат пСоответствие	
КонецФункции // ПереименоватьПредопределенныеСтатьиНаСервере()

&НаСервере
Функция ПолучитьПредопределенныеЭлементы(Выб,ОбъектПроверяемый)
	КС = Новый КвалификаторыСтроки(150);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("ИмяПредопределенныхДанных",ОписаниеТиповС);  
	пСоответствие = Новый Соответствие;

	Для Каждого Строка Из Выб Цикл 
		СтрокаНоваяТЗ = НоваяТЗ.Добавить();
		зн = Справочники[ОбъектПроверяемый][Строка];   
		пСоответствие.Вставить(Строка,зн.Наименование);

		//СтрокаНоваяТЗ.ИмяПредопределенныхДанных = Строка;
	КонецЦикла;
	
	//Для Каждого Строка Из пСоответствие Цикл 
	//	зн = Справочники.СтатьиЗатрат[Строка.Ключ];   
	//	Если зн.Наименование = Строка.Значение Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	спрОб =  зн.ПолучитьОбъект();  
	//	спрОб.Наименование = Строка.Значение;
	//КонецЦикла;
	
	Возврат пСоответствие;
КонецФункции  

&НаКлиенте
Процедура ПереименоватьПредопределенныеСтатьи(Команда)
	Подключение = ПолучитьПодключение();  
	ОбъектПроверяемый = ВыборкаВид;   
	ПолучитьСтрокуВнутр = Ложь;
	мСтатьиЗатратВнеш = Подключение.ОбменДаннымиПереопределяемый.ПолучитьИменаПредопределенныхДанных(ОбъектПроверяемый,ПолучитьСтрокуВнутр);
	мСтатьиЗатратЛокал = ПолучитьИменаПредопределенныхДанныхЛокал(ОбъектПроверяемый,ПолучитьСтрокуВнутр);  
	//Рез = 	ПолучитьПредопределенныеЭлементы(мРезультат,ОбъектПроверяемый);	

	мСоответствие = Новый Соответствие;
	
	Для каждого мСтр Из мСтатьиЗатратВнеш  Цикл
		//СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		Локал =  мСтатьиЗатратЛокал.Получить(мСтр.Ключ);      
		Внешн = мСтр.Ключ; 
		мСоответствие.Вставить(Внешн, Локал);
	КонецЦикла;

	Выб = Подключение.ОбменДаннымиПереопределяемый.ОбновитьИменаПредопределенныхДанных(мСоответствие,ОбъектПроверяемый);
	
	//Запрос = Подключение.NewObject("Запрос");
	//Запрос.Текст = "ВЫБРАТЬ
	//	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка,
	//	|	ПрочиеДоходыИРасходы.Наименование КАК Наименование
	//	|ИЗ
	//	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	//	|ГДЕ
	//	|	ПрочиеДоходыИРасходы.Предопределенный = ИСТИНА";
	//
	//Выборка = Запрос.Execute().Выбрать();
	//мРезультат = Новый Массив;
	//Пока Выборка.Следующий() Цикл
	//	Об = Выборка.Ссылка; 
	//	Сообщить(Выборка.Наименование);
	//	мРезультат.Добавить(Об);
	//КонецЦикла;     
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаПредопределенныхДанныхЛокал(ОбъектПроверяемый,ПолучитьСтрокуВнутр) Экспорт
	
	мРезультат = Новый Соответствие;
	Для каждого м Из Метаданные.Справочники Цикл
		//Если  ЗначениеЗаполнено(ОбъектПроверяемый) Тогда
			Если не  м.Имя = ОбъектПроверяемый Тогда       //тест "КлючиАналитикиУчетаЗатрат"
				Продолжить;
			КонецЕсли;
		//КонецЕсли;
		
		мРеквизиты = м.Реквизиты;
		ЗапросТекст = "";
		ЗапросТекст = ТекстЗапросаПредопределенных("Справочники",м.Имя,ПолучитьСтрокуВнутр);
		Запрос	= Новый Запрос;
		Запрос.Текст = ЗапросТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		сч = 0;	    
		Пока Выборка.Следующий() Цикл 
			Если ЗначениеЗаполнено(Выборка.ИмяПредопределенныхДанных) Тогда
				Если ПолучитьСтрокуВнутр  Тогда
					мРезультат.Вставить(Выборка.ИмяПредопределенныхДанных,ЗначениеВСтрокуВнутр(Выборка.Ссылка));
					//мРезультат.Добавить(ЗначениеВСтрокуВнутр(Выборка.Ссылка));
				Иначе 	
				 	мРезультат.Вставить(Выборка.ИмяПредопределенныхДанных,Выборка.Наименование);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат мРезультат;

КонецФункции // ОбновитьИменаПр

&НаСервере
Функция ТекстЗапросаПредопределенных(Тип,Вид,ПолучитьСтрокуВнутр)
	Результат = ""; 
	мИзмерения = Новый Массив;
	Если Результат = "Количество" Тогда
		мИзмерения = Новый Массив;
		мИзмерения.Добавить("Количество");
	ИначеЕсли ПолучитьСтрокуВнутр Тогда
		мИзмерения.Добавить("Ссылка");
		мИзмерения.Добавить("ИмяПредопределенныхДанных");
	Иначе	
		мИзмерения.Добавить("Наименование");
		мИзмерения.Добавить("ИмяПредопределенныхДанных");
	КонецЕсли;
	//Рез.Вставить("Поля", мИзмерения);
	Если  Тип = "Справочники" Тогда
		 ТипЗапрос="Справочник";
	ИначеЕсли  Тип = "Документы" Тогда
		 ТипЗапрос="Документ";
	КонецЕсли;
	
	
	ЗапросТекст = 
	"ВЫБРАТЬ // Первые 100
	|	" + СтрСоединить(мИзмерения, ", ") + "
	|ИЗ
	|	" + ТипЗапрос + "." + Вид + "
	|";
	
	ЗапросПараметры = Новый Структура;
	
	//ЗапросТекст = ЗапросТекст + ЗапросУсловие(Тип, Вид, РеквОрг, ОргИд, Рекурсия, ЗапросПараметры);
    Возврат ЗапросТекст;

КонецФункции // ТекстЗапроса()


&НаКлиенте
Процедура ВыборкаОбъектНеНайден(Команда)
	ФункцияМ()	
КонецПроцедуры  

&НаКлиенте
Функция ФункцияМ()  экспорт
	Внешн = Новый Массив;
	Если поHTTP Тогда 
		АдаптироватьПоСоответствиям  = Истина;
		Внешн =  ВыборкаОбъектНеНайденВнешHTTP(); 
		Рез = МассивДвумерныйИзСтрокиВнутр(Внешн[1]);  
		Внешн.Добавить(Рез);
		ЗаписатьНеНайденныеВнеш(Внешн);
	Иначе 
		АдаптироватьПоСоответствиям  = Истина;
		Внешн =  ВыборкаОбъектНеНайденВнеш(); 
		Рез = МассивДвумерныйИзСтрокиВнутр(Внешн);
		ЗаписатьНеНайденныеВнеш(Рез);
		
	КонецЕсли;	
	Возврат Рез;
КонецФункции // ФункцияМ()

&НаКлиенте
Процедура ЗаписатьНеНайденныеВнеш(Рез) 
	мРезультат = Новый Массив;
	Для каждого эл Из Рез[2] Цикл
		Если Не СсылкаСуществует(эл)  Тогда
		  мРезультат.Добавить(эл);
		 КонецЕсли; 
	 КонецЦикла; 
	 
	мРезультат = МассивйИзЗначенияВСтрокуВнутр(мРезультат);
	
	мТипы = Рез[0];
    	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;

	АдаптироватьПоСоответствиям = Истина;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);  
	
	Если поHTTP Тогда  
		Типы = СинтезТипов(мРезультат);  
		мОтвет = Новый Массив;
		мОтвет.Добавить(Типы);
		мОтвет.Добавить(мРезультат);
		
		ДанныеЗапроса = Новый Структура();   
		ДанныеЗапроса.Вставить("мОтвет",мОтвет); 
		
		ВыборкаHTTP = "ВыборкаОтправкаКонтроль";
		
		Путь = "";
		Рез  = ЗапросКБазеПриемнику("V1/Список", ДанныеЗапроса, Путь)
	Иначе
		Подключение = ПолучитьПодключение();
		мРезультатВ = Адаптировать(мРезультат, Истина, Подключение, СоответствияОбъектов, КэшТипы.Наружу); 
		Выб = Подключение.ОбменДаннымиПереопределяемый.ЗаписатьБитыеВРС(мРезультатВ);
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Функция СсылкаСуществует(ЛюбаяСсылка) Экспорт
    
    ТекстЗапроса = "
        |ВЫБРАТЬ
        |    Ссылка
        |ИЗ
        |    [ИмяТаблицы]
        |ГДЕ
        |    Ссылка = &Ссылка
        |";
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ИмяТаблицыПоСсылке(ЛюбаяСсылка));
    
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
    
    УстановитьПривилегированныйРежим(Истина);
    
    Возврат НЕ Запрос.Выполнить().Пустой();
    
КонецФункции

&НаСервере
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
    
    Возврат Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ПолноеИмя();
    
КонецФункции


&НаКлиенте
Функция ВыборкаОбъектНеНайденВнеш(АдаптироватьПоСоответствиям = Истина)
	
	Подключение = ПолучитьПодключение();     
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	Состояние("Получение особых соответствий");
	
	СоответствияОбъектовИнформационныхБаз = Новый Структура("ВнешняяВЛокальную, ЛокальнаяВоВнешнюю", Новый Соответствие, Новый Соответствие);
	
	Запрос = Подключение.NewObject("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦТ_ОбъектыОбмен.ОбъектВнутр КАК ОбъектВнутр
	|ИЗ
	|	РегистрСведений.ЦТ_ОбъектыОбмен КАК ЦТ_ОбъектыОбмен";
	
	
	Выборка = Запрос.Execute().Выбрать();
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл  
		мРезультат.Добавить(Выборка.ОбъектВнутр);
	КонецЦикла;     
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);

	мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);
	
	Возврат мРезультат;
	
	
КонецФункции // ВыборкаОбъектНеНайденВнеш()


&НаКлиенте
Функция ВыборкаОбъектНеНайденВнешHTTP(АдаптироватьПоСоответствиям = Истина)
	
	Если КэшТипы = Неопределено Тогда
		КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
	КонецЕсли;
	
	Состояние("Получение особых соответствий");
	
	СоответствияОбъектовИнформационныхБаз = Новый Структура("ВнешняяВЛокальную, ЛокальнаяВоВнешнюю", Новый Соответствие, Новый Соответствие);
	
	ЗапросПараметры = Новый Структура; 
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("DocumentRef.ТрансформационнаяКорректировка");  
	МассивТипов.Добавить("DocumentRef.Трансляция"); 
	ЗапросПараметры.Вставить("ТипОбъекта",МассивТипов);
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ЦТ_ОбъектыОбмен.ОбъектВнутр КАК ОбъектВнутр,
	|	ЦТ_ОбъектыОбмен.ТипОбъекта КАК ТипОбъекта
	|ИЗ
	|	РегистрСведений.ЦТ_ОбъектыОбмен КАК ЦТ_ОбъектыОбмен
	|ГДЕ
	|	НЕ ЦТ_ОбъектыОбмен.ТипОбъекта В (&ТипОбъекта)";
	Поля = СтрРазделить("ОбъектВнутр", ", ", Ложь);
	
	
	ДанныеЗапроса = Новый Структура();   
	ДанныеЗапроса.Вставить("ЗапросПараметры",ЗапросПараметры);
	ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
	ДанныеЗапроса.Вставить("Поля",Поля);
	
	//ЗаполнитьЗначенияСвойств(ДанныеЗапроса, ЭтаФорма);
	
	Путь = "";
	Рез  = ЗапросКБазеПриемнику("V1/Список", ДанныеЗапроса, Путь);
	Выб  = Рез[0];
	мТипы = новый Соответствие;
	тВыб = Рез[1]; 
	Для каждого стр Из тВыб Цикл
		мТипы.Вставить( стр[0], стр[1]);
	КонецЦикла;
	
	Если Выб = Неопределено Тогда
	КонецЕсли;
	
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		//мСтр = Новый Массив;
		Для Каждого Зн Из ТекСтр Цикл
			мРезультат.Добавить(Зн);
		КонецЦикла;
		//мРезультат.Добавить(ТекСтр);
	КонецЦикла;
	
	СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	
	мРезультат = АдаптироватьHTTP(мРезультат, Ложь, СоответствияОбъектов, КэшТипы.Внутрь,мТипы);
	
	//Пока Выборка.Следующий() Цикл  
	//	мРезультат.Добавить(Выборка.ОбъектВнутр);
	//КонецЦикла;     
	//
	//СоответствияОбъектов = ?(АдаптироватьПоСоответствиям, ПолучитьСоответствияОбъектов().ВнешняяВЛокальную , Неопределено);
	
	//мРезультат = Адаптировать(мРезультат, Ложь, Подключение, СоответствияОбъектов, КэшТипы.Внутрь);
	
	мРез = Новый Массив;
	мРез.Добавить(мТипы);
	мРез.Добавить(мРезультат);	
	Возврат мРез;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуру()
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(WSИмяСервера);
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);	
Возврат Прокси;	
КонецФункции // ПолучитьСтруктуру()


&НаКлиенте
Функция ПолучитьПодключениеHTTPКлиент()  Экспорт  
	Если  НЕ ЗначениеЗаполнено(WSИмяСервера) Тогда
		WSИмяСервера		=  "192.168.0.4"; 
		СервернаяБазаДанных = WSИмяСервера;
	КонецЕсли;
	Если  НЕ ЗначениеЗаполнено(WSИмяПользователя) Тогда
		WSИмяПользователя 	= "Администратор"; 
		Логин  = WSИмяПользователя;
	КонецЕсли;
	Если  НЕ ЗначениеЗаполнено(WSПароль) Тогда
		WSПароль 			= "nE6ha4cu";
		Пароль = WSПароль;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(WSИмяСервера) Тогда
		ТекстСообщения = "Не определены настройки подключения к веб-сервису";
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли; 
	Попытка
		Если SSL Тогда
			SSL1 = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);    
			Если Proxy Тогда  
				
				//Прокси = 	ПолучитьСтруктуру();
				
				Прокси = Новый ИнтернетПрокси;
				Прокси.Пользователь = WSИмяПользователя; 
				Прокси.Пароль =       WSПароль;
				Соединение = Новый HTTPСоединение(WSИмяСервера,,,,Прокси,100,SSL1,);
			Иначе 
				Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,100,SSL1,);  	
			КонецЕсли;
		Иначе 
			Если Proxy Тогда
				Прокси = Новый ИнтернетПрокси;
				Прокси.Пользователь = WSИмяПользователя; 
				Прокси.Пароль =       WSПароль;
				Соединение = Новый HTTPСоединение(WSИмяСервера,,,,Прокси,100,,);
			Иначе 
				Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,100,,);
			КонецЕсли;
		КонецЕсли; 
		
				
		Элементы.ДекорацияПодключение.Подсказка = "Подключение установлено";
		Элементы.ДекорацияПодключение.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		
	Исключение
		ТекстСообщения = "Ошибка получения http соединения с базой. Причина: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции   

&НаСервере
Функция ПолучитьПодключениеHTTPСервер()  Экспорт  
	Если  НЕ ЗначениеЗаполнено(WSИмяСервера) Тогда
		WSИмяСервера		=  "192.168.0.4"; 
		СервернаяБазаДанных = WSИмяСервера;
	КонецЕсли;
	Если  НЕ ЗначениеЗаполнено(WSИмяПользователя) Тогда
		WSИмяПользователя 	= "Администратор"; 
		Логин  = WSИмяПользователя;
	КонецЕсли;
	Если  НЕ ЗначениеЗаполнено(WSПароль) Тогда
		WSПароль 			= "nE6ha4cu";
		Пароль = WSПароль;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(WSИмяСервера) Тогда
		ТекстСообщения = "Не определены настройки подключения к веб-сервису";
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли; 
	Попытка
		Если SSL Тогда
			SSL1 = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);    
			Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,100,SSL1,);
		Иначе 
			Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,,,);	
		КонецЕсли;
	Исключение
		ТекстСообщения = "Ошибка получения http соединения с базой. Причина: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции


&НаСервере
Функция ЗапросКБазеПриемнику(ИмяКоманды, ДанныеЗапроса, ПутьНаСервере)
	
	Если Не ЗначениеЗаполнено(ПутьНаСервере) Тогда
		Если ВыборкаHTTP = "Объекты" Тогда
            ПутьНаСервере = WSИмяБазы + "/hs/sverka/V1/Объекты";
		ИначеЕсли ВыборкаHTTP = "ОборотыHTTP" Тогда
			ПутьНаСервере = WSИмяБазы + "/hs/sverka/V1/Обороты";	
		ИначеЕсли ВыборкаHTTP = "ВыборкаСоответствияHTTP" Тогда
			ПутьНаСервере = WSИмяБазы + "/hs/sverka/V1/ВыборкаСоответствия";	
		ИначеЕсли ВыборкаHTTP = "ВыборкаОбъекНеНайденHTTP" Тогда	
			ПутьНаСервере = WSИмяБазы +"/hs/sverka/V1/ВыборкаОбъекНеНайден";//ВыборкаОбъекНеНайден	  ObjectNoFound  
		ИначеЕсли ВыборкаHTTP = "ВыборкаОтправкаКонтроль" Тогда   
			ПутьНаСервере = WSИмяБазы +"/hs/sverka/V1/ВыборкаОтправкаКонтроль";	
		КонецЕсли;
		
	КонецЕсли;
		
	Соединение = ПолучитьПодключениеHTTPСервер();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");//"Content-Type","text/html; charset=utf-8");
	//ПутьНаСервере + ИмяКоманды
	
	Запрос = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   //"UTF-8"
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);//ВызватьHTTPМетод("GET", Запрос);//;
	Если Ответ.КодСостояния = 200 Тогда
		
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Попытка
			ДанныеОтвета = unJSON(ТекстОтвета);
		Исключение
			ТекстСообщения = "Ошибка получения структуры из json. Причина: " + ОписаниеОшибки();
			Сообщить(ТекстСообщения);
			Возврат Неопределено;
		КонецПопытки;
		
		//Если ЗначениеЗаполнено(ДанныеОтвета.ОписаниеОшибки) Тогда
		//	Сообщить(ДанныеОтвета.ОписаниеОшибки);
		//	Возврат Неопределено;
		//КонецЕсли;
		
		Возврат ДанныеОтвета;
		
	ИначеЕсли Ответ.КодСостояния = 302 или Ответ.КодСостояния = 301 Тогда // или 301
            НовыйАдрес = Ответ.Заголовки.Получить("Location"); // тут конечно можно добавить проверку на заполненность
			//ЗапросКБазеПриемнику(ИмяКоманды, ДанныеЗапроса, НовыйАдрес);	
			//Результат = ЗагрузитьФайл(НовыйАдрес);	
	Иначе
		ТекстСообщения = "Не удалось выполнить запрос веб-сервиса. Код ответа: " + Ответ.КодСостояния;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

 &НаСервере
Функция unJSON(JSONСтрока) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция JSON(Данные, СОтступами = Истина) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

  
&НаКлиенте
Процедура ДобавитьВБуфер(мЗначения, ВНачало = Ложь) Экспорт
	Если ТипЗнч(мЗначения) <> Тип("Массив") Тогда
		Сообщить("Используйте массив значений");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВыборкаМетаданные(мЗначения);
	//ДобавитьВБуферМассивНаСервере(мЗначения, ВНачало);
	//
	//ПосчитатьБуфер();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВыборкаМетаданные(мЗначения)
	
	Для каждого эл Из мЗначения Цикл
	
		   НоваяСтрока 			   =  ВыборкаМетаданные.Добавить();  
		   НоваяСтрока.Тип 		   =  эл.Тип; 
		   НоваяСтрока.Вид  	   =  эл.Вид;
		   НоваяСтрока.Количество  =  эл.Количество;
	
	КонецЦикла;
	

КонецПроцедуры // ЗаполнитьВыборкаМетаданные()




//&НаСервере
//Процедура ПолучитьСоответствияНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры   

&НаСервере
Функция ПолучитьПланСчетовЛокал()  Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Код КАК Код
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	мПлансСчетов = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мПлансСчетов.Вставить(ВыборкаДетальныеЗаписи.Код,ЗначениеВСтрокуВнутр(ВыборкаДетальныеЗаписи.Ссылка));	
	КонецЦикла;
	
    Возврат  мПлансСчетов;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствияОбъектов1(ТолькоОтличия = Истина, Новые = Ложь) Экспорт
	Если КэшСоответствияОбъектовИнформационныхБаз <> Неопределено И Не Новые Тогда
		Возврат КэшСоответствияОбъектовИнформационныхБаз;
	КонецЕсли;
	
	ЗапросТекст =   "ВЫБРАТЬ
	|	СоответствияОбъектовИнформационныхБаз.ТипИсточника КАК ТипИсточника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой КАК УникальныйИдентификаторИсточника
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|ГДЕ
	|	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы В
	|			(" + ТекстЗапросаПланОбмена() + ") 
	| И    
	|СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы В
	|			(" + ТекстЗапросаПланОбмена_Узел() + ") 
	|";
	
	Если ТолькоОтличия Тогда
		ЗапросТекст = ЗапросТекст
		+ "И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника <> СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой
		|";
	КонецЕсли;
	
	СоответствияОбъектовИнформационныхБаз = Новый Структура("ВнешняяВЛокальную, ЛокальнаяВоВнешнюю", Новый Соответствие, Новый Соответствие);
	
	    Соединение = ПолучитьПодключениеHTTPКлиент();
		
		Если Соединение <> Неопределено Тогда
			
			ДанныеОтвета = ПолучитьМассивРегистраСоотвествия(Соединение,ЗапросТекст); 
			
			Если ДанныеОтвета = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли; 
			
			мРезультат = ДанныеОтвета;
			//сРезультат = ДанныеОтвета[1];
			//зРезультат = ДанныеОтвета[2];
			//дРезультат = ДанныеОтвета[3];
			
			Для каждого мСтр Из мРезультат  Цикл			// Можно переделать на Подключение.ОбменДаннымиПереопределяемый.СтрокаПустогоЗначения(Тип)
				Внешн = мСтр[1];//Подключение.ОбменДаннымиПереопределяемый.СтрокаИзУИД(Выборка.ТипИсточника, Выборка.УникальныйИдентификаторИсточника); // источник это "здесь", на той базе
				Локал = мСтр[0];//Подключение.ОбменДаннымиПереопределяемый.СтрокаИзУИД(Выборка.ТипИсточника, Выборка.УникальныйИдентификаторПриемника);
				
				СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
				СоответствияОбъектовИнформационныхБаз.ЛокальнаяВоВнешнюю.Вставить(Локал, Внешн);
			КонецЦикла; 
			
		//	мПланСчетовЛокал = ПолучитьПланСчетовЛокал();
		//	
		//	Для каждого мСтр Из сРезультат  Цикл
		//		//СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//		Локал =  мПланСчетовЛокал.Получить(мСтр[0]);      
		//		Внешн = мСтр[1]; 
		//		СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//	КонецЦикла;
		//	
		//	ПолучитьСтрокуВнутр = Истина;
		//	ОбъектПроверяемый =  "СтатьиЗатрат";
		//	мПредопредДанныеЛокал = ПолучитьИменаПредопределенныхДанныхЛокал(ОбъектПроверяемый,ПолучитьСтрокуВнутр);  
		//	
		//	Для каждого мСтр Из зРезультат  Цикл
		//		//СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//		Локал =  мПредопредДанныеЛокал.Получить(мСтр[0]);      
		//		Внешн = мСтр[1]; 
		//		СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//	КонецЦикла;  
		//	
		//ОбъектПроверяемый =  "СтатьиДвиженияДенежныхСредств";
		//мПредопредДанныеЛокал = ПолучитьИменаПредопределенныхДанныхЛокал(ОбъектПроверяемый,ПолучитьСтрокуВнутр);  
		//
		//Для каждого мСтр Из дРезультат  Цикл
		//	//СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//	Локал =  мПредопредДанныеЛокал.Получить(мСтр[0]);      
		//	Внешн = мСтр[1]; 
		//	СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную .Вставить(Внешн, Локал);
		//КонецЦикла;  
			
		КонецЕсли;
		КэшСоответствияОбъектовИнформационныхБаз = СоответствияОбъектовИнформационныхБаз;
		
		Возврат СоответствияОбъектовИнформационныхБаз;
		
	//КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьМассивРегистраСоотвествия(Соединение,ЗапросТекст)
	ПутьНаСервере = "";
	Если ЗначениеЗаполнено(WSИмяБазы) Тогда
	   ПутьНаСервере = WSИмяБазы +   "/hs/sverka/V1/ВыборкаСоответствия";
	Иначе
		Сообщить("Заполните путь, базу!");
	КонецЕсли;
	
	ЗапросТекст = ЗапросТекст;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("Узел",Узел);
	
	ДанныеЗапроса = Новый Структура(); 
	ДанныеЗапроса.Вставить("ЗапросПараметры",ЗапросПараметры);
	ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");//"Content-Type","text/html; charset=utf-8");
	Запрос = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);//ВызватьHTTPМетод("GET", Запрос);//;
	ПутьНаСервере = СтрЗаменить(ПутьНаСервере,"/hs/sverka/V1/ВыборкаСоответствия","");
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Попытка
			ДанныеОтвета = unJSON(ТекстОтвета);  
		Исключение
			ТекстСообщения = "Ошибка получения структуры из json. Причина: " + ОписаниеОшибки();
			Сообщить(ТекстСообщения);
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ДанныеОтвета;
	Иначе
		Элементы.ДекорацияПодключение.Подсказка = "Подключение установлено";
		Элементы.ДекорацияПодключение.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
	
		ТекстСообщения = "Не удалось выполнить запрос веб-сервиса. Код ответа: " + Ответ.КодСостояния;
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции // ()


&НаКлиенте
Процедура ПолучитьСоответствия(Команда)
	ПолучитьСоответствияОбъектов1(Истина, Ложь);
КонецПроцедуры


Функция ТекстЗапросаПланОбмена() Экспорт
	Текст = "ВЫБРАТЬ
	|				ПланОбмена.Ссылка КАК Узел
	|			ИЗ
	|				ПланОбмена.[ПланОбмена] КАК ПланОбмена
	|			ГДЕ
	|				НЕ ПланОбмена.ЭтотУзел";
	Текст = СтрЗаменить(Текст, "[ПланОбмена]", ПланОбмена);
	Возврат Текст;
КонецФункции    

Функция ТекстЗапросаПланОбмена_Узел() Экспорт
	Текст = "ВЫБРАТЬ
	|	ПланОбмена.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.[ПланОбмена] КАК ПланОбмена
	|ГДЕ
	|	ПланОбмена.Ссылка.Наименование = &Узел";
	Текст = СтрЗаменить(Текст, "[ПланОбмена]", ПланОбмена);
	Возврат Текст;
КонецФункции   

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого эл Из ВыборкаМетаданные Цикл
		эл.Выбор = Истина;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
		Для каждого эл Из ВыборкаМетаданные Цикл
		эл.Выбор = Ложь;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтфильтроватьПОФайлу(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("НачатьВыборФайла", ЭтаФорма)); 
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);  
	
	СобытиеЖР ="Загрузка эксель";	
	
	ОбработататьНаСервереДвДанные(ДвоичныеДанные, "xlsx",СобытиеЖР);
    
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыборЗавершения", ЭтотОбъект,ВыбранноеИмяФайла),
	"Выполнено",РежимДиалогаВопрос.ОК);
	//
КонецПроцедуры 

&НаСервере
Процедура ОбработататьНаСервереДвДанные( ДвоичныеДанные, ТипФайла,СобытиеЖР)
	
	ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(ТипФайла);
	ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ТвояОбласть    = ТабличныйДокумент.ПолучитьОбласть();
	
	Для к = 1 По ТвояОбласть.ВысотаТаблицы   Цикл 
		ПарОтбора = Новый Структура;
		ПарОтбора.Вставить("Тип",ТвояОбласть.Область(к,2,к,2).Текст);  
		ПарОтбора.Вставить("Вид",ТвояОбласть.Область(к,3,к,3).Текст);
	    НайденныеСтроки = 	ВыборкаМетаданные.НайтиСтроки(ПарОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
		
			  НайденныеСтроки[0].Выбор = Истина;
		
		КонецЕсли;
		
		//Сообщить(ТвояОбласть.Область(к,1,к,1).Текст);	
	КонецЦикла;
	
	УдалитьФайлы(ФайлEXCELНаСервере);
	//
	//Результат = Новый СписокЗначений;
	//Области = ТабличныйДокумент.Области;
	//Если Области.Количество()=0 Тогда 
	//	ВызватьИсключение("В файле нет областей");
	//КонецЕсли;
	//
	//ФункцияОбработкиСтрок = "СокрЛП(?)";
	//
	//МассивДанных = Новый Массив;
	//
	//Для Каждого Обл Из Области Цикл
	//	ТекТабДок = Новый ТабличныйДокумент;   
	//	ТД = Новый Структура;
	//	ОгрОбласть = ПолучитьОграниченнуюОбласть(ТабличныйДокумент, Обл);
	//	// вставим область в табдок
	//	ОгрОбласть.Имя = Обл.Имя;
	//	ТекТабДок.ВставитьОбласть(ОгрОбласть, 
	//	ТекТабДок.Область(1, ОгрОбласть.Лево, ОгрОбласть.Низ - ОгрОбласть.Верх + 1, ОгрОбласть.Право)
	//	);
	//	
	//	ОбластьТ = ТекТабДок.Область(1, ОгрОбласть.Лево, ОгрОбласть.Низ - ОгрОбласть.Верх + 1, ОгрОбласть.Право);  
	//	
	//	СократитьСтроки(ТекТабДок, ФункцияОбработкиСтрок);
	//	
	//	ТД.Вставить("ОгрОбластьИмя",ОгрОбласть.Имя);
	//	ТД.Вставить("ТекТабДок",ТекТабДок); 
	//	ТД.Вставить("ОбластьТ",ОбластьТ);
	//	
	//	МассивДанных.Добавить(ТД);
	//	Результат.Добавить(ТекТабДок, Обл.Имя);
	//КонецЦикла;
	//
	//
	////ОбластьТаблицы = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	//Рез = Новый Массив;
	//Для каждого эл Из МассивДанных Цикл  
	//	//ОбластьТаблицы = эл.Значение.Область(1, 1,  эл.Значение.ВысотаТаблицы,  эл.Значение.ШиринаТаблицы);
	//	ОбластьТаблицы = эл.ОбластьТ;
	//	ПостроительЗапроса = Новый ПостроительЗапроса;
	//	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);
	//	ПостроительЗапроса.Выполнить();
	//	ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();  
	//	Рез.Добавить(ТаблицаДанных);
	//КонецЦикла;

	

КонецПроцедуры 

&НаСервере
Процедура СократитьСтроки(ТабДок, ФункцияОбработкиСтрок = "СокрЛП(?)")
	
	Если ПустаяСтрока(ФункцияОбработкиСтрок) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Ложь Тогда ТабДок = Новый ТабличныйДокумент; КонецЕсли; // фейк
	
	Для Стр = 1 По ТабДок.ВысотаТаблицы Цикл 
		Для Кол = 1 По ТабДок.ШиринаСтраницы Цикл 
			ТекОбласть = ТабДок.Область(Стр, Кол);
			ТекстОбласти = ТекОбласть.Текст;
			Если Не ТекОбласть.СодержитЗначение И Не ПустаяСтрока(ТекОбласть.Текст)    Тогда 
				Выражение = СтрЗаменить(ФункцияОбработкиСтрок, "?", "ТекстОбласти");
				ТекОбласть.Текст = Вычислить(Выражение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЭтоЗначащаяОбласть(ОбластьЯчеек)
	Возврат Не ПустаяСтрока(ОбластьЯчеек.Текст) 
	Или ОбластьЯчеек.Гиперссылка
	Или ОбластьЯчеек.СодержитЗначение
	//Или ОбластьЯчеек.ГраницаСверху.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
	//Или ОбластьЯчеек.ГраницаСнизу.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
	Или ОбластьЯчеек.ГраницаСлева.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
	Или ОбластьЯчеек.ГраницаСправа.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
	;
КонецФункции


&НаСервере
Функция ПолучитьОграниченнуюОбласть(ТабДок, ОбластьЯчеек,
	ОграничиватьСверху = Истина, ОграничиватьСлева = Истина, ОграничиватьСнизу = Истина, ОграничиватьСправа = Истина)
	
	Если Не ОграничиватьСверху И Не ОграничиватьСлева И Не ОграничиватьСправа И Не ОграничиватьСнизу Тогда 
		Возврат ОбластьЯчеек;
	КонецЕсли;
	
	Если Ложь Тогда // фейк
		ТабДок = Новый ТабличныйДокумент;
		ОбластьЯчеек = ТабДок.Области[0];
	КонецЕсли;
	
	Лево = Неопределено; Право = Неопределено; Верх = Неопределено; Низ = Неопределено;
	МаксШирина = ТабДок.ШиринаТаблицы;
	Для Стр = ОбластьЯчеек.Верх По ОбластьЯчеек.Низ Цикл
		Для Кол = 1 По МаксШирина Цикл 
			ТекОбласть = ТабДок.Область(Стр, Кол);
			Если ЭтоЗначащаяОбласть(ТекОбласть) Тогда 
				Лево = ?(Лево=Неопределено, Кол, Мин(Лево, Кол));
				Право = ?(Право=Неопределено, Кол, Макс(Право, Кол));
				Верх = ?(Верх=Неопределено, Стр, Верх);
				Низ = ?(Низ=Неопределено, Стр, Макс(Низ, Стр));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Результат = ТабДок.Область(
	?(ОграничиватьСверху, ?(Верх=Неопределено, ОбластьЯчеек.Верх, Верх), ОбластьЯчеек.Верх),
	?(ОграничиватьСлева, ?(Лево=Неопределено, ОбластьЯчеек.Лево, Лево), ОбластьЯчеек.Лево),
	?(ОграничиватьСнизу, ?(Низ=Неопределено, ОбластьЯчеек.Низ, Низ), ОбластьЯчеек.Низ),
	?(ОграничиватьСправа, ?(Право=Неопределено, ОбластьЯчеек.Право, Право), ОбластьЯчеек.Право)
	);
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ВыборЗавершения(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		
	КонецЕсли;	
КонецПроцедуры



