 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 #Область ПрограммныйИнтерфейс
 // Возвращает список актуальных баз.
 // Актуальными считаются элементы справочника EMS_ПараметрыБаз,
 // у которых заполнены КодОрганизации и НаименованиеУзлаИБ.
 //
 // Возвращаемое значение:
 //  Массив из СправочникСсылка.EMS_ПараметрыБаз - массив ссылок на актуальные параметры баз.
 //
 Функция СписокАктуальныхБаз() Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	EMS_ПараметрыБаз.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.EMS_ПараметрыБаз КАК EMS_ПараметрыБаз
	 |ГДЕ
	 |	EMS_ПараметрыБаз.КодОрганизации <> """"
	 |	И EMS_ПараметрыБаз.НаименованиеУзлаИБ <> """"";
	 
	 Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
 КонецФункции
 #КонецОбласти
 
 #Область ОбработчикиСобытий
 
 #КонецОбласти
 
 #Область СлужебныйПрограммныйИнтерфейс
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 #КонецОбласти
 
 #КонецЕсли
 