
Функция ПолучитьОбъектыВыборка(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Результат = Новый Структура("СписокОбъектов, ОписаниеОшибки", Новый Массив, "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВхПараметров = Новый Структура;
	//Получаем имя метода
	перИмяМетода  = Запрос.ПараметрыURL["ИмяМетода"];    
	//Помещаем имя метода в структуру
	СтруктураВхПараметров.Вставить("ИмяМетода",перИмяМетода); 
	
	Если перИмяМетода = "Проверка2" Тогда 
		Возврат Ответ;	
	Иначе   
		//Забираем параметры из запроса
		//ВхПараметрыЗапроса = Новый Соответствие;
		//Для каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
		//	ВхПараметрыЗапроса.Вставить(Параметр.Ключ,Параметр.Значение);
		//КонецЦикла;
		//СтруктураВхПараметров.Вставить("ПараметрыЗапроса",ВхПараметрыЗапроса);
		
		Попытка
			ДанныеЗапроса = ОбменДаннымиПереопределяемый.unJSON(ТелоЗапроса);
		Исключение
			Результат.ОписаниеОшибки = "Ошибка получения данных запроса из json: " + ОписаниеОшибки();
			Ответ.УстановитьТелоИзСтроки(ОбменДаннымиПереопределяемый.JSON(Результат, Ложь));
			Возврат Ответ;
		КонецПопытки; 
		
		Результат = ОбменДаннымиПереопределяемый.ОбработкаМетодовPOST(ДанныеЗапроса,перИмяМетода);
		
		Ответ.УстановитьТелоИзСтроки(ОбменДаннымиПереопределяемый.JSON(Результат, Ложь));
		
		Возврат Ответ;
		
	КонецЕсли;
	
		
	//
	////Передаем входящие параметры (Модуль для метода GET)
	//СтруктураОтвет = ОбменДаннымиПереопределяемый.ОбработкаМетодовGET(СтруктураВхПараметров);
	//
	////Создаем ответ с кодом состояния
	//Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета);
	//Если СтруктураОтвет.Отработало Тогда 
	//    Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвета,КодировкаТекста.UTF8);
	//Иначе
	//	Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки,КодировкаТекста.UTF8);
	//КонецЕсли;	
	//
	//Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	//Возврат Ответ;
КонецФункции


