
&НаСервере
Процедура ВыполнитьПоискНаСервере()        
    мРезультат = Новый Массив;
	ВыбратьОбъектНеНайден = Истина;
	Если ПочиститьРС Тогда
		ВыборкаФункция ="";	
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция);
	КонецЕсли;	  
	
    ПараметрыВыполнения = Новый Структура;    
	ПараметрыВыполнения.Вставить("ВыбратьОбъектНеНайден",ВыбратьОбъектНеНайден);
	ПараметрыВыполнения.Вставить("МетаданныеПроверяемогоРС",МетаданныеПроверяемогоРС); 
	ПараметрыВыполнения.Вставить("МетаданныеПроверяемогоСправочника",МетаданныеПроверяемогоСправочника);
	ПараметрыВыполнения.Вставить("ТолькоВерхнийУровень",ТолькоВерхнийУровень);       
	ПараметрыВыполнения.Вставить("ВыборкаФункция",ВыборкаФункция);
	//ПараметрыВыполнения.Вставить();

	Откуда  = ВыборкаФункция +"."+МетаданныеПроверяемогоРС;
	
	Если ВыборкаФункция = "Справочники"  Тогда
		мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервере(ПараметрыВыполнения);
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция);   
	ИначеЕсли ВыборкаФункция = "Документы"  Тогда
		мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервере(ПараметрыВыполнения);
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция);   
	ИначеЕсли ВыборкаФункция = "РегистрыСведений"  Тогда
		мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеНаСервереРС(ПараметрыВыполнения);
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,Откуда); 	
	ИначеЕсли ВыборкаФункция = "Обороты" Тогда 	
		Если ОргИД = Неопределено Тогда
			Сообщить("Организация не заполнена!");
			Возврат;
		КонецЕсли;
		Если Период = Неопределено Тогда
			Сообщить("Период не заполнен!");
			Возврат
		КонецЕсли;
		
		ЗапросПараметры = Новый Структура;
		ЗапросПараметры.Вставить("НачалоПериода", Период.ДатаНачала);
		ЗапросПараметры.Вставить("КонецПериода" , КонецДня(Период.ДатаОкончания));
		ЗапросПараметры.Вставить("Организация", ОргИД);
		
		мРезультат = ОбменДаннымиПереопределяемый.ВыполнитьЗапросОбъектНеНайденСервер(ЗапросПараметры,ВыбратьОбъектНеНайден);        
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция);
	ИначеЕсли ВыборкаФункция = "Иерархия" Тогда  
		мРезультат =    ОбменДаннымиПереопределяемый.цМетаданныеИерархия(МетаданныеПроверяемогоСправочника,ВыбратьОбъектНеНайден);
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция); 
	ИначеЕсли ВыборкаФункция = "ДокументыБезПроводок" Тогда
		мРезультат =    ОбменДаннымиПереопределяемый.цПоДокументамБезПроводок(ВыбратьОбъектНеНайден);
		Рез = ОбменДаннымиПереопределяемый.ЗаписатьВРСОбъектНеНайден(мРезультат,ПочиститьРС,ВыборкаФункция); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МетаданныеПроверяемогоСправочника = "БанковскиеСчета";  
	МетаданныеПроверяемогоРС = "СоответствияОбъектовИнформационныхБаз";
КонецПроцедуры
