//&НаКлиенте
//Перем ОбменСтарт Экспорт;
//&НаКлиенте
//Перем ОбменФиниш Экспорт;
//&НаКлиенте
//Перем ИтерацияНомер Экспорт;
//&НаКлиенте
//Перем ИтерацияСтарт Экспорт;
//&НаКлиенте
//Перем ИтерацияФиниш Экспорт;
//&НаКлиенте
//Перем ОбменКоличество Экспорт;
//&НаКлиенте
//Перем ИтерацияКоличество Экспорт;

// Определяет к какому типу данных относится объект
//  Объект может быть:
//  - Ссылкой или объектом
//  - Объектом метаданных
//  - Типом
&НаСервереБезКонтекста
Функция ТипОбъекта(Объ, ТипВозврата = "") Экспорт
	Если      ТипЗнч(Объ) = Тип("ОбъектМетаданных") Тогда
		МД = Объ;
	ИначеЕсли ТипЗнч(Объ) = Тип("Тип") Тогда
		МД = Метаданные.НайтиПоТипу(Объ);
	Иначе
		Попытка
			МД = Объ.Метаданные();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Типы = 
		"БизнесПроцессы"
		"Документы"
		"ЖурналыДокументов"
		"Задачи"
		"Константы"
		"Обработки"
		"Отчеты"
		"Перечисления"
		"ПланыВидовРасчета"
		"ПланыВидовХарактеристик"
		"ПланыСчетов"
		"РегистрыБухгалтерии"
		"РегистрыНакопления"
		"РегистрыРасчета"
		"РегистрыСведений"
		"Справочники"
		"WebСервисы"
		"WSСсылки"
		"Интерфейсы"
		"КритерииОтбора"
		"НумераторыДокументов"
		"ОбщиеКартинки"
		"ОбщиеМакеты"
		"ОбщиеМодули"
		"ОбщиеФормы"
		"ПакетыXDTO"
		"ПараметрыСеанса"
		"ПланыОбмена"
		"ПодпискиНаСобытия"
		"Подсистемы"
		"Последовательности"
		"РегламентныеЗадания"
		"Роли"
		"Стили"
		"ЭлементыСтиля"
		"Языки"
		"ОбщиеКоманды"
		"HTTPСервисы"
		"ВнешниеИсточникиДанных"
		"ГруппыКоманд"
		"ОбщиеРеквизиты"
		"ОпределяемыеТипы"
		"ПараметрыФункциональныхОпций"
		"ФункциональныеОпции"
		"ХранилищаНастроек"
	;
	
	Тип = Неопределено;
	Для Сч = 1 По СтрЧислоСтрок(Типы) Цикл
		ТекТип = СтрПолучитьСтроку(Типы, Сч);
		Если Метаданные[ТекТип].Содержит(МД) Тогда
			Тип = ТекТип;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипВозврата = "" Тогда
		Возврат Тип;
		
	Иначе // Для запроса ???
		Возврат СтрПолучитьСтроку(
			"БизнесПроцесс"
			"Документ"
			"ЖурналДокументов"
			"Задача"
			"Константа"
			"Обработка"
			"Отчет"
			"Перечисление"
			"ПланВидовРасчета"
			"ПланВидовХарактеристик"
			"ПланСчетов"
			"РегистрБухгалтерии"
			"РегистрНакопления"
			"РегистрРасчета"
			"РегистрСведений"
			"Справочник"
			"WebСервис"
			"WSСсылка"
			"Интерфейс"
			"КритерийОтбора"
			"НумераторДокументов"
			"ОбщаяКартинка"
			"ОбщийМакет"
			"ОбщийМодуль"
			"ОбщаяФорма"
			"ПакетXDTO"
			"ПараметрСеанса"
			"ПланОбмена"
			"ПодпискаНаСобытия"
			"Подсистема"
			"Последовательность"
			"РегламентноеЗадание"
			"Роль"
			"Стиль"
			"ЭлементСтиля"
			"Язык"
			"ОбщаяКоманда"
			"HTTPСервис"
			"ВнешнийИсточникДанных"
			"ГруппаКоманд"
			"ОбщийРеквизит"
			"ОпределяемыйТип"
			"ПараметрФункциональныхОпций"
			"ФункциональнаяОпция"
			"ХранилищеНастроек"
		, Сч);
		
	КонецЕсли;
КонецФункции

&НаСервере
Процедура БуферЗаполнитьИзБазыДанныхНаСервере(ПоДокументам = Истина)
	
//	БуферДляПоиска = Новый Соответствие;
////	ЗаполнитьБуферДляПоиска(Буфер, БуферДляПоиска);
//	Для Каждого Стр Из Буфер Цикл
//		БуферДляПоиска.Вставить(Стр.Значение, Истина);
//	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Если ПоДокументам Тогда
		ДЗ = РеквизитФормыВЗначение("Состав");
		
		Для Каждого Папка Из ДЗ.Строки Цикл
			Если Не Папка.Отметка Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ТипВид Из Папка.Строки Цикл
				Если Не ТипВид.Отметка Тогда
					Продолжить;
				КонецЕсли;
				
				Если Запрос.Текст <> "" Тогда
					Запрос.Текст = Запрос.Текст + "
						|ОБЪЕДИНИТЬ ВСЕ
						|";
				КонецЕсли;
				
				Запрос.Текст = Запрос.Текст + "
					|ВЫБРАТЬ
					|	Таблица.Ссылка
					|ИЗ
					|	" + Папка.ТипВид + "." + ТипВид.ТипВид + " КАК Таблица
					|ГДЕ
					|	Истина
					//НЕ Таблица.ПометкаУдаления
					|";
				
				Если Папка.ТипВид = "Документ" Тогда
					Запрос.Текст = Запрос.Текст + "
						| И Таблица.Дата между &НачалоПериода И &КонецПериода
						|";
				КонецЕсли;
				Если Не Организация.Пустая() Тогда
					Если      ТипВид.Родитель.ТипВид = "Справочник" Тогда
						МД = Метаданные.Справочники;
					ИначеЕсли ТипВид.Родитель.ТипВид = "Документ" Тогда
						МД = Метаданные.Документы;
					ИначеЕсли ТипВид.Родитель.ТипВид = "ПланСчетов" Тогда
						МД = Метаданные.ПланыСчетов;
					ИначеЕсли ТипВид.Родитель.ТипВид = "ПланВидовРасчета" Тогда
						МД = Метаданные.ПланыВидовРасчета;
					ИначеЕсли ТипВид.Родитель.ТипВид = "ПланВидовХарактеристик" Тогда
						МД = Метаданные.ПланыВидовХарактеристик;
					ИначеЕсли ТипВид.Родитель.ТипВид = "РегистрСведений" Тогда
						МД = Метаданные.РегистрыСведений;
					КонецЕсли;
					МД = МД[ТипВид.ТипВид];
					
					ГдеИскать = Неопределено;
					Если ТипВид.Родитель.ТипВид = "Справочник"
					 Или ТипВид.Родитель.ТипВид = "Документ"
					Тогда
						ГдеИскать = МД.Реквизиты;
					ИначеЕсли  ТипВид.Родитель.ТипВид = "РегистрСведений" Тогда
						ГдеИскать = МД.Измерения;
					КонецЕсли;
					
					Если ГдеИскать <> Неопределено И ГдеИскать.Найти("Организация") <> Неопределено Тогда
						Запрос.Текст = Запрос.Текст + "
							| И Таблица.Организация в  Иерархии (&Организация)
							|";
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ХозрасчетныйОбороты.Регистратор КАК Ссылка
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В Иерархии (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты";
		
		Если ЗначениеЗаполнено(Счет) Тогда
			Запрос.УстановитьПараметр("Счет", Счет);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Счет В Иерархии (&Счет)", "");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Запрос.Текст = "" Тогда
		Возврат;
	КонецЕсли;
	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеНаДату", "И Таблица.Дата между &НачалоПериода И &КонецПериода");
	
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала   );
	Запрос.УстановитьПараметр("КонецПериода" , Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьВБуферЗначениеНаСервере(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СохраняемоеЗначениеВРегистрируемоеЗначение(Ссылка)
	ОЗн = ОЗначении(Ссылка);
	
	Значение = Ссылка;
	
	Если ОЗн.ЭтоРегистр Тогда // Регистры: Ключ записи в Набор записей
		Если ОЗн.ПоРегистратору Тогда
			Значение = Ссылка.Регистратор;
		Иначе
			Если      ОЗн.Тип = "РегистрыСведений" Тогда
				Менеджер = РегистрыСведений;
			ИначеЕсли ОЗн.Тип = "РегистрыНакопления" Тогда
				Менеджер = РегистрыНакопления;
			КонецЕсли;
			НЗ = Менеджер[ОЗн.Вид].СоздатьНаборЗаписей();
			ЗаполнитьЗначенияСвойств(НЗ.Отбор, Ссылка);
			
			Для Каждого Эл Из НЗ.Отбор Цикл
				Эл.Значение = Ссылка[Эл.Имя];
				Эл.Использование = Истина;
			КонецЦикла;
			
			Значение = НЗ;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
КонецФункции

&НаСервереБезКонтекста
Функция ТекстОшибкиРегистрацииИзменений(Узел, Значение)
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат НСтр("ru='Не выбран узел плана обмена.'");
	КонецЕсли;
	
	МетаданныеПлана = Узел.Метаданные();
	Если Узел = ПланыОбмена[МетаданныеПлана.Имя].ЭтотУзел() Тогда
		Возврат НСтр("ru='Выбран этот узел (текущая информационная база). Регистрировать изменения можно только для узла-корреспондента.'");
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Значение));
	Если МетаданныеОбъекта = Неопределено Тогда
		Попытка
			МетаданныеОбъекта = Значение.Метаданные();
		Исключение
			Возврат НСтр("ru='Не удалось определить метаданные регистрируемого объекта.'");
		КонецПопытки;
	КонецЕсли;
	
	ОбъектВСоставе = Ложь;
	Для Каждого ЭлементСостава Из МетаданныеПлана.Состав Цикл
		Если ЭлементСостава.Метаданные = МетаданныеОбъекта Тогда
			ОбъектВСоставе = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОбъектВСоставе Тогда
		Возврат СтрШаблон(
			НСтр("ru='Объект %1 не входит в состав плана обмена %2.'"),
			МетаданныеОбъекта.ПолноеИмя(),
			МетаданныеПлана.Имя);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОбъектНаСервере(Узел, Ссылка) Экспорт
	Значение = СохраняемоеЗначениеВРегистрируемоеЗначение(Ссылка);
	
	Если Значение = Неопределено Тогда
		Сообщить("Пустое значение: " + Ссылка);
		Возврат;
	КонецЕсли;
	
	ТекстОшибкиПроверки = ТекстОшибкиРегистрацииИзменений(Узел, Значение);
	Если ЗначениеЗаполнено(ТекстОшибкиПроверки) Тогда
		Сообщить(""
			+ "Ошибка регистрации объекта "
			+ "(" + Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)) + " / " + ТипЗнч(Ссылка) + "): "
			+ Ссылка + Символы.ПС
			+ ТекстОшибкиПроверки
		);
		Возврат;
	КонецЕсли;
	
	Попытка
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Значение);
	Исключение
		Сообщить(""
			+ "Ошибка регистрации объекта "
			+ "(" + Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)) + " / " + ТипЗнч(Ссылка) + "): "
			+ Ссылка + Символы.ПС
			+ ОписаниеОшибки()
		);
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура ЗарегистрироватьРС(Команда)
	Список = Новый Массив;
	Список.Добавить("БухучетЗарплатыОрганизаций");
	Список.Добавить("ГражданствоФизическихЛиц");
	Список.Добавить("ДокументыФизическихЛиц");
	Список.Добавить("ЖурналОтчетовСтатусы");
	Список.Добавить("ИспользоватьНесколькоБанковскихСчетовОрганизации");
	Список.Добавить("ИсторияРегистрацийВНалоговомОргане");
	Список.Добавить("ИсторияРегистрацийВНалоговомОрганеВторичный");
	Список.Добавить("ИсторияРегистрацийВОрганеПФР");
	Список.Добавить("МестаВыплатыЗарплатыСотрудников");
	Список.Добавить("МетодыРаспределенияКосвенныхРасходовОрганизаций");
	Список.Добавить("НастройкиЗарплатаКадры");
	
	Список.Добавить("НастройкиУчетаЗарплаты");
	Список.Добавить("ОрганизацииВКоторыхРаботалиСотрудники");
	Список.Добавить("ОсновныеВариантыПеречисленияСотруднику");
	Список.Добавить("ОсновныеДоговорыКонтрагента");
	Список.Добавить("ОсновныеСотрудникиФизическихЛиц");
	Список.Добавить("ОтветственныеЛицаОрганизаций");
	//Список.Добавить("ПечатныеБланкиРегламентированныхОтчетов");
	Список.Добавить("ПорядокОтраженияЗарплатыВБухУчете");
	Список.Добавить("ПорядокУплатыНалоговНаМестах");
	Список.Добавить("СклоненияПредставленийОбъектов");
	Список.Добавить("СостоянияБанковскихДокументов");
	
	Список.Добавить("СпособыОтраженияРасходовПоНалогам");
	Список.Добавить("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев");
	Список.Добавить("СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	Список.Добавить("СтатусФизическихЛицКакНалогоплательщиковНДФЛ");
	Список.Добавить("СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный");
	Список.Добавить("СтатусыДокументов");
	Список.Добавить("СтатусыЗастрахованныхФизическихЛиц");
	Список.Добавить("СтатьиЗатратПоНалогамВзносамСФОТ");
	Список.Добавить("УполномоченныеЛицаОрганизаций");
	Список.Добавить("ФИОФизическихЛиц");
	Список.Добавить("ЦеныНоменклатурыДокументов");
	
	Состояние("Выполняется регистрация регистров сведений");
	
	ЗарегистрироватьРСНаСервере(Список);
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьРСНаСервере(Список)
	Для каждого ИмяРегистра Из Список Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.РегистрыСведений[ИмяРегистра]);
	КонецЦикла;
КонецПроцедуры

// Регистрируем набор записей
// Отбор - на измерения, у которых стоит Основной отбор
&НаСервере
Функция ЗарегистрироватьНаборЗаписейРегистраСведений(Узел, ИмяРегистра, Отбор) Экспорт
	Если Истина Тогда
		НЗ = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Иначе
		НЗ = РегистрыСведений.ПорядокОтраженияЗарплатыВБухУчете.СоздатьНаборЗаписей();
	КонецЕсли;
	
	НЗ.Отбор.СпособОтраженияЗарплатыВБухУчете.Установить(Отбор.СпособОтраженияЗарплатыВБухУчете);
	НЗ.Отбор.ЕНВД.Установить(Отбор.ЕНВД);
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, НЗ);
КонецФункции


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Инициализация = ДПараметры.Инициализация;
	ВыполнятьИтерациями = ДПараметры.ВыполнятьИтерациями;
	
	Если Инициализация Тогда
		
		ОбСтарт = ""; ОбИтер = 0; ОбКол = 0; ОбУдел = 0; ОбФиниш = "";
		ВыСтарт = ""; ВыИтер = 0; ВыКол = 0; ВыУдел = 0; ВыФиниш = "";
		ПрСтарт = ""; ПрИтер = 0; ПрКол = 0; ПрУдел = 0; ПрФиниш = "";
		ТкСтарт = ""; ТкИтер = 0; ТкКол = 0; ТкУдел = 0; ТкФиниш = "";
		
		ТД = ТекущаяДата();
		ОбСтарт = ТД; ОбИтер = 1; ОбКол  = 0; // замер иниц обмен
	КонецЕсли;
	
	Если ВыполнятьИтерациями И СинхронизацияПолучатьОбъектыИзРегистрации Тогда
		ОбработатьОбъектыРегистрацииНаСервере(Узел, ОбработатьОбъектыРегистрацииОтправленные, ОбработатьОбъектыРегистрацииНеОтправленные, ОбработатьОбъектыРегистрацииПолучитьВБуфер, ОбработатьОбъектыРегистрацииПолучитьВБуферВНачало, ОбработатьОбъектыРегистрацииПосчитать, ОбработатьОбъектыРегистрацииУдалить);
	КонецЕсли;
	
	ТД = ТекущаяДата();
	Если ВыполнятьИтерациями Тогда
		Остаток = Буфер.Количество();
		КПереносу = Мин(КоличествоОбъектовВИтерации, Остаток);
		
		
		Если Не Инициализация Тогда
			ТкФиниш = ТД; ТкУдел = ?(ТкКол > 0, (ТкФиниш - ТкСтарт) / ТкКол, 0); // замер финиш текущая
			
			ПрСтарт = ТкСтарт; ПрИтер = ТкИтер; ПрКол = ТкКол; ПрУдел = ТкУдел; ПрФиниш = ТкФиниш; // замер финиш предыдущая
			
			ВыКол = ВыКол + ТкКол; ВыИтер = ВыИтер + ТкИтер; // замер финиш выгружено
			ВыФиниш = ТД; ВыУдел = ?(ВыКол > 0, (ВыФиниш - ВыСтарт) / ВыКол, 0);
		КонецЕсли;
		
		ОбИтер = ВыИтер + Окр(Остаток / КоличествоОбъектовВИтерации + 0.5, 0, РежимОкругления.Окр15как20); // замер финиш обмен
		ОбКол  = ВыКол + Остаток;
		
		
		Если ПрКол = 0 И КПереносу = 0 Тогда
			ОбКол = ВыКол; ОбФиниш = ВыФиниш; ОбУдел = ВыУдел;
			
			Заголовок = "Управляемая синхронизация";
			
			Предупреждение("Синхронизация выполнена");
			
			Возврат;
		КонецЕсли;
		
		
		ТкСтарт = ТД; ТкИтер = 1; ТкКол = КПереносу; // замер старт текущая
		Если Инициализация Тогда
			ОбСтарт = ТД;
			ВыСтарт = ТД;
		Иначе
			ТкУдел = ПрУдел;
			ТкФиниш = ТкСтарт + ТкКол * (ПрФиниш - ПрСтарт) / ПрКол; // прогноз
			
			ОбУдел = ПрУдел;
			ОбФиниш = ТД + Остаток * (ПрФиниш - ПрСтарт) / ПрКол; // прогноз
		КонецЕсли;
		
		Заголовок = "Управляемая синхронизация " + Формат(ВыКол / ОбКол * 100, "ЧДЦ=0; ЧН=; ЧГ=") + "%";
		
		ЗарегистрироватьБуфер(КоличествоОбъектовВИтерации);
		
	Иначе
		Если Не Инициализация Тогда
			ОбФиниш = ТД;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ВыполнятьИтерациями", ВыполнятьИтерациями);
	Оповещение = Новый ОписаниеОповещения("ВызватьПослеИтерации", ЭтаФорма, ДопПараметры);
	ДПО = Новый Структура("ПараметрыПомощника, ОповещениеОЗакрытии", Новый Структура("ЗакрытьПриУспешнойСинхронизации", Истина), Оповещение);
	
	ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(Узел, ЭтаФорма,,, ДПО);
	

КонецПроцедуры
		


&НаКлиенте
Процедура ВыполнитьСинхронизацию(ВыполнятьИтерациями, Инициализация = Истина)

		//Если Вопрос("Запустить синхронизацию?", РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена) <> КодВозвратаДиалога.ОК Тогда
		//	Возврат;
		//КонецЕсли; 
		//
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Инициализация"		,Инициализация); 
		ДопПараметры.Вставить("ВыполнятьИтерациями",ВыполнятьИтерациями);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Запустить синхронизацию?';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
		
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьСинхронизациюВопрос(Результат, ДопПараметры) Экспорт
	
	//Если ДопПараметры.ВыполнятьИтерациями И ДопПараметры.ТаймаутИтерацийОбмена > 0 Тогда
		Если Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
//	КонецЕсли;
	
    ВыполнятьИтерациями	  = Истина;
	ВыполнитьСинхронизацию(ВыполнятьИтерациями, Ложь);  //ДопПараметры.ВыполнятьИтерациями
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьПослеИтерации(Пар1, ДопПараметры) Экспорт
	//Если ДопПараметры.ВыполнятьИтерациями И ТаймаутИтерацийОбмена > 0 Тогда
	//	Ответ = Вопрос("Пауза для завершения обмена в базе-корреспонденте", РежимДиалогаВопрос.ОКОтмена, ТаймаутИтерацийОбмена, , , КодВозвратаДиалога.ОК);
	//	Если Ответ <> КодВозвратаДиалога.ОК И Ответ <> КодВозвратаДиалога.Таймаут Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;    
	
	    ДопПараметры = Новый Структура;
		//ДопПараметры.Вставить("ВыполнятьИтерациями"		,ДопПараметры.ВыполнятьИтерациями); 
		//ДопПараметры.Вставить("ТаймаутИтерацийОбмена",ТаймаутИтерацийОбмена);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ВыполнитьСинхронизациюВопрос", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Пауза для завершения обмена в базе-корреспонденте';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
		


КонецПроцедуры

&НаКлиенте
Процедура БуферОчистить(Команда)
	Если Вопрос("Очистить буфер?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	БуферОчиститьНаСервере();
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаСервере
Процедура БуферОчиститьНаСервере()
	Буфер.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПосчитатьБуфер();
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьБуфер()
	Элементы.ГруппаБуфер.Заголовок = "Буфер" + ?(Буфер.Количество() > 0, " (" + Буфер.Количество() + ")", "");
КонецПроцедуры

&НаСервере
Процедура ОбработатьОбъектыРегистрацииНаСервере(Узел, Отправленные, НеОтправленные, ПолучитьВБуфер, ПолучитьВБуферВНачало, Посчитать, Удалить)
	Запросы = Новый Соответствие;
	Для Каждого ЭлСостав Из Узел.Метаданные().Состав Цикл
		МД = ЭлСостав.Метаданные;
		Тип = ТипОбъекта(МД, "Запрос");
		
		// В таблице изменений ссылочных объектов есть поле Ссылка.
		// У регистров, констант и последовательностей его нет: Регистратор или только Узел.
		Если Тип <> "Справочник"
			И Тип <> "Документ"
			И Тип <> "ПланВидовХарактеристик"
			И Тип <> "ПланСчетов"
			И Тип <> "ПланВидовРасчета"
			И Тип <> "БизнесПроцесс"
			И Тип <> "Задача"
			И Тип <> "ПланОбмена" Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = "Ссылка";
		Измерения = "Ссылка";
		ИзмеренияПути = "ТаблицаИзменения.Ссылка КАК Ссылка";
		УсловиеСоединения = "";
		
		Если Тип = "РегистрСведений" Тогда
			
			Продолжить;
			
			Если МД.Измерения.Количество()  = 0 Тогда 
				
				Продолжить;
			
			КонецЕсли;  
			
			Если МД.Имя = "НастройкиРасчетаЗарплатыРасширенный" 
				или МД.Имя = "ПравилаДляОбменаДанными" 
				или МД.Имя = "СообщенияОбменаДаннымиОбластейДанных" 
				или МД.Имя = "ОчередьРасширенийДляОповещений"
				или МД.Имя = "ПараметрыОбменСБанками" 
				или МД.Имя = "МинимальнаяОплатаТрудаРФ"
				или МД.Имя = "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса" 
				или МД.Имя = "ИспользуемыеВидыДоступа" Тогда 
				
				Продолжить;
				
			КонецЕсли;
			
			Ключ = Тип + "." + МД.Имя;
			
			мИзмерения = Новый Массив;
			ИзмеренияПути = Новый Массив;
			
			Периодический  = МД.ПериодичностьРегистраСведений
				<> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
			;
			ПоРегистратору = МД.РежимЗаписи
				= Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору
			;
			
			Если ПоРегистратору Тогда
				мИзмерения   .Добавить("Регистратор");
				ИзмеренияПути.Добавить("ТаблицаИзменения.Регистратор");
			Иначе
				Если Периодический Тогда
					мИзмерения   .Добавить("Период");
					ИзмеренияПути.Добавить("ТаблицаРегистр.Период КАК Период");
				КонецЕсли;
				
					Для Каждого ТекИзм Из МД.Измерения Цикл
						Если Не ТекИзм.ОсновнойОтбор Тогда
							Продолжить;
						КонецЕсли;
						
						мИзмерения   .Добавить(ТекИзм.Имя);
						ИзмеренияПути.Добавить("ТаблицаИзменения." + ТекИзм.Имя + " КАК " + ТекИзм.Имя);
						
						УсловиеСоединения = УсловиеСоединения
						+ ?(УсловиеСоединения <> "", Символы.ВК + "			И ", "")
						+ "ТаблицаИзменения." + ТекИзм.Имя + " = ТаблицаРегистр." + ТекИзм.Имя
						;
					КонецЦикла;
					
					//Если УсловиеСоединения <>""  Тогда
						
						УсловиеСоединения = "
						|		ЛЕВОЕ СОЕДИНЕНИЕ " + Тип + "." + МД.Имя + " КАК ТаблицаРегистр
						|		ПО " + УсловиеСоединения + "
						|";
						
					//КонецЕсли;
									
				
			КонецЕсли;
			
			Измерения = СтрСоединить(мИзмерения, ", ");
			ИзмеренияПути = СтрСоединить(ИзмеренияПути, ", " + Символы.ВК);
			
		ИначеЕсли Тип = "РегистрНакопления" Тогда
			Продолжить;
		ИначеЕсли Тип = "РегистрРасчета" Тогда
			Продолжить;
		ИначеЕсли Тип = "РегистрБухгалтерии" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрЗапрос = Запросы.Получить(Ключ);
		Если НЕ ЗначениеЗаполнено(СтрЗапрос) Тогда
			СтрЗапрос = Новый Структура("Тип, Измерения, Текст", Ключ, Измерения, "");
			Запросы.Вставить(Ключ, СтрЗапрос);
		КонецЕсли;
		Текст = СтрЗапрос.Текст;
		
		Если НЕ ЗначениеЗаполнено(Текст) Тогда
			Текст = "";
		Иначе
			Текст = Текст + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|";
		КонецЕсли;
		
		Текст = Текст + "
			|ВЫБРАТЬ
	        |	""" + Тип + "." + МД.Имя + """ КАК Тип,
			|";
		
		Если Посчитать Тогда
			Текст = Текст + "
					| СУММА(1) КАК Количество
					|";
		Иначе
			Текст = Текст + "
			        |	" + ИзмеренияПути + "
					|";
		КонецЕсли;
		
		Текст = Текст + "
		        |ИЗ
		        |	" + Тип + "." + МД.Имя + ".Изменения КАК ТаблицаИзменения
				|";
		
		Текст = Текст + УсловиеСоединения;
		
		Текст = Текст + "
		        |ГДЕ
		        |	ТаблицаИзменения.Узел = &Узел
				|";
		
		Если Посчитать Тогда
			Текст = Текст + "
		        |СГРУППИРОВАТЬ ПО
		        |	ТаблицаИзменения.Узел
				|";
		КонецЕсли;
		
		Если      Не НеОтправленные И Не Отправленные Тогда // Ничего
			Текст = Текст + "
				|	И Ложь
				|";
		ИначеЕсли Не НеОтправленные И    Отправленные Тогда // Отправленные
			Текст = Текст + "
				|	И Не ТаблицаИзменения.НомерСообщения Есть NULL
				|";
		ИначеЕсли    НеОтправленные И Не Отправленные Тогда // Не отправленные
			Текст = Текст + "
				|	И ТаблицаИзменения.НомерСообщения Есть NULL
				|";
		ИначеЕсли    НеОтправленные И    Отправленные Тогда // Все
		КонецЕсли;
		
		СтрЗапрос.Текст = Текст;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Сч = -1;
	Для Каждого СтрЗапрос Из Запросы Цикл
		Сч = Сч + 1;
		
		Запрос.Текст = Запрос.Текст + СтрЗапрос.Значение.Текст + "
				|
				|;
				|
				|";
		
		СтрЗапрос.Значение.Вставить("Номер", Сч);
	КонецЦикла;
	
	Если Запросы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Узел", Узел);
	мВыборки = Запрос.ВыполнитьПакет();
	
	Для Каждого СтрЗапрос Из Запросы Цикл
		
		//Если Лев(СтрЗапрос.Ключ, 16) = "РегистрСведений." Тогда
		//	Выборка = ПланыОбмена.ВыбратьИзменения(Узел, , );
		//Иначе
			Выборка = мВыборки[СтрЗапрос.Значение.Номер].Выбрать();
		//КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			Если Посчитать Тогда
				Сообщить(Выборка.Тип + " - " + Выборка.Количество);
			Иначе
				Если Лев(СтрЗапрос.Ключ, 16) = "РегистрСведений." Тогда
					Отбор = Новый Структура(СтрЗапрос.Значение.Измерения);
					ЗаполнитьЗначенияСвойств(Отбор, Выборка);
					Значение = РегистрыСведений[СтрЗаменить(СтрЗапрос.Ключ, "РегистрСведений.", "")].СоздатьКлючЗаписи(Отбор);
					
				Иначе
					Значение = Выборка.Ссылка;
					
				КонецЕсли;
				
				Если ПолучитьВБуфер Тогда
					ДобавитьВБуферЗначениеНаСервере(Значение, ПолучитьВБуферВНачало);
				КонецЕсли;
				
				Если Удалить Тогда
					
					Если Лев(СтрЗапрос.Ключ, 16) = "РегистрСведений." Тогда
						Значение = СохраняемоеЗначениеВРегистрируемоеЗначение(Значение);
					КонецЕсли;
					
					ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Значение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбъектыРегистрации(Команда)
	//Если Вопрос("Обработать объекты регистрации?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
	//	Возврат;
	//КонецЕсли;    
	//
	ДополнительныеПараметры1 = Новый Структура;
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьОбъектыРегистрацииВопрос", ЭтотОбъект,ДополнительныеПараметры1),"Обработать объекты регистрации?",
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбъектыРегистрацииВопрос(РезультатВопроса,ДополнительныеПараметры1) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ОбработатьОбъектыРегистрацииПосчитать Тогда
			ОчиститьСообщения();
		КонецЕсли;
		
		ОбработатьОбъектыРегистрацииНаСервере(Узел, ОбработатьОбъектыРегистрацииОтправленные, ОбработатьОбъектыРегистрацииНеОтправленные, ОбработатьОбъектыРегистрацииПолучитьВБуфер, ОбработатьОбъектыРегистрацииПолучитьВБуферВНачало, ОбработатьОбъектыРегистрацииПосчитать, ОбработатьОбъектыРегистрацииУдалить);
		
		Если ОбработатьОбъектыРегистрацииПолучитьВБуфер Тогда
			ПосчитатьБуфер();
		КонецЕсли;
		
	Иначе 
		Возврат;	
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура УзелПриИзменении(Элемент)
	ЗаполнитьСостав();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостав(ИзПланаОбмена = Истина)
	Если Истина Тогда
		ДЗ = РеквизитФормыВЗначение("Состав");
	Иначе // для синтаксиса )
		ДЗ = Новый ДеревоЗначений;
	КонецЕсли;
	
	ДЗ.Строки.Очистить();
	
	соТипы = Новый СписокЗначений;
	соТипы.Добавить("Справочник", "Справочники");
	соТипы.Добавить("Документ", "Документы");
	соТипы.Добавить("ПланСчетов", "Планы счетов");
	соТипы.Добавить("ПланВидовРасчета", "Планы видов расчета");
	соТипы.Добавить("ПланВидовХарактеристик", "Планы видов характеристик");
	соТипы.Добавить("РегистрСведений", "Регистры сведений");
	
	Для Каждого кзПапка Из соТипы Цикл
		Папка = ДЗ.Строки.Добавить();
		Папка.ТипВид = кзПапка.Значение;
		Папка.Представление = кзПапка.Представление;
	КонецЦикла;
	
	Если ИзПланаОбмена Тогда
		Для Каждого ЭлСостав Из Узел.Метаданные().Состав Цикл
			Тип = ТипОбъекта(ЭлСостав.Метаданные, "Запрос");
			
			Папка = ДЗ.Строки.Найти(Тип, "ТипВид", Ложь);
			Если Папка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Стр = Папка.Строки.Добавить();
			Стр.ТипВид = ЭлСостав.Метаданные.Имя;
			Стр.Представление = ЭлСостав.Метаданные.Синоним;
		КонецЦикла;
		
	Иначе
		Для Каждого ТекТип Из соТипы Цикл
			МДТип = Метаданные[СтрЗаменить(ТекТип.Представление, " ", "")];
			Папка = ДЗ.Строки.Найти(ТекТип.Значение, "ТипВид", Ложь);
			Для Каждого МДВид Из МДТип Цикл
				Стр = Папка.Строки.Добавить();
				Стр.ТипВид        = МДВид.Имя;
				Стр.Представление = МДВид.Синоним;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Папка Из ДЗ.Строки Цикл
		Папка.Строки.Сортировать("Представление");
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДЗ, "Состав");
КонецПроцедуры

&НаСервере
Функция ПолучитьТиповыеВиды()
	Список = Новый Массив;
	Список.Добавить("ПланВидовРасчета.Начисления");
	Список.Добавить("ПланВидовРасчета.Удержания");
	Список.Добавить("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные");
	Список.Добавить("ПланСчетов.Хозрасчетный");
	
	Список.Добавить("Справочник.Банки");
	Список.Добавить("Справочник.БанковскиеСчета");
	Список.Добавить("Справочник.Билеты");
	Список.Добавить("Справочник.Валюты");
	Список.Добавить("Справочник.ВидыВзаиморасчетов");
	Список.Добавить("Справочник.ВидыВычетовНДФЛ");
	Список.Добавить("Справочник.ВидыДокументовФизическихЛиц");
	Список.Добавить("Справочник.ВидыДоходовНДФЛ");
	Список.Добавить("Справочник.ВидыДоходовПоСтраховымВзносам");
	Список.Добавить("Справочник.ВидыИспользованияРабочегоВремени");
	Список.Добавить("Справочник.ВидыКонтактнойИнформации");
	Список.Добавить("Справочник.ВидыНалоговИПлатежейВБюджет");
	Список.Добавить("Справочник.ВидыНоменклатуры");
	Список.Добавить("Справочник.ВидыОплатОрганизаций");
//	Список.Добавить("Справочник.ВидыРегистровУчета");
	Список.Добавить("Справочник.ГодовыеГрафикиАмортизацииОС");
	Список.Добавить("Справочник.ДенежныеДокументы");
	Список.Добавить("Справочник.ДоговорыКонтрагентов");
	Список.Добавить("Справочник.Должности");
	Список.Добавить("Справочник.ДополнительныеУсловия");
	Список.Добавить("Справочник.ДоходыБудущихПериодов");
	Список.Добавить("Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов");
	Список.Добавить("Справочник.КлассификаторВидовЭкономическойДеятельности");
	Список.Добавить("Справочник.КлассификаторЕдиницИзмерения");
	Список.Добавить("Справочник.КлассификаторОКВЭД2");
	Список.Добавить("Справочник.КлассификаторОКПД2");
	Список.Добавить("Справочник.КлассификаторТНВЭД");
	Список.Добавить("Справочник.КодыОперацийРаздела7ДекларацииПоНДС");
	Список.Добавить("Справочник.КонтактныеЛица");
	Список.Добавить("Справочник.Контрагенты");
	Список.Добавить("Справочник.НазначенияИспользованияНМА");
	Список.Добавить("Справочник.НематериальныеАктивы");
	Список.Добавить("Справочник.Номенклатура");
	Список.Добавить("Справочник.НоменклатурныеГруппы");
	Список.Добавить("Справочник.НомераГТД");
//	Список.Добавить("Справочник.ОбщероссийскийКлассификаторОсновныхФондов");
	Список.Добавить("Справочник.ОбщероссийскийКлассификаторПродукции");
	Список.Добавить("Справочник.ОбъектыСтроительства");
	Список.Добавить("Справочник.Организации");
	Список.Добавить("Справочник.ОснованияПраваПодписи");
	Список.Добавить("Справочник.ОснованияУвольнения");
	Список.Добавить("Справочник.ОсновныеСредства");
	Список.Добавить("Справочник.ПараметрыВыработкиОС");
	Список.Добавить("Справочник.Патенты");
	Список.Добавить("Справочник.ПодразделенияОрганизаций");
	Список.Добавить("Справочник.Пользователи");
	Список.Добавить("Справочник.ПрочиеДоходыИРасходы");
	Список.Добавить("Справочник.РасходыБудущихПериодов");
	Список.Добавить("Справочник.РегистрацииВНалоговомОргане");
	Список.Добавить("Справочник.Резервы");
	Список.Добавить("Справочник.Склады");
	Список.Добавить("Справочник.СобытияОС");
	Список.Добавить("Справочник.Сотрудники");
	Список.Добавить("Справочник.СпособыОтраженияЗарплатыВБухУчете");
	Список.Добавить("Справочник.СпособыОтраженияРасходовПоАмортизации");
	Список.Добавить("Справочник.СтатусыНалогоплательщиковПоНДФЛ");
	Список.Добавить("Справочник.СтатьиДвиженияДенежныхСредств");
	Список.Добавить("Справочник.СтатьиЗатрат");
	Список.Добавить("Справочник.СтатьиФинансированияЗарплата");
	Список.Добавить("Справочник.СтраныМира");
	Список.Добавить("Справочник.ТипыДокументовПодтверждающихЛьготуНДС");
	Список.Добавить("Справочник.ТипыЦенНоменклатуры");
	Список.Добавить("Справочник.ФизическиеЛица");
	Список.Добавить("Справочник.ЦенныеБумаги");
	
	
	
	Список.Добавить("Документ.АвансовыйОтчет");
	Список.Добавить("Документ.АктСверкиВзаиморасчетов");
	Список.Добавить("Документ.ВедомостьНаВыплатуЗарплаты");
	Список.Добавить("Документ.ВедомостьНаВыплатуЗарплатыВБанк");
	Список.Добавить("Документ.ВыгрузкаРегламентированныхОтчетов");
	Список.Добавить("Документ.ВыдачаДенежныхДокументов");
	Список.Добавить("Документ.Доверенность");
	Список.Добавить("Документ.ДокументРасчетовСКонтрагентом");
	Список.Добавить("Документ.ИнвентаризацияНЗП");
	Список.Добавить("Документ.ИнвентаризацияРасчетовСКонтрагентами");
	Список.Добавить("Документ.ИсполнительныйЛист");
	Список.Добавить("Документ.КадровыйПеревод");
	Список.Добавить("Документ.КомплектацияНоменклатуры");
	Список.Добавить("Документ.КорректировкаДолга");
	Список.Добавить("Документ.КорректировкаПоступления");
	Список.Добавить("Документ.КорректировкаРеализации");
	Список.Добавить("Документ.МодернизацияОС");
	Список.Добавить("Документ.НачислениеЗарплаты");
	Список.Добавить("Документ.НачислениеОценочныхОбязательствПоОтпускам");
	Список.Добавить("Документ.ОперацияБух");
	Список.Добавить("Документ.ОплатаПлатежнойКартой");
	Список.Добавить("Документ.ОтражениеЗарплатыВБухучете");
	Список.Добавить("Документ.ОтражениеЗарплатыВУчете");
	Список.Добавить("Документ.ОтражениеНДСКВычету");
	Список.Добавить("Документ.ОтчетКомитентуОПродажах");
	Список.Добавить("Документ.ПередачаМатериаловВЭксплуатацию");
	Список.Добавить("Документ.ПередачаНМА");
	Список.Добавить("Документ.ПередачаОборудованияВМонтаж");
	Список.Добавить("Документ.ПередачаОС");
	Список.Добавить("Документ.ПеремещениеОС");
	Список.Добавить("Документ.ПередачаОСВАренду");
	Список.Добавить("Документ.ПеремещениеТоваров");
	Список.Добавить("Документ.ПлатежноеПоручение");
	Список.Добавить("Документ.ПоступлениеДопРасходов");
	Список.Добавить("Документ.ПоступлениеНаРасчетныйСчет");
	Список.Добавить("Документ.ПоступлениеНМА");
	Список.Добавить("Документ.ПоступлениеТоваровУслуг");
	Список.Добавить("Документ.ПриемНаРаботу");
	Список.Добавить("Документ.ПринятиеКУчетуНМА");
	Список.Добавить("Документ.ПринятиеКУчетуОС");
	Список.Добавить("Документ.ПриходныйКассовыйОрдер");
	Список.Добавить("Документ.РаспределениеНДС");
	Список.Добавить("Документ.РасходныйКассовыйОрдер");
	Список.Добавить("Документ.РеализацияТоваровУслуг");
	Список.Добавить("Документ.РегламентированныйОтчет");
	Список.Добавить("Документ.РегламентнаяОперация");
	Список.Добавить("Документ.СведенияОЗастрахованныхЛицахСЗВ_М");
	Список.Добавить("Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ");
	Список.Добавить("Документ.СписаниеНДС"); 
	Список.Добавить("Документ.СписаниеСРасчетногоСчета");
	Список.Добавить("Документ.СправкиНДФЛДляПередачиВНалоговыйОрган");
	Список.Добавить("Документ.СчетНаОплатуПокупателю");
	Список.Добавить("Документ.СчетНаОплатуПоставщика");
	Список.Добавить("Документ.СчетФактураВыданный");
	Список.Добавить("Документ.СчетФактураПолученный");
	Список.Добавить("Документ.ТребованиеНакладная");
	Список.Добавить("Документ.УведомлениеОСпецрежимахНалогообложения");
	Список.Добавить("Документ.Увольнение");
	Список.Добавить("Документ.ФормированиеЗаписейКнигиПокупок");
	Список.Добавить("Документ.ФормированиеЗаписейКнигиПродаж");
	Список.Добавить("Документ.ФормированиеЗаписейРаздела7ДекларацииНДС");
	Список.Добавить("Документ.ФормированиеУставногоКапитала");
	Список.Добавить("Документ.ОперацияСБилетом");
	Список.Добавить("Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС");
	
	
	// ? Этого всего нет в плане обмена
	Список.Добавить("РегистрСведений.БухучетЗарплатыОрганизаций");
	Список.Добавить("РегистрСведений.ГражданствоФизическихЛиц");
	Список.Добавить("РегистрСведений.ДокументыФизическихЛиц");
	Список.Добавить("РегистрСведений.ЖурналОтчетовСтатусы");
	Список.Добавить("РегистрСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации");
	Список.Добавить("РегистрСведений.ИсторияРегистрацийВНалоговомОргане");
	Список.Добавить("РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный");
	Список.Добавить("РегистрСведений.ИсторияРегистрацийВОрганеПФР");
	Список.Добавить("РегистрСведений.МестаВыплатыЗарплатыСотрудников");
	Список.Добавить("РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций");
	Список.Добавить("РегистрСведений.НастройкиЗарплатаКадры");
	Список.Добавить("РегистрСведений.НастройкиУчетаЗарплаты");
	Список.Добавить("РегистрСведений.ОрганизацииВКоторыхРаботалиСотрудники");
	Список.Добавить("РегистрСведений.ОсновныеВариантыПеречисленияСотруднику");
	Список.Добавить("РегистрСведений.ОсновныеДоговорыКонтрагента");
	Список.Добавить("РегистрСведений.ОсновныеСотрудникиФизическихЛиц");
	Список.Добавить("РегистрСведений.ОтветственныеЛицаОрганизаций");
	//Список.Добавить("РегистрСведений.ПечатныеБланкиРегламентированныхОтчетов");
	Список.Добавить("РегистрСведений.ПорядокОтраженияЗарплатыВБухУчете");
	Список.Добавить("РегистрСведений.ПорядокУплатыНалоговНаМестах");
	Список.Добавить("РегистрСведений.СклоненияПредставленийОбъектов");
	Список.Добавить("РегистрСведений.СостоянияБанковскихДокументов");
	Список.Добавить("РегистрСведений.СпособыОтраженияРасходовПоНалогам");
	Список.Добавить("РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев");
	Список.Добавить("РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	Список.Добавить("РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ");
	Список.Добавить("РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный");
	Список.Добавить("РегистрСведений.СтатусыДокументов");
	Список.Добавить("РегистрСведений.СтатусыЗастрахованныхФизическихЛиц");
	Список.Добавить("РегистрСведений.СтатьиЗатратПоНалогамВзносамСФОТ");
	Список.Добавить("РегистрСведений.УполномоченныеЛицаОрганизаций");
	Список.Добавить("РегистрСведений.ФИОФизическихЛиц");
	Список.Добавить("РегистрСведений.ЦеныНоменклатурыДокументов");
	
	Возврат Список;
КонецФункции

&НаСервере
Процедура ОтметитьСоставНаСервере(Способ)
	Если Истина Тогда
		ДЗ = РеквизитФормыВЗначение("Состав");
	Иначе // для синтаксиса )
		ДЗ = Новый ДеревоЗначений;
	КонецЕсли;
	
	Если Способ = "Типовой" Тогда
		Типовые = ПолучитьТиповыеВиды();
	ИначеЕсли Способ = "Хозрасчетный" Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Регистратор) КАК ТипДокумента
		                      |ИЗ
		                      |	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, , , Организация = &Организация, , ) КАК ХозрасчетныйОбороты");
		Запрос.УстановитьПараметр("Организация"  , Организация);
		Запрос.УстановитьПараметр("ДатаНачала"   , Период.ДатаНачала   );
		Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТипыХозр = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ТипыХозр.Добавить(""
				+ ТипОбъекта(Выборка.ТипДокумента, "Запрос")
				+ "."
				+ Метаданные.НайтиПоТипу(Выборка.ТипДокумента).Имя
			);
		КонецЦикла;
	КонецЕсли;			
	
	Для Каждого Папка Из ДЗ.Строки Цикл
		Для Каждого ТипВид Из Папка.Строки Цикл
			Если Способ = "Очистить" Тогда
				ТипВид.Отметка = Ложь;
			ИначеЕсли Способ = "Все" Тогда
				ТипВид.Отметка = Истина;
			ИначеЕсли Способ = "Типовой" Тогда
				ТипВид.Отметка = Типовые.Найти(Папка.ТипВид + "." + ТипВид.ТипВид) <> Неопределено;
			ИначеЕсли Способ = "Хозрасчетный" Тогда
				ТипВид.Отметка = ТипыХозр.Найти(Папка.ТипВид + "." + ТипВид.ТипВид) <> Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДЗ, "Состав");
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСостав(Команда)
	ОтметитьСоставНаСервере(СтрЗаменить(Команда.Имя, "ОтметитьСостав", ""));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизациюКоманда(Команда)
	ВыполнятьИтерациями = Команда.Имя = "ВыполнитьСинхронизациюИтерациями";
	ВыполнитьСинхронизацию(ВыполнятьИтерациями);
КонецПроцедуры

&НаКлиенте
Процедура БуферЗаполнитьИзБазыДанных(Команда)
	Если Вопрос("Выбрать объекты базы данных в буфер?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	БуферЗаполнитьИзБазыДанныхНаСервере(Команда.Имя = "БуферЗаполнитьИзДокументов");
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБуферПеренестиВРегистрацию(Команда)
	Если Вопрос("Перенести буфер в регистрацию?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьБуфер(, ОбработатьБуферУдалить);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБуферПеренестиВРегистрациюВыбранные(Команда)
	Если Вопрос("Перенести выбранные элементы буфера в регистрацию?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Номера = Новый СписокЗначений;
	Для Каждого Эл Из Элементы.Буфер.ВыделенныеСтроки Цикл
		Номера.Добавить(Буфер.Индекс(Буфер.НайтиПоИдентификатору(Эл)));
	КонецЦикла;
	Номера.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	ЗарегистрироватьБуфер(Номера.ВыгрузитьЗначения(), ОбработатьБуферУдалить);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБуферПеренестиВРегистрациюИтерация(Команда)
	Если Вопрос("Перенести итерацию из буфера в регистрацию?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьБуфер(КоличествоОбъектовВИтерации);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьСправочники_Удалить(Команда)
//	Список = Новый Массив;
//	Список.Добавить("ПланВидовРасчета.Начисления");
//	Список.Добавить("ПланВидовРасчета.Удержания");
//	Список.Добавить("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные");
//	Список.Добавить("ПланСчетов.Хозрасчетный");
//	Список.Добавить("Справочник.Банки");
//	Список.Добавить("Справочник.БанковскиеСчета");
//	Список.Добавить("Справочник.Валюты");
//	Список.Добавить("Справочник.ВидыВзаиморасчетов");
//	Список.Добавить("Справочник.ВидыВычетовНДФЛ");
//	Список.Добавить("Справочник.ВидыДокументовФизическихЛиц");
//	Список.Добавить("Справочник.ВидыДоходовНДФЛ");
//	Список.Добавить("Справочник.ВидыДоходовПоСтраховымВзносам");
//	Список.Добавить("Справочник.ВидыИспользованияРабочегоВремени");
//	Список.Добавить("Справочник.ВидыКонтактнойИнформации");
//	Список.Добавить("Справочник.ВидыНалоговИПлатежейВБюджет");
//	Список.Добавить("Справочник.ВидыНоменклатуры");
//	Список.Добавить("Справочник.ВидыОплатОрганизаций");
////	Список.Добавить("Справочник.ВидыРегистровУчета");
//	Список.Добавить("Справочник.ГодовыеГрафикиАмортизацииОС");
//	Список.Добавить("Справочник.ДенежныеДокументы");
//	Список.Добавить("Справочник.ДоговорыКонтрагентов");
//	Список.Добавить("Справочник.Должности");
//	Список.Добавить("Справочник.ДополнительныеУсловия");
//	Список.Добавить("Справочник.ДоходыБудущихПериодов");
//	Список.Добавить("Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов");
//	Список.Добавить("Справочник.КлассификаторВидовЭкономическойДеятельности");
//	Список.Добавить("Справочник.КлассификаторЕдиницИзмерения");
//	Список.Добавить("Справочник.КлассификаторОКВЭД2");
//	Список.Добавить("Справочник.КлассификаторОКПД2");
//	Список.Добавить("Справочник.КлассификаторТНВЭД");
//	Список.Добавить("Справочник.КодыОперацийРаздела7ДекларацииПоНДС");
//	Список.Добавить("Справочник.КонтактныеЛица");
//	Список.Добавить("Справочник.Контрагенты");
//	Список.Добавить("Справочник.НазначенияИспользованияНМА");
//	Список.Добавить("Справочник.НематериальныеАктивы");
//	Список.Добавить("Справочник.Номенклатура");
//	Список.Добавить("Справочник.НоменклатурныеГруппы");
//	Список.Добавить("Справочник.НомераГТД");
////	Список.Добавить("Справочник.ОбщероссийскийКлассификаторОсновныхФондов");
//	Список.Добавить("Справочник.ОбщероссийскийКлассификаторПродукции");
//	Список.Добавить("Справочник.ОбъектыСтроительства");
//	Список.Добавить("Справочник.Организации");
//	Список.Добавить("Справочник.ОснованияПраваПодписи");
//	Список.Добавить("Справочник.ОснованияУвольнения");
//	Список.Добавить("Справочник.ОсновныеСредства");
//	Список.Добавить("Справочник.ПараметрыВыработкиОС");
//	Список.Добавить("Справочник.Патенты");
//	Список.Добавить("Справочник.ПодразделенияОрганизаций");
//	Список.Добавить("Справочник.Пользователи");
//	Список.Добавить("Справочник.ПрочиеДоходыИРасходы");
//	Список.Добавить("Справочник.РасходыБудущихПериодов");
//	Список.Добавить("Справочник.РегистрацииВНалоговомОргане");
//	Список.Добавить("Справочник.Резервы");
//	Список.Добавить("Справочник.Склады");
//	Список.Добавить("Справочник.СобытияОС");
//	Список.Добавить("Справочник.Сотрудники");
//	Список.Добавить("Справочник.СпособыОтраженияЗарплатыВБухУчете");
//	Список.Добавить("Справочник.СпособыОтраженияРасходовПоАмортизации");
//	Список.Добавить("Справочник.СтатусыНалогоплательщиковПоНДФЛ");
//	Список.Добавить("Справочник.СтатьиДвиженияДенежныхСредств");
//	Список.Добавить("Справочник.СтатьиЗатрат");
//	Список.Добавить("Справочник.СтатьиФинансированияЗарплата");
//	Список.Добавить("Справочник.СтраныМира");
//	Список.Добавить("Справочник.ТипыДокументовПодтверждающихЛьготуНДС");
//	Список.Добавить("Справочник.ТипыЦенНоменклатуры");
//	Список.Добавить("Справочник.ФизическиеЛица");
//	Список.Добавить("Справочник.ЦенныеБумаги");
//	
//	Состояние("Выполняется регистрация справочников");
//	
//	З-арегистрироватьОбъектыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокументы_Удалить(Команда)
	//Список = Новый Массив;
	//Список.Добавить("Документ.АвансовыйОтчет");
	//Список.Добавить("Документ.АктСверкиВзаиморасчетов");
	//Список.Добавить("Документ.ВедомостьНаВыплатуЗарплаты");
	//Список.Добавить("Документ.ВедомостьНаВыплатуЗарплатыВБанк");
	//Список.Добавить("Документ.ВыгрузкаРегламентированныхОтчетов");
	//Список.Добавить("Документ.ВыдачаДенежныхДокументов");
	//Список.Добавить("Документ.Доверенность");
	//Список.Добавить("Документ.ДокументРасчетовСКонтрагентом");
	//Список.Добавить("Документ.ИнвентаризацияНЗП");
	//Список.Добавить("Документ.ИнвентаризацияРасчетовСКонтрагентами");
	//Список.Добавить("Документ.ИсполнительныйЛист");
	//Список.Добавить("Документ.КадровыйПеревод");
	//Список.Добавить("Документ.КомплектацияНоменклатуры");
	//Список.Добавить("Документ.КорректировкаДолга");
	//Список.Добавить("Документ.КорректировкаПоступления");
	//Список.Добавить("Документ.КорректировкаРеализации");
	//Список.Добавить("Документ.МодернизацияОС");
	//Список.Добавить("Документ.НачислениеЗарплаты");
	//Список.Добавить("Документ.НачислениеОценочныхОбязательствПоОтпускам");
	//Список.Добавить("Документ.ОперацияБух");
	//Список.Добавить("Документ.ОплатаПлатежнойКартой");
	//Список.Добавить("Документ.ОтражениеЗарплатыВБухучете");
	//Список.Добавить("Документ.ОтражениеЗарплатыВУчете");
	//Список.Добавить("Документ.ОтражениеНДСКВычету");
	//Список.Добавить("Документ.ПередачаМатериаловВЭксплуатацию");
	//Список.Добавить("Документ.ПередачаНМА");
	//Список.Добавить("Документ.ПередачаОборудованияВМонтаж");
	//Список.Добавить("Документ.ПередачаОС");
	//Список.Добавить("Документ.ПередачаОСВАренду");
	//Список.Добавить("Документ.ПеремещениеТоваров");
	//Список.Добавить("Документ.ПлатежноеПоручение");
	//Список.Добавить("Документ.ПоступлениеДопРасходов");
	//Список.Добавить("Документ.ПоступлениеНаРасчетныйСчет");
	//Список.Добавить("Документ.ПоступлениеНМА");
	//Список.Добавить("Документ.ПоступлениеТоваровУслуг");
	//Список.Добавить("Документ.ПриемНаРаботу");
	//Список.Добавить("Документ.ПринятиеКУчетуНМА");
	//Список.Добавить("Документ.ПринятиеКУчетуОС");
	//Список.Добавить("Документ.ПриходныйКассовыйОрдер");
	//Список.Добавить("Документ.РаспределениеНДС");
	//Список.Добавить("Документ.РасходныйКассовыйОрдер");
	//Список.Добавить("Документ.РеализацияТоваровУслуг");
	//Список.Добавить("Документ.РегламентированныйОтчет");
	//Список.Добавить("Документ.РегламентнаяОперация");
	//Список.Добавить("Документ.СведенияОЗастрахованныхЛицахСЗВ_М");
	//Список.Добавить("Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ");
	//Список.Добавить("Документ.СписаниеНДС"); 
	//Список.Добавить("Документ.СписаниеСРасчетногоСчета");
	//Список.Добавить("Документ.СправкиНДФЛДляПередачиВНалоговыйОрган");
	//Список.Добавить("Документ.СчетНаОплатуПокупателю");
	//Список.Добавить("Документ.СчетНаОплатуПоставщика");
	//Список.Добавить("Документ.СчетФактураВыданный");
	//Список.Добавить("Документ.СчетФактураПолученный");
	//Список.Добавить("Документ.ТребованиеНакладная");
	//Список.Добавить("Документ.УведомлениеОСпецрежимахНалогообложения");
	//Список.Добавить("Документ.Увольнение");
	//Список.Добавить("Документ.ФормированиеЗаписейКнигиПокупок");
	//Список.Добавить("Документ.ФормированиеЗаписейКнигиПродаж");
	//Список.Добавить("Документ.ФормированиеЗаписейРаздела7ДекларацииНДС");
	//Список.Добавить("Документ.ФормированиеУставногоКапитала");
	//Список.Добавить("Документ.ОперацияСБилетом");
	//
	//Состояние("Выполняется регистрация документов");
	//
	//З-арегистрироватьОбъектыНаСервере();
	//
КонецПроцедуры

&НаСервере
Процедура БуферОставитьВыбранныеТипыНаСервере()
	сТипы = Новый Структура;
	Для Каждого ТекТип Из Состав.ПолучитьЭлементы() Цикл
		Если Не ТекТип.Отметка Тогда
			Продолжить;
		КонецЕсли;

		сВиды = Новый Структура;
		сТипы.Вставить(ТекТип.ТипВид, сВиды);
		Для Каждого ТекВид Из ТекТип.ПолучитьЭлементы() Цикл
			Если Не ТекВид.Отметка Тогда
				Продолжить;
			КонецЕсли;
			
			сВиды.Вставить(ТекВид.ТипВид);
		КонецЦикла;
	КонецЦикла;
	
	мУдаляемые = Новый Массив;
	Для Каждого ТекБуфер Из Буфер Цикл
		ТекТип = ТипОбъекта(ТекБуфер.Значение, "Запрос");
		Если Не сТипы.Свойство(ТекТип) Или Не сТипы[ТекТип].Свойство(ТекБуфер.Значение.Метаданные().Имя) Тогда
			мУдаляемые.Добавить(ТекБуфер);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекБуфер Из мУдаляемые Цикл
		Буфер.Удалить(ТекБуфер);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура БуферОставитьВыбранныеТипы(Команда)
	Если Вопрос("Очистить буфер согласно выбранным типам?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	БуферОставитьВыбранныеТипыНаСервере();
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИзБуфераНаСервере()
	Таблица.Очистить();
	
	НомСтр = 1;
	Таблица.Область(НомСтр, 1).Текст = "Тип";
	Таблица.Область(НомСтр, 2).Текст = "Вид";
	Таблица.Область(НомСтр, 3).Текст = "УИд";
	Таблица.Область(НомСтр, 4).Текст = "Версия";
	Таблица.Область(НомСтр, 5).Текст = "Представление";
	
	Для Каждого Элемент Из Буфер Цикл
		НомСтр = НомСтр + 1;
		
		Таблица.Область(НомСтр, 1).Текст = ТипОбъекта(Элемент.Значение);
		Таблица.Область(НомСтр, 2).Текст = Элемент.Значение.Метаданные().Имя;
		Таблица.Область(НомСтр, 3).Текст = Элемент.Значение.УникальныйИдентификатор();
		Таблица.Область(НомСтр, 4).Текст = Элемент.Значение.ВерсияДанных;
		Таблица.Область(НомСтр, 5).Текст = Элемент.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИзБуфера(Команда)
	ТаблицаИзБуфераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаВБуферНаСервере()
	Буфер.Очистить();
	
	Для НомСтр = 2 По Таблица.ВысотаТаблицы Цикл
		Тип = Таблица.Область(НомСтр, 1).Текст;
		Вид = Таблица.Область(НомСтр, 2).Текст;
		УИД = Таблица.Область(НомСтр, 3).Текст;
		Вер = Таблица.Область(НомСтр, 4).Текст;
		Пре = Таблица.Область(НомСтр, 5).Текст;
		
		Тип = Вычислить(Тип);
		Вид = Тип[Вид];
		Ссылка = Вид.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		
		ДобавитьВБуферЗначениеНаСервере(Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВБуфер(Команда)
	Если Буфер.Количество() > 0 Тогда
		Если Вопрос("Заменить состав буфера данными из таблицы?", РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена) <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаВБуферНаСервере();
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПереданные(Команда)
	ОчиститьПереданныеНаСервере(Буфер, Узел);
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьПереданныеНаСервере(Буфер, Узел)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК Ссылка
	                      |ИЗ
	                      |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	                      |ГДЕ
	                      |	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел
	                      |	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника В(&Ссылки)");
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("Ссылки", Буфер.ВыгрузитьЗначения());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементСписка = Буфер.НайтиПоЗначению(Выборка.Ссылка);
		Буфер.Удалить(ЭлементСписка);
		
	КонецЦикла;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция СтрокаВнутрВСтруктуруОбработатьСтруктуру(ТекСЗ)
	ТекСЗ.Строка = "";
	Для Каждого Тек Из ТекСЗ.Элементы Цикл
		ТекСЗ.Строка = ТекСЗ.Строка
			+ ?(ТекСЗ.Строка <> "", ", ", "")
			+ ?(ТипЗнч(Тек) = Тип("Строка"), Тек, Тек.Строка)
		;
	КонецЦикла;
	ТекСЗ.Строка = "{" + ТекСЗ.Строка + "}";
	
	Значение = Неопределено;
	Попытка
		Значение = ЗначениеИзСтрокиВнутр(ТекСЗ.Строка);
	Исключение
	КонецПопытки;
	ТекСЗ.Вставить("Значение", Значение);
КонецФункции

&НаСервереБезКонтекста
Функция СтрокаВнутрВСтруктуру(Стр) Экспорт
	ТекСЗ = Неопределено;
	
	Ном = 1;
	
	Сч = 0;
	
	Кол = СтрДлина(Стр);
	
	СтрокаОткрыта = Ложь;
	
	Пока Истина Цикл
		НайтиКавч = СтрНайти(Стр, """",, Ном); НайтиКавч = ?(НайтиКавч <> 0, НайтиКавч, Кол);
		НайтиОткр = СтрНайти(Стр, "{" ,, Ном); НайтиОткр = ?(НайтиОткр <> 0, НайтиОткр, Кол);
		НайтиЗакр = СтрНайти(Стр, "}" ,, Ном); НайтиЗакр = ?(НайтиЗакр <> 0, НайтиЗакр, Кол);
		
		Если      НайтиОткр = Ном Тогда
			НовСЗ = Новый Структура("Родитель, Элементы, Строка", ТекСЗ, Новый Массив, "");
			Если ТекСЗ <> Неопределено Тогда
				ТекСЗ.Элементы.Добавить(НовСЗ);
			КонецЕсли;
			ТекСЗ = НовСЗ;
			Ном = Ном + 1;
			
		ИначеЕсли НайтиЗакр = Ном Тогда
			СтрокаВнутрВСтруктуруОбработатьСтруктуру(ТекСЗ);
				
			ТекСЗ = ТекСЗ.Родитель;
			Ном = Ном + 1;
			
		Иначе
			Элты = Сред(Стр, Ном, Мин(НайтиОткр, НайтиЗакр) - Ном);
			Элты = СтрРазделить(Элты, ",", Истина);
			
			Если ТекСЗ.Элементы.Количество() > 0 Тогда
				Элты.Удалить(0);
			КонецЕсли;
			Если НайтиОткр < НайтиЗакр Тогда
				Элты.Удалить(Элты.Количество() - 1);
			КонецЕсли;
			
			Для Каждого Эл Из Элты Цикл
				ТекСЗ.Элементы.Добавить(Эл);
			КонецЦикла;
			Ном = Мин(НайтиОткр, НайтиЗакр);
			
		КонецЕсли;
		
		Если Ном = Кол Тогда
			Прервать;
		КонецЕсли;
		
		Сч = Сч + 1;
		Если Сч > 100 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаВнутрВСтруктуруОбработатьСтруктуру(ТекСЗ);
			
	Возврат ТекСЗ;
КонецФункции

&НаСервереБезКонтекста
Функция ОЗначении(Значение)
	МД = Метаданные.НайтиПоТипу(ТипЗнч(Значение));
	ЭтоРегистр = Ложь;
	ПоРегистратору = Неопределено;
	Тип = ""; Вид = МД.Имя;
	Если      Метаданные.РегистрыСведений  .Содержит(МД) Тогда
		ЭтоРегистр = Истина;
		ПоРегистратору = МД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору;
		Тип = "РегистрыСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МД) Тогда
		ЭтоРегистр = Истина;
		ПоРегистратору = Истина;
		Тип = "РегистрыНакопления";
	КонецЕсли;
	
	Открываемое = Значение;
	Представление = "" + Значение;
	
	Если ЭтоРегистр Тогда
		Представление = "";
		Если ПоРегистратору Тогда
			Открываемое = Значение.Регистратор;
			Представление = "" + Значение.Регистратор + " (по регистратору)";
		Иначе
			Для Каждого Изм Из МД.Измерения Цикл
				Если Изм.ОсновнойОтбор Тогда
					Представление = Представление
						+ ?(Представление <> "",  ", ", "")
						+ Значение[Изм.Имя]
					;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Представление = МД.Синоним + ": " + Представление;
	КонецЕсли;
	
//	ЭтоКЗ = Тип = Тип("РегистрСведенийКлючЗаписи." + МД.Имя);
	
	Возврат Новый Структура(
		"Представление, Открываемое, ЭтоРегистр, Тип, Вид, ПоРегистратору",
		 Представление, Открываемое, ЭтоРегистр, Тип, Вид, ПоРегистратору
	);
КонецФункции

&НаСервере
Процедура ДобавитьВБуферЗначениеНаСервере(Значение, ВНачало = Ложь);
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Пред = ОЗначении(Значение).Представление;
	
	Если ВНачало Тогда
		Буфер.Вставить(0, Значение, Пред);
	Иначе
		Буфер.Добавить(Значение, Пред);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВБуферМассивНаСервере(мЗначения, ВНачало = Ложь);
	Для Каждого Значение Из мЗначения Цикл
		ДобавитьВБуферЗначениеНаСервере(Значение, ВНачало);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВБуфер(мЗначения, ВНачало = Ложь) Экспорт
	Если ТипЗнч(мЗначения) <> Тип("Массив") Тогда
		Сообщить("Используйте массив значений");
		Возврат;
	КонецЕсли;
	
	ДобавитьВБуферМассивНаСервере(мЗначения, ВНачало);
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьУзел() Экспорт
	Возврат Узел;
КонецФункции

&НаСервере
Функция ПолучитьБуфер() Экспорт
	Рез = Новый Массив;
	Для Каждого Эл Из Буфер Цикл
		Рез.Добавить(Эл.Значение);
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаСервере
Процедура СоставЗаполнитьВсеТипыНаСервере()
	ЗаполнитьСостав(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаполнитьВсеТипы(Команда)
	СоставЗаполнитьВсеТипыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьБуферСтр()
	Возврат ЗначениеВСтрокуВнутр(Буфер);
КонецФункции

&НаСервере
Процедура УстановитьБуферСтр(Стр)
	Буфер = ЗначениеИзСтрокиВнутр(Стр);
КонецПроцедуры

&НаКлиенте
Процедура БуферСохранить(Команда)
	ИмяФайла = ВыбратьФайл(РежимДиалогаВыбораФайла.Сохранение, Ф("msl"));
	Если ИмяФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент;
	Состояние("Формирование данных сохранения");
	Текст.УстановитьТекст(ПолучитьБуферСтр());
	Состояние("Запись файла");
	Текст.Записать(ИмяФайла);
КонецПроцедуры

// Создает и устанавливает реквизиты диалога выбора файла.
//
// Параметры
//  МножественныйВыбор – Булево, признак множественного выбора.
//  НачальныйКаталог – Строка, содержащая начальный каталог выбора файла.
//  Фильтр - Строка, фильтр диалога
//
// Возвращаемое значение:
//   Выбранный/ые файл/ы
//
&НаКлиенте
Функция ВыбратьФайл(Знач Режим = Неопределено, Знач Фильтр = "", МножественныйВыбор = Ложь, НачальныйКаталог = "", ПредварительныйПросмотр = Ложь, ПолноеИмяФайла = "") Экспорт
	Если Режим = Неопределено Тогда
		Режим = РежимДиалогаВыбораФайла.Открытие;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(Режим);
	
	Диалог.Заголовок = ?(Режим = РежимДиалогаВыбораФайла.ВыборКаталога, "Выбор каталога", "" + Режим + " файл" + ?(МножественныйВыбор, "ов", "а")) + "...";
	
	Диалог.Каталог = НачальныйКаталог;
	Диалог.ПолноеИмяФайла = СокрЛП(ПолноеИмяФайла);
	
	Если Фильтр = "" Тогда
		Фильтр = "Все файлы (*.*)|*.*|"
	      + "Текстовый документ (*.txt)|*.txt|"
	      + "Табличный документ (*.mxl)|*.mxl|"
	      + "eXtensible Markup Language (*.xml)|*.xml|"
	      + "Картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|"
	      + "Документ Microsoft Word (*.doc;*.docx)|*.doc;*.docx|"
	      + "Документ Microsoft Excel (*.xls;*.xlsx)|*.xls;*.xlsx|"
	      + "Документ Microsoft PowerPoint (*.ppt)|*.ppt|"
	      + "Документ Microsoft Visio (*.vsd)|*.vsd|"
	      + "Письмо электронной почты (*.msg)|*.msg|"
		;
	КонецЕсли;
	Диалог.Фильтр = Фильтр;
	
	Диалог.ПредварительныйПросмотр = ПредварительныйПросмотр;
	Диалог.МножественныйВыбор = МножественныйВыбор;
	
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Если Не Диалог.Выбрать() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если МножественныйВыбор Тогда
		Возврат Диалог.ВыбранныеФайлы;
	Иначе
		Возврат Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецФункции // ВыбратьФайл()

Функция Ф(Расш)
	Возврат ""
		+ "Список управляемой синхронизации (*." + Расш + ")|*." + Расш + "|"
		+ "Все файлы (*.*)|*.*|"
	;
КонецФункции

&НаКлиенте
Процедура БуферЗагрузить(Команда)
	ИмяФайла = ВыбратьФайл(РежимДиалогаВыбораФайла.Открытие, Ф("msl"));
	Если ИмяФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяФайла);
	
	Состояние("Получение данных из файла");
	УстановитьБуферСтр(Текст.ПолучитьТекст());
	
	ПосчитатьБуфер();
	
КонецПроцедуры

&НаКлиенте
Процедура БуферЗаполнитьИзДетальнойВедомости(Команда)
	Попытка
		ФормаДВ = ПолучитьФорму("ВнешняяОбработка.ДетальныеВедомости.Форма");
	Исключение
		Предупреждение("Ошибка открытия формы ""Детальные ведомости""" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	ДобавитьВБуферМассивНаСервере(ФормаДВ.ПолучитьРегистраторы());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПриемник(Источник, Узел) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Соответствия.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника
	                      |ИЗ
	                      |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК Соответствия
	                      |ГДЕ
	                      |	Соответствия.УникальныйИдентификаторИсточника = &УникальныйИдентификаторИсточника
	                      |	И Соответствия.УзелИнформационнойБазы = &УзелИнформационнойБазы");
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Узел);
	Запрос.УстановитьПараметр("УникальныйИдентификаторИсточника", Источник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УникальныйИдентификаторПриемника;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура КомандаСоответствиеИсточникВПриемник(Команда)
	СоответствиеПриемник = ПолучитьПриемник(СоответствиеИсточник, Узел);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсточник(Приемник, Узел) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Соответствия.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника
	                      |ИЗ
	                      |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК Соответствия
	                      |ГДЕ
	                      |	Соответствия.УникальныйИдентификаторПриемника = Выразить(&УникальныйИдентификаторПриемника Как Строка(36))
	                      |	И Соответствия.УзелИнформационнойБазы = &УзелИнформационнойБазы");
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Узел);
	Запрос.УстановитьПараметр("УникальныйИдентификаторПриемника", Строка(Приемник));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УникальныйИдентификаторИсточника;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура КомандаСоответствиеПриемникВИсточник(Команда)
	СоответствиеИсточник = ПолучитьИсточник(СоответствиеПриемник, Узел);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Выгруженные(Узел, ТипИсточника) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Соответствия.УникальныйИдентификаторИсточника КАК Ссылка
	                      |ИЗ
	                      |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК Соответствия
	                      |ГДЕ
	                      |	Соответствия.ТипИсточника = (ВЫРАЗИТЬ(&ТипИсточника КАК СТРОКА(1000)))
	                      |	И Соответствия.УзелИнформационнойБазы = &УзелИнформационнойБазы");
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Узел);
	Запрос.УстановитьПараметр("ТипИсточника", ТипИсточника);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаКлиенте
Процедура СоответствиеВыгруженные(Команда)
	Выгруженные(Узел, СоответствиеТипИсточника);
КонецПроцедуры

&НаКлиенте
Функция СписокФункций() Экспорт
	Возврат "
		|ДобавитьВБуфер|&.Ссылка, ВНачало = Ложь
		|ПолучитьБуфер||&.Ссылка
		|ПолучитьПриемник|&.Ссылка, &.Узел|&.УИД
		|ПолучитьИсточник|&.УИД, &.Узел|&.Ссылка
		|ЗначениеКорреспондентаВЛокальное|&.ЗначениеКорр|&.Значение
		|ЗначениеЛокальноеВКорреспондента|&.Значение|&.ЗначениеКорр
		|ПолучитьУзел||&.Узел
		|Выгруженные|&.Узел, &.ТипИсточника|&.Выгруженные
		|ЗарегистрироватьНаборЗаписейРегистраСведений|&.Узел, &.ИмяРегистра, &.Отбор
		|";
КонецФункции

&НаКлиенте
Функция ЗначениеЛокальноеВКорреспондента(Значение) Экспорт
	Возврат ЗначениеЛокальноеВКорреспондентаНаСервере(Значение, Узел);
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеЛокальноеВКорреспондентаНаСервере(Значение, Узел)
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
		
	ИмяТипа = XMLТипЗнч(Значение).ИмяТипа;
	Если СтрНайти(ИмяТипа, "Ref.") = 0 Тогда
		Возврат Значение;
	КонецЕсли;
	
	УИД = ПолучитьПриемник(Значение, Узел);
	Если УИД = Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	
	ЗначениеКорр = XMLЗначение(Тип(ИмяТипа), УИД);
	
	Возврат ЗначениеКорр;
КонецФункции

&НаКлиенте
Функция ЗначениеКорреспондентаВЛокальное(ЗначениеКорр) Экспорт
	Возврат ЗначениеКорреспондентаВЛокальноеНаСервере(ЗначениеКорр, Узел);
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеКорреспондентаВЛокальноеНаСервере(ЗначениеКорр, Узел) Экспорт
	Если Не ЗначениеЗаполнено(ЗначениеКорр) Тогда
		Возврат ЗначениеКорр;
	КонецЕсли;
	
	ИмяТипа = XMLТипЗнч(ЗначениеКорр).ИмяТипа;
	Если СтрНайти(ИмяТипа, "Ref.") = 0 Тогда
		Возврат ЗначениеКорр;
	КонецЕсли;
	
	Значение = ПолучитьИсточник(XMLСтрока(ЗначениеКорр), Узел);
	Если Значение = Неопределено Тогда
		Возврат ЗначениеКорр;
	КонецЕсли;
	
	Возврат Значение;
КонецФункции

&НаСервереБезКонтекста
Функция КоличествоПроводок(Регистратор)
	Тип = XMLТипЗнч(Регистратор);
	Если Тип = Неопределено
	 Или Лев(Тип.ИмяТипа, 12) <> "DocumentRef."
	Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(1) КАК Количество
	                      |ИЗ
	                      |	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	                      |ГДЕ
	                      |	Хозрасчетный.Регистратор = &Регистратор");
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Выборка.Количество = NULL Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Выборка.Количество;
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьБуфер(КолВоОбъектов = Неопределено, УдалятьИзБуфера = Истина)
	Строки = Новый Массив;
	
	Если      КолВоОбъектов = Неопределено Тогда          // Все
		Для Каждого Эл Из Буфер Цикл
			Строки.Добавить(Эл);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(КолВоОбъектов) = Тип("Число") Тогда  // Первые N
		Для Сч = 1 По Мин(КолВоОбъектов, Буфер.Количество()) Цикл
			ТекСтр = Буфер.Получить(Сч - 1);
			Строки.Добавить(ТекСтр);
			Если КоличествоПроводок(ТекСтр.Значение) > 5000 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(КолВоОбъектов) = Тип("Массив") Тогда // массив номеров
		Для Каждого Эл Из КолВоОбъектов Цикл
			Строки.Добавить(Буфер.Получить(Эл));
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Эл Из Строки Цикл
		Зн = Эл.Значение;
		ЗарегистрироватьОбъектНаСервере(Узел, Зн);
		
		Если УдалятьИзБуфера Тогда
			Буфер.Удалить(Эл);
		КонецЕсли;
	КонецЦикла;
	
		//	ЗарегистрироватьОбъектНаСервере(Узел, Буфер.Получить(Эл).Значение);
		//	ЗарегистрироватьОбъектНаСервере(Узел, Эл.Значение);
		//	ЗарегистрироватьОбъектНаСервере(Узел, Буфер.Получить(0).Значение);
		//	
		//	Если УдалятьИзБуфера Тогда
		//		Буфер.Удалить(Эл);
		//	КонецЕсли;
		//Если УдалятьИзБуфера Тогда
		//	Буфер.Очистить();
		//КонецЕсли;
		//	Если УдалятьИзБуфера Тогда // Ложь - недопустима, не работает ))
		//		Буфер.Удалить(0);
		//	КонецЕсли;
		
	Если УдалятьИзБуфера Тогда
		ПосчитатьБуфер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БуферОткрыть(Команда)
	Значение = Элементы.Буфер.ТекущиеДанные.Значение;
//	Открываемое = ОткрываемоеЗначение(Значение);
	ОткрытьЗначение(ОЗначении(Значение).Открываемое);
КонецПроцедуры

&НаКлиенте
Процедура БуферЗаполнитьИзПоискГУИДиОбъектов(Команда)
	Попытка
		ФормаОбр = ПолучитьФорму("ВнешняяОбработка.ПоискГУИДОВиОбъектов.Форма");
	Исключение
		Предупреждение("Ошибка открытия формы ""Поиск ГУИДов и объектов""" + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ДобавитьВБуферМассивНаСервере(ФормаОбр.ПолучитьНайденныеОбъекты());
	
	ПосчитатьБуфер();
	
КонецПроцедуры
