 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантОтбораСоответствийИсточника = "Все";
	ВариантОтбораСоответствийПриемника = "Все";
	Элементы.СписокПриемникаОтменитьОтборПоРеквизиту.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЗаполнитьПараметрыПодключения();
	ЗаполнитьСписокВыбораИсточника();
	ЗаполнитьСписокВыбораПриемника();
	ИнициализироватьТаблицуРеквизитов();
	ОбновитьДанныеИсточника();
	ОбновитьДанныеПриемника();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	Если Элементы.СписокИсточника.ТекущиеДанные = Неопределено 
			ИЛИ Элементы.СписокПриемника.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.СписокИсточника.ТекущиеДанные.ЗначениеПриемника) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСоответствиеНаСервере(Элементы.СписокИсточника.ТекущиеДанные.Ссылка, Элементы.СписокПриемника.ТекущиеДанные.Ссылка);
	Элементы.СписокПриемника.ТекущиеДанные.ЕстьСоответствие = Истина;
	
	Элементы.СписокИсточника.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие(Команда)
	
	Если Элементы.СписокИсточника.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.СписокИсточника.ТекущиеДанные.ЗначениеПриемника) Тогда
		Возврат
	КонецЕсли;
	
	ОтменитьСоответствиеНаСервере(Элементы.СписокИсточника.ТекущиеДанные.Ссылка, Элементы.СписокИсточника.ТекущиеДанные.ЗначениеПриемника);
	
	Элементы.СписокИсточника.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеКоманда(Команда)
	
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущийЭлемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРеквизиты(Команда)
	
	Если ЗначениеЗаполнено(ТипИсточника) Тогда
		Оповещение = Новый ОписаниеОповещения("НастроитьРеквизитыЗавершение", ЭтаФорма);
		ПараметрыФормы = Новый Структура("ТипИсточника,АдресХранилищаТаблицыРеквизитов", ТипИсточника, ПолучитьАдресХранилищаТаблицыРеквизитов());
		ОткрытьФорму("ВнешняяОбработка.СопоставлениеОбъектовОбмена.Форма.ФормаНастройкиРеквизитов", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Оповещение);
	Иначе
		ТекстСообщения = НСтр("ru = 'Поле ""Тип источника"" не заполнено'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРеквизитыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		ИзменитьНастройкиРеквизитов(Результат);
		ОбновитьДанныеИсточника();
		ОбновитьДанныеПриемника();
		
		Элементы.СписокПриемникаОтменитьОтборПоРеквизиту.Доступность = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("ОтборПоРеквизиту", Истина)).Количество() > 0;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборПриемника", 0.1, Истина);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьОбъектыПоПравилу(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		ПоказатьПредупреждение(, "Не выбрано правило конвертации.");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗарегистрироватьОбъектыПоПравилуЗавершение", ЭтаФорма),
		НСтр("ru = 'Зарегистрировать все объекты ИБ источника по правилу?
			|Это может занять продолжительное время.'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗарегистрироватьОбъектыПоПравилуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Состояние("Выполняется регистрация конвертации объектов по правилу");
		ЗарегистрироватьОбъектыПоПравилуСервер(УзелИнформационнойБазы, ТипИсточника);
		Состояние("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПоПравилу(Команда)
	
	СопоставитьПоПравилуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборПоРеквизиту(Команда)
	
	Элементы.СписокПриемникаОтменитьОтборПоРеквизиту.Доступность = Ложь;
	Для каждого ТекСтрока Из ТаблицаРеквизитов Цикл
		ТекСтрока.ОтборПоРеквизиту = Ложь;
	КонецЦикла;
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборПриемника", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УзелИнформационнойБазыПриИзменении(Элемент)
	
	//ЗаполнитьПараметрыПодключения();
	
	Элементы.ТипИсточника.СписокВыбора.Очистить();
	Элементы.ТипПриемника.СписокВыбора.Очистить();
	
	ТипИсточника = "";
	ТипПриемника = "";
	
	ИнициализироватьТаблицуРеквизитов();
	
	ЗаполнитьСписокВыбораИсточника();
	ЗаполнитьСписокВыбораПриемника();
		
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИсточникаПриИзменении(Элемент)
	
	ОпределитьПриемникПоИсточнику();
	ИнициализироватьТаблицуРеквизитов();
	ОбновитьДанныеИсточника();
	ОбновитьДанныеПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриемникаПриИзменении(Элемент)
	
	ОбновитьДанныеПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизациямПриИзменении(Элемент)
	
	ОбновитьДанныеПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораСоответствийИсточникаПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(
			СписокИсточника,
			"ЕстьСоответствие",
			Истина,
			НЕ ВариантОтбораСоответствийИсточника = "Все", 
			?(ВариантОтбораСоответствийИсточника = "Связанные", ВидСравненияКомпоновкиДанных.Равно, ВидСравненияКомпоновкиДанных.НеРавно));
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораСоответствийПриемникаПриИзменении(Элемент)
	
	Если ВариантОтбораСоответствийПриемника = "Связанные" Тогда
		Элементы.СписокПриемника.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЕстьСоответствие", Истина));
	ИначеЕсли ВариантОтбораСоответствийПриемника = "НеСвязанные" Тогда
		Элементы.СписокПриемника.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЕстьСоответствие", Ложь));
	Иначе
		Элементы.СписокПриемника.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИсточникаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокПриемникаОтменитьОтборПоРеквизиту.Доступность Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьОтборПриемника", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИсточникаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗначениеПриемника) Тогда
		НайденныеСтроки = СписокПриемника.НайтиСтроки(Новый Структура("Ссылка", Элемент.ТекущиеДанные.ЗначениеПриемника));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.СписокПриемника.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ТипИсточника.ТолькоПросмотр = Не ЗначениеЗаполнено(УзелИнформационнойБазы);
	Элементы.ТипПриемника.ТолькоПросмотр = Не ЗначениеЗаполнено(УзелИнформационнойБазы);
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПараметрыПодключения()
//	
//	Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
//		
//		НастройкиПодключения = РегистрыСведений.НастройкиТранспортаОбменаДанными.НастройкиТранспортаWS(УзелИнформационнойБазы);
//		СтруктураURI = СтруктураURI(НастройкиПодключения.WSURLВебСервиса);
//		WSИмяСервера = СтруктураURI.ИмяСервера;
//		ПутьНаСервере = СтруктураURI.ПутьНаСервере + "/hs/comparison/";
//		WSИмяПользователя = НастройкиПодключения.WSИмяПользователя;
//		WSПароль = НастройкиПодключения.WSПароль;
//		
//		Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
//			ИмяПланаОбмена = УзелИнформационнойБазы.Метаданные().Имя;
//			КодУзлаКорреспондента = ПланыОбмена[ИмяПланаОбмена].ЭтотУзел().Код;
//		Иначе
//			ИмяПланаОбмена = "";
//			КодУзлаКорреспондента = "";
//		КонецЕсли;
//		
//	Иначе
//		
//		СтруктураURI = "";
//		WSИмяСервера = "";
//		ПутьНаСервере = "";
//		WSИмяПользователя = "";
//		WSПароль = "";
//		ИмяПланаОбмена = "";
//		КодУзлаКорреспондента = "";
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИсточника()
	
	Элементы.ТипИсточника.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		Для каждого ТекЭлемент Из УзелИнформационнойБазы.Метаданные().Состав Цикл
			Если Метаданные.Справочники.Содержит(ТекЭлемент.Метаданные) Тогда
				Элементы.ТипИсточника.СписокВыбора.Добавить("Справочник." + ТекЭлемент.Метаданные.Имя);
			КонецЕсли;
			Если Метаданные.ПланыВидовХарактеристик.Содержит(ТекЭлемент.Метаданные) Тогда
				Элементы.ТипИсточника.СписокВыбора.Добавить("ПланВидовХарактеристик." + ТекЭлемент.Метаданные.Имя);
			КонецЕсли;
			Если Метаданные.ПланыСчетов.Содержит(ТекЭлемент.Метаданные) Тогда
				Элементы.ТипИсточника.СписокВыбора.Добавить("ПланСчетов." + ТекЭлемент.Метаданные.Имя);
			КонецЕсли;
			Если Метаданные.ПланыВидовРасчета.Содержит(ТекЭлемент.Метаданные) Тогда
				Элементы.ТипИсточника.СписокВыбора.Добавить("ПланВидовРасчета." + ТекЭлемент.Метаданные.Имя);
			КонецЕсли;
		КонецЦикла;
		Элементы.ТипИсточника.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПриемника()
	
	// TODO: Переделать на загрузку списка метеданных из базы-приемника
	Элементы.ТипПриемника.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		Для каждого ТекЭлемент Из Метаданные.Справочники Цикл
			Элементы.ТипПриемника.СписокВыбора.Добавить("Справочник." + ТекЭлемент.Имя);
		КонецЦикла;
		Для каждого ТекЭлемент Из Метаданные.ПланыВидовХарактеристик Цикл
			Элементы.ТипПриемника.СписокВыбора.Добавить("ПланВидовХарактеристик." + ТекЭлемент.Имя);
		КонецЦикла;
		Для каждого ТекЭлемент Из Метаданные.ПланыСчетов Цикл
			Элементы.ТипПриемника.СписокВыбора.Добавить("ПланСчетов." + ТекЭлемент.Имя);
		КонецЦикла;
		Для каждого ТекЭлемент Из Метаданные.ПланыВидовРасчета Цикл
			Элементы.ТипПриемника.СписокВыбора.Добавить("ПланВидовРасчета." + ТекЭлемент.Имя);
		КонецЦикла;
		Элементы.ТипПриемника.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	Элементы.СписокИсточника.Обновить();
	ОбновитьДанныеПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПриемникПоИсточнику()
	
	Если ЗначениеЗаполнено(ТипИсточника) Тогда
		НайденноеЗначение = Элементы.ТипПриемника.СписокВыбора.НайтиПоЗначению(ТипИсточника);
		Если НайденноеЗначение <> Неопределено Тогда
			ТипПриемника = НайденноеЗначение.Значение;
		КонецЕсли;
	Иначе
		ТипПриемника = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеИсточника()
	Если Не ЗначениеЗаполнено(ТипИсточника) Тогда
		СписокИсточника.ТекстЗапроса =
			"ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Ссылка,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК Наименование,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК Код,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
			|	ЛОЖЬ КАК ЭтоГруппа,
			|	НЕОПРЕДЕЛЕНО КАК ЗначениеПриемника,
			|	ЛОЖЬ КАК ЕстьСоответствие";
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипИсточника);
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка,
		|	//ПолеКод
		|	//ПолеНаименование
		|	//ПолеЭтоГруппа
		|	//ДопРеквизиты
		|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
		|	МАКСИМУМ(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника) КАК ЗначениеПриемника,
		|	НЕ СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника ЕСТЬ NULL КАК ЕстьСоответствие
		|ИЗ
		|	" + ТипИсточника + " КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
		|		ПО Таблица.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
		|			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &УзелИнформационнойБазы)
		|			И (СоответствияОбъектовИнформационныхБаз.ТипИсточника = &ТипИсточника)
		|			И (СоответствияОбъектовИнформационныхБаз.ТипПриемника = &ТипПриемника)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Ссылка,
		|	//ПолеКод
		|	//ПолеНаименование
		|	//ПолеЭтоГруппа
		|	//ДопРеквизиты
		|	Таблица.ПометкаУдаления,
		|	НЕ СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника ЕСТЬ NULL";
	
	Попытка
		СтРеквизит = ОбъектМетаданных.СтандартныеРеквизиты.Наименование;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПолеНаименование", "Таблица.Наименование,");
	Исключение
	КонецПопытки;	
	Попытка
		СтРеквизит = ОбъектМетаданных.СтандартныеРеквизиты.Код;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПолеКод", "Таблица.Код,");
	Исключение
	КонецПопытки;	
	Попытка
		СтРеквизит = ОбъектМетаданных.СтандартныеРеквизиты.ЭтоГруппа;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПолеЭтоГруппа", "Таблица.ЭтоГруппа,");
	Исключение
	КонецПопытки;
	
	ДопРеквизиты = ПолучитьМассивДопРеквизитов();
	ДопРеквизитыДляЗапроса = "";
	Для каждого ИмяРеквизита Из ДопРеквизиты Цикл
		ДопРеквизитыДляЗапроса = ДопРеквизитыДляЗапроса + "Таблица." + ИмяРеквизита + ", ";
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопРеквизиты", ДопРеквизитыДляЗапроса);
	
	СписокИсточника.ТекстЗапроса = ТекстЗапроса;
	СписокИсточника.ОсновнаяТаблица = ТипИсточника;
	СписокИсточника.ДинамическоеСчитываниеДанных = Истина;
	
	СписокИсточника.Параметры.УстановитьЗначениеПараметра("УзелИнформационнойБазы", УзелИнформационнойБазы);
	СписокИсточника.Параметры.УстановитьЗначениеПараметра("ТипИсточника", СтрЗаменить(ТипИсточника, ".", "Ссылка."));
	СписокИсточника.Параметры.УстановитьЗначениеПараметра("ТипПриемника", СтрЗаменить(ТипПриемника, ".", "Ссылка."));
	
	// Удалим добавленные колонки
	Для каждого ТекКолонка Из ДобавленныеКолонкиИсточника Цикл
		Элементы.Удалить(Элементы.Найти("СписокИсточника" + ТекКолонка.Значение));
	КонецЦикла;
	ДобавленныеКолонкиИсточника.Очистить();
	
	// Добавим колонки
	Для каждого ИмяРеквизита Из ДопРеквизиты Цикл
		НовЭлементы = Элементы.Добавить("СписокИсточника" + ИмяРеквизита, Тип("ПолеФормы"), Элементы.СписокИсточника);
		НовЭлементы.Вид = ВидПоляФормы.ПолеНадписи;
		НовЭлементы.ПутьКДанным = "СписокИсточника." + ИмяРеквизита;
		ДобавленныеКолонкиИсточника.Добавить(ИмяРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПриемника()
	
	СписокПриемника.Очистить();
	Если ЗначениеЗаполнено(ТипПриемника) Тогда
		
		ДопРеквизиты = ПолучитьМассивДопРеквизитов();
		
		// Удалим добавленные колонки
		УдаляемыеРеквизиты = Новый Массив;
		Для каждого ТекКолонка Из ДобавленныеКолонкиПриемника Цикл
			Элементы.Удалить(Элементы.Найти("СписокПриемника" + ТекКолонка.Значение));
			УдаляемыеРеквизиты.Добавить("СписокПриемника." + ТекКолонка.Значение);
		КонецЦикла;
		ДобавленныеКолонкиПриемника.Очистить();
		
		// Добавим колонки
		ДобавляемыеРеквизиты = Новый Массив;
		Для каждого ИмяРеквизита Из ДопРеквизиты Цикл
			РеквизитМД = Метаданные.НайтиПоПолномуИмени(ТипИсточника).Реквизиты.Найти(ИмяРеквизита);
			Если ОбщегоНазначения.ЭтоСсылка(РеквизитМД.Тип.Типы()[0]) Тогда
				ТипРеквизита = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
			Иначе
				ТипРеквизита = РеквизитМД.Тип;
			КонецЕсли;
			НовРеквизит = Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита, "СписокПриемника", РеквизитМД.Синоним);
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
		КонецЦикла;
		ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
		
		Для каждого ИмяРеквизита Из ДопРеквизиты Цикл
			НовЭлементы = Элементы.Добавить("СписокПриемника" + ИмяРеквизита, Тип("ПолеФормы"), Элементы.СписокПриемника);
			НовЭлементы.Вид = ВидПоляФормы.ПолеНадписи;
			НовЭлементы.ПутьКДанным = "СписокПриемника." + ИмяРеквизита;
			ДобавленныеКолонкиПриемника.Добавить(ИмяРеквизита);
		КонецЦикла;
		
		// Получение данных из базы-приемника
		ДанныеЗапроса = Новый Структура("ИмяПланаОбмена, КодУзлаКорреспондента, ТипИсточника, ТипПриемника, ДопРеквизиты",,,,, ДопРеквизиты);
		ЗаполнитьЗначенияСвойств(ДанныеЗапроса, ЭтаФорма);
		
		Если ОтборПоОрганизациям Тогда
			ДанныеЗапроса.Вставить("ОтборОрганизации", ПолучитьМассивТекущихОрганизаций());
		КонецЕсли;
		
		ДанныеОтвета = ЗапросКБазеПриемнику("getlist", ДанныеЗапроса);
		
		Если ДанныеОтвета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеОтвета.ОписаниеОшибки) Тогда
			Сообщить(ДанныеОтвета.ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		Для каждого ТекСтрока Из ДанныеОтвета.СписокОбъектов Цикл
			НоваяСтрока = СписокПриемника.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеНаСервере(ЗначениеИсточника, ЗначениеПриемника)
	
	// Прямая связь
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	СтруктураЗаписи.Вставить("УникальныйИдентификаторПриемника", ЗначениеПриемника);
	СтруктураЗаписи.Вставить("УникальныйИдентификаторИсточника", ЗначениеИсточника);
	СтруктураЗаписи.Вставить("ТипПриемника", СтрЗаменить(ТипПриемника, ".", "Ссылка."));
	СтруктураЗаписи.Вставить("ТипИсточника", СтрЗаменить(ТипИсточника, ".", "Ссылка."));
	//СтруктураЗаписи.Вставить("УникальныйИдентификаторИсточникаСтрокой", Строка(ЗначениеИсточника.УникальныйИдентификатор()));
	РегистрыСведений.СоответствияОбъектовИнформационныхБаз.ДобавитьЗапись(СтруктураЗаписи, Истина);
	
	// Обратная связь
	ДанныеЗапроса = Новый Структура("ИмяПланаОбмена, КодУзлаКорреспондента, ТипИсточника, ТипПриемника");
	ЗаполнитьЗначенияСвойств(ДанныеЗапроса, ЭтаФорма);
	ДанныеЗапроса.Вставить("ЗначениеИсточника", Строка(ЗначениеИсточника.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("ЗначениеПриемника", ЗначениеПриемника);
	
	ДанныеОтвета = ЗапросКБазеПриемнику("setlink", ДанныеЗапроса);
	
	Если ДанныеОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОтвета.ОписаниеОшибки) Тогда
		Сообщить(ДанныеОтвета.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьСоответствиеНаСервере(ЗначениеИсточника, ЗначениеПриемника)
	
	// Прямая связь
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	СтруктураЗаписи.Вставить("УникальныйИдентификаторПриемника", ЗначениеПриемника);
	СтруктураЗаписи.Вставить("УникальныйИдентификаторИсточника", ЗначениеИсточника);
	СтруктураЗаписи.Вставить("ТипПриемника", СтрЗаменить(ТипПриемника, ".", "Ссылка."));
	СтруктураЗаписи.Вставить("ТипИсточника", СтрЗаменить(ТипИсточника, ".", "Ссылка."));
	РегистрыСведений.СоответствияОбъектовИнформационныхБаз.УдалитьЗапись(СтруктураЗаписи, Истина);
	
	// Удалим соответствие в правой части
	НайденныеСтроки = СписокПриемника.НайтиСтроки(Новый Структура("Ссылка", ЗначениеПриемника));
	Для каждого ТекСтрока Из НайденныеСтроки Цикл
		ТекСтрока.ЕстьСоответствие = Ложь;
	КонецЦикла;
	
	// Обратная связь
	ДанныеЗапроса = Новый Структура("ИмяПланаОбмена, КодУзлаКорреспондента, ТипИсточника, ТипПриемника");
	ЗаполнитьЗначенияСвойств(ДанныеЗапроса, ЭтаФорма);
	ДанныеЗапроса.Вставить("ЗначениеИсточника", Строка(ЗначениеИсточника.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("ЗначениеПриемника", ЗначениеПриемника);
	
	ДанныеОтвета = ЗапросКБазеПриемнику("dellink", ДанныеЗапроса);
	
	Если ДанныеОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОтвета.ОписаниеОшибки) Тогда
		Сообщить(ДанныеОтвета.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьТаблицуРеквизитов()
	
	ТаблицаРеквизитов.Очистить();
	
	Если ЗначениеЗаполнено(ТипИсточника) Тогда
		НовСтрока = ТаблицаРеквизитов.Добавить();
		НовСтрока.ИмяРеквизита = "Код";
		НовСтрока.Предопределенный = Истина;
		НовСтрока = ТаблицаРеквизитов.Добавить();
		НовСтрока.ИмяРеквизита = "Наименование";
		НовСтрока.Предопределенный = Истина;
		НовСтрока = ТаблицаРеквизитов.Добавить();
		НовСтрока.ИмяРеквизита = "ЭтоГруппа";
		НовСтрока.Предопределенный = Истина;
	КонецЕсли;
	
	Элементы.СписокПриемникаОтменитьОтборПоРеквизиту.Доступность = Ложь;
	УстановитьОтборПриемникаПоСвойствамИсточника();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилищаТаблицыРеквизитов()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРеквизитов.Выгрузить());
	
КонецФункции

&НаСервере
Процедура ИзменитьНастройкиРеквизитов(АдресХранилищаТаблицыРеквизитов)
	
	ТаблицаРеквизитов.Загрузить(ПолучитьИзВременногоХранилища(АдресХранилищаТаблицыРеквизитов));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДопРеквизитов()
	
	Возврат ТаблицаРеквизитов.Выгрузить(Новый Структура("Предопределенный", Ложь)).ВыгрузитьКолонку("ИмяРеквизита");
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбновитьОтборПриемника()
	
	УстановитьОтборПриемникаПоСвойствамИсточника();
	ЭтаФорма.ТекущийЭлемент = Элементы.СписокИсточника;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПриемникаПоСвойствамИсточника()
	
	ТекущиеДанные = Элементы.СписокИсточника.ТекущиеДанные;
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("ОтборПоРеквизиту", Истина));
	Если ТекущиеДанные = Неопределено
			Или НайденныеСтроки.Количество() = 0 Тогда
		Элементы.СписокПриемника.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура();
	Для каждого ТекСтрока Из НайденныеСтроки Цикл
		СтруктураОтбора.Вставить(ТекСтрока.ИмяРеквизита, ТекущиеДанные[ТекСтрока.ИмяРеквизита]);
	КонецЦикла;
	
	Элементы.СписокПриемника.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	//ГруппаОтбора = СоздатьГруппуЭлементовОтбора(
	//	СписокПриемника1.Отбор.Элементы,
	//	"ОтборПоСвойствамИсточника",
	//	ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	//	
	//ИзменитьЭлементОтбораГруппыСписка(
	//	ГруппаОтбора,
	//	"ИНН",
	//	?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ИНН),
	//	ИспользованиеОтборов И ОтборПоИНН И НЕ ПустаяСтрока(ТекущиеДанные.ИНН), ВидСравненияКомпоновкиДанных.Равно);
	//	
	//ИзменитьЭлементОтбораГруппыСписка(
	//	ГруппаОтбора,
	//	"КПП",
	//	?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.КПП),
	//	ИспользованиеОтборов И ОтборПоКПП И НЕ ПустаяСтрока(ТекущиеДанные.КПП), ВидСравненияКомпоновкиДанных.Равно);
		
КонецПроцедуры





//////////////////////////////////////////////////////////////////////



&НаСервереБезКонтекста
Процедура ЗарегистрироватьОбъектыПоПравилуСервер(УзелИнформационнойБазы, ТипИсточника)
	
	//TODO:
	//ИБИсточник = Конвертация.ИБИсточник;
	//ИБПриемник = Конвертация.ИБПриемник;
	//
	//РеквизитыПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "ОбъектИсточник,ОбъектПриемник");
	//
	//ИмяСправочника = "";
	//РаботаСБазами.ПолучитьИмяСправочникаПоДаннымОбъекта(РаботаСБазами.ПолучитьДанныеОбъекта(РеквизитыПКО.ОбъектИсточник), ИмяСправочника);
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ИнформационнаяБаза", ИБИсточник);
	//Запрос.УстановитьПараметр("Объект", РеквизитыПКО.ОбъектИсточник);
	//Запрос.Текст = СтрЗаменить(
	//	"ВЫБРАТЬ
	//	|	ЗначенияОбъектовИБ.Ссылка
	//	|ИЗ
	//	|	Справочник.ЗначенияОбъектовИБ_Справочники КАК ЗначенияОбъектовИБ
	//	|ГДЕ
	//	|	ЗначенияОбъектовИБ.ИнформационнаяБаза = &ИнформационнаяБаза
	//	|	И ЗначенияОбъектовИБ.Объект = &Объект
	//	|	И НЕ ЗначенияОбъектовИБ.Удален
	//	|	И НЕ ЗначенияОбъектовИБ.ПометкаУдаления", "ЗначенияОбъектовИБ_Справочники", ИмяСправочника);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Запись = РегистрыСведений.РегистрацияКонвертацииОбъектов.СоздатьМенеджерЗаписи();
	//	Запись.ИБИсточник = ИБИсточник;
	//	Запись.ИБПриемник = ИБПриемник;
	//	Запись.ПравилоКонвертации = Правило;
	//	Запись.ОбъектИсточник = РеквизитыПКО.ОбъектИсточник;
	//	Запись.ОбъектПриемник = РеквизитыПКО.ОбъектПриемник;
	//	Запись.ЗначениеОбъекта = Выборка.Ссылка;
	//	Запись.Дата = ТекущаяДата();
	//	Запись.Записать();
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьПоПравилуНаСервере()
	
	//todo:
	//РеквизитыКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "ИБИсточник,ИБПриемник");
	//РеквизитыПКО         = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКОИсточника, "ОбъектИсточник,ОбъектПриемник");
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("ИБИсточник",     РеквизитыКонвертации.ИБИсточник);
	//Запрос.УстановитьПараметр("ИБПриемник",     РеквизитыКонвертации.ИБПриемник);
	//
	//Запрос.УстановитьПараметр("ОбъектИсточник", РеквизитыПКО.ОбъектИсточник);
	//Запрос.УстановитьПараметр("ОбъектПриемник", РеквизитыПКО.ОбъектПриемник);
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СоответствияСсылок.ЗначениеОбъекта КАК ЗначениеИсточника
	//|ПОМЕСТИТЬ ВТ_СуществующиеСвязи
	//|ИЗ
	//|	Справочник.СоответствияСсылокРазныхИБ.Соответсвия КАК СоответствияСсылокТЧ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоответствияСсылокРазныхИБ КАК СоответствияСсылок
	//|		ПО СоответствияСсылокТЧ.Ссылка = СоответствияСсылок.Ссылка
	//|ГДЕ
	//|	НЕ СоответствияСсылок.ПометкаУдаления
	//|	И СоответствияСсылок.ИБИсточник = &ИБИсточник
	//|	И СоответствияСсылокТЧ.ИБПриемник = &ИБПриемник
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЗначениеИсточника
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗначенияОбъектовИБ_Справочники.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.ЗначенияОбъектовИБ_Справочники КАК ЗначенияОбъектовИБ_Справочники
	//|ГДЕ
	//|	ЗначенияОбъектовИБ_Справочники.ИнформационнаяБаза = &ИБИсточник
	//|	И ЗначенияОбъектовИБ_Справочники.Объект = &ОбъектИсточник
	//|	И НЕ ЗначенияОбъектовИБ_Справочники.Ссылка В
	//|				(ВЫБРАТЬ
	//|					ВТ_СуществующиеСвязи.ЗначениеИсточника КАК ЗначениеИсточника
	//|				ИЗ
	//|					ВТ_СуществующиеСвязи КАК ВТ_СуществующиеСвязи)";
	//
	//Индекс = 0;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Индекс = Индекс + 1;
	//	
	//	// Попытаемся найти соответствующий элемент.
	//	
	//	Отказ = Ложь;
	//	
	//	ДопПараметры = Новый Структура("НеКовертироватьТолькоПоиск");
	//	
	//	КонвертацияОбъектов.ЗаполнитьДопПараметрыКонвертации(
	//		ДопПараметры, 
	//		РеквизитыКонвертации.ИБИсточник, 
	//		Выборка.Ссылка, 
	//		ПКОИсточника
	//	);
	//	
	//	СтруктураИсточника = КонвертацияОбъектов.ПолучитьСтруктуруИсточника(
	//		РеквизитыКонвертации.ИБИсточник, 
	//		Выборка.Ссылка, 
	//		РеквизитыПКО.ОбъектИсточник
	//	);
	//	
	//	ЗначениеПриемника = КонвертацияОбъектов.ПолучитьЗначениеИБПриемника(
	//		РеквизитыКонвертации.ИБИсточник, 
	//		РеквизитыПКО.ОбъектИсточник, 
	//		СтруктураИсточника, 
	//		Выборка.Ссылка, 
	//		РеквизитыКонвертации.ИБПриемник, 
	//		РеквизитыПКО.ОбъектПриемник, 
	//		ПКОИсточника, 
	//		ДопПараметры, 
	//		Отказ
	//	);
	//	
	//	//Если Индекс > 100 Тогда
	//	//	Прервать;
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСписками

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено)
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля)
	
	УдалитьЭлементОтбораКоллекции(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, ИмяПоля);
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	УстановитьЭлементОтбораКоллекции(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, ИмяПоля, ПравоеЗначение, ВидСравнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
Функция СоздатьГруппуЭлементовОтбора(КоллекцияЭлементов, Представление, ТипГруппы)
	
	ГруппаЭлементовОтбора = НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление);
	Если ГруппаЭлементовОтбора = Неопределено Тогда
		ГруппаЭлементовОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Иначе
		ГруппаЭлементовОтбора.Элементы.Очистить();
	КонецЕсли;
	
	ГруппаЭлементовОтбора.Представление    = Представление;
	ГруппаЭлементовОтбора.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	ГруппаЭлементовОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаЭлементовОтбора.ТипГруппы        = ТипГруппы;
	ГруппаЭлементовОтбора.Использование    = Истина;
	
	Возврат ГруппаЭлементовОтбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление)
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ЭлементОтбора.Представление = Представление Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЭлементОтбораГруппыСписка(Группа, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено)
	
	УдалитьЭлементОтбораКоллекции(Группа.Элементы, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораКоллекции(Группа.Элементы, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОбратнойКонвертации()
	
	//TODO:
	//РеквизитыПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКОИсточника, "ОбъектИсточник,ОбъектПриемник");
	//
	//СтруктураОбратнойКонвертации = КонвертацияОбъектов.ПолучитьДанныеОбратнойКонвертации(
	//	Конвертация, 
	//	РеквизитыПКО.ОбъектИсточник, 
	//	РеквизитыПКО.ОбъектПриемник
	//);
	//
	//ОбратнаяКонвертация = СтруктураОбратнойКонвертации.ОбратнаяКонвертация;
	//ПКОПриемника        = СтруктураОбратнойКонвертации.ОбратноеПКО;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивТекущихОрганизаций()
	
	МассивОрганизаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОрганизаций.Добавить(Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Возврат МассивОрганизаций;
	
КонецФункции

#КонецОбласти

#Область ПодключениеКБазеПриемник

&НаСервере
Функция ЗапросКБазеПриемнику(ИмяКоманды, ДанныеЗапроса)
	
	Если Не ЗначениеЗаполнено(WSИмяСервера) Тогда
		ТекстСообщения = "Не определены настройки подключения к веб-сервису";
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль);
	Исключение
		ТекстСообщения = "Ошибка получения http соединения с базой. Причина: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
	
	Запрос = Новый HTTPЗапрос(ПутьНаСервере + ИмяКоманды, Заголовки);
	Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Попытка
			ДанныеОтвета = unJSON(ТекстОтвета);
		Исключение
			ТекстСообщения = "Ошибка получения структуры из json. Причина: " + ОписаниеОшибки();
			Сообщить(ТекстСообщения);
			Возврат Неопределено;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ДанныеОтвета.ОписаниеОшибки) Тогда
			Сообщить(ДанныеОтвета.ОписаниеОшибки);
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат ДанныеОтвета;
		
	Иначе
		ТекстСообщения = "Не удалось выполнить запрос веб-сервиса. Код ответа: " + Ответ.КодСостояния;
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	WSИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		WSИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	WSПароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		WSПароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = WSИмяСервера;
	Порт = "";
	Позиция = Найти(WSИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(WSИмяСервера, Позиция - 1);
		Порт = Сред(WSИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", WSПароль);
	Результат.Вставить("ИмяСервера", WSИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область JSON

Функция unJSON(JSONСтрока) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция JSON(Данные, СОтступами = Истина) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяВыгрузки()
	Объ = РеквизитФормыВЗначение("Объект");
	Имя = Объ.ИспользуемоеИмяФайла;
	Файл = Новый Файл(Имя);
	Имя = Файл.Путь + Файл.ИмяБезРасширения + ".Данные";
	Возврат Имя;
КонецФункции

&НаСервере
Функция ПриемникВСтроку()
	Возврат ЗначениеВСтрокуВнутр(РеквизитФормыВЗначение("СписокПриемника"));
КонецФункции

&НаКлиенте
Процедура ОтладкаВыгрузить(Команда)
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(ПриемникВСтроку());
	Текст.Записать(ПолучитьИмяВыгрузки());
КонецПроцедуры

&НаСервере
Функция СтрокаВПриемник(Стр)
	ЗначениеВРеквизитФормы(ЗначениеИзСтрокиВнутр(Стр), "СписокПриемника");
КонецФункции

&НаКлиенте
Процедура ОтладкаЗагрузить(Команда)
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ПолучитьИмяВыгрузки());
	СтрокаВПриемник(Текст.ПолучитьТекст());
КонецПроцедуры

&НаСервере
Функция СопоставитьНаСервере()
	мСоответствия = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Приемник.Ссылка КАК Ссылка,
						  //|	Приемник.Код КАК Код,
						  //|	Приемник.Наименование КАК Наименование,
	                      //|	Приемник.ЭтоГруппа КАК ЭтоГруппа,
	                      |	Приемник.ЕстьСоответствие КАК ЕстьСоответствие
	                      |ПОМЕСТИТЬ втПриемник
	                      |ИЗ
	                      |	&Приемник КАК Приемник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаИБ.Ссылка КАК Ссылка,
						  //|	ТаблицаИБ.Код КАК Код,
						  //|	ТаблицаИБ.Наименование КАК Наименование,
	                      //|	ТаблицаИБ.ЭтоГруппа КАК ЭтоГруппа,
	                      |	втПриемник.Ссылка КАК ПриемникСсылка
						  //|	втПриемник.Код КАК ПриемникКод,
						  //|	втПриемник.Наименование КАК ПриемникНаименование,
	                      //|	втПриемник.ЭтоГруппа КАК ПриемникЭтоГруппа
	                      |ИЗ
	                      |	втПриемник КАК втПриемник
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсходнаяТаблица КАК ТаблицаИБ
	                      |		ПО (НЕ втПриемник.ЕстьСоответствие)
	                      |			И (&Условие)");
						  
	СтрРеквизиты = "";
	
	ЭтоСправочник = Лев(ТипИсточника, 11) = "Справочник.";
	ЭтоПВР = Лев(ТипИсточника, 17) = "ПланВидовРасчета.";
	ЭтоПС = Лев(ТипИсточника, 11) = "ПланСчетов.";
	
	Если ЭтоСправочник Тогда
		МД = Метаданные.Справочники[СтрЗаменить(ТипИсточника, "Справочник.", "")];
	КонецЕсли;
	Если ЭтоПВР Тогда
		МД = Метаданные.ПланыВидовРасчета[СтрЗаменить(ТипИсточника, "ПланВидовРасчета.", "")];
	КонецЕсли;
	Если ЭтоПС Тогда
		МД = Метаданные.ПланыСчетов[СтрЗаменить(ТипИсточника, "ПланСчетов.", "")];
	КонецЕсли;
	
	Если ЭтоСправочник Или ЭтоПВР Или ЭтоПС Тогда
		Если МД.ДлинаКода > 0 Тогда
			СтрРеквизиты = СтрРеквизиты + ?(СтрРеквизиты <> "", ",", "") + "Код";
		КонецЕсли;
		Если МД.ДлинаНаименования > 0 Тогда
			СтрРеквизиты = СтрРеквизиты + ?(СтрРеквизиты <> "", ",", "") + "Наименование";
		КонецЕсли;
	КонецЕсли;
	Если ЭтоСправочник Тогда
		Если МД.Иерархический Тогда
			СтрРеквизиты = СтрРеквизиты + ?(СтрРеквизиты <> "", ",", "") + "ЭтоГруппа";
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Табл Из СтрРазделить("Приемник,ТаблицаИБ,втПриемник", ",", Ложь) Цикл
		Для Каждого Рекв Из СтрРазделить(СтрРеквизиты, ",", Ложь) Цикл
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				Табл + ".Ссылка КАК " + ?(Табл = "втПриемник", "Приемник", "") + "Ссылка",
				Табл + ".Ссылка КАК " + ?(Табл = "втПриемник", "Приемник", "") + "Ссылка, "
				+ Табл + "." + Рекв + " КАК " + ?(Табл = "втПриемник", "Приемник", "") + Рекв
			);
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "втИсходнаяТаблица", ТипИсточника);
	
	Условие = "";
	Реквизиты = "";
	Для Каждого Рекв Из РеквизитФормыВЗначение("ТаблицаРеквизитов") Цикл
		Если Не Рекв.ОтборПоРеквизиту Тогда
			Продолжить;
		КонецЕсли;
		
		Условие = Условие
			+ ?(Условие <> "", " И ", "")
			+ "втПриемник." + Рекв.ИмяРеквизита + " <> """"" + Символы.ПС
			+ "И втПриемник." + Рекв.ИмяРеквизита + " = ТаблицаИБ." + Рекв.ИмяРеквизита + Символы.ПС
		;
		
		Если Рекв.ИмяРеквизита <> "Код" И Рекв.ИмяРеквизита <> "Наименование" Тогда
			Реквизиты = Реквизиты
				+ ","
				+ Символы.ПС + " Приемник." + Рекв.ИмяРеквизита
			;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Приемник.ЕстьСоответствие КАК ЕстьСоответствие", "Приемник.ЕстьСоответствие КАК ЕстьСоответствие" + Реквизиты);
	
	ЕстьГруппы = Лев(ТипИсточника, 11) = "Справочник."
		И Метаданные.Справочники[СтрЗаменить(ТипИсточника, "Справочник.", "")].Иерархический;
	Если Не ЕстьГруппы Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "	Приемник.ЭтоГруппа", "	Ложь");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ТаблицаИБ.ЭтоГруппа", "	Ложь");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Приемник", РеквизитФормыВЗначение("СписокПриемника"));
//	Запрос.УстановитьПараметр("ЕстьГруппы", ЕстьГруппы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекСтр = Новый Структура;
		Для Каждого Рекв Из СтрРазделить("Ссылка," + СтрРеквизиты, ",", Ложь) Цикл
			Для Каждого ИстПри Из СтрРазделить("Источник,Приемник", ",", Ложь) Цикл
				ТекСтр.Вставить(ИстПри + Рекв, Выборка[?(ИстПри = "Источник", "", ИстПри) + Рекв]);
			КонецЦикла;
		КонецЦикла;
		мСоответствия.Добавить(ТекСтр);
	КонецЦикла;
	
	Возврат мСоответствия;
КонецФункции

&НаКлиенте
Функция ПриведенноеИмяКонтрагента(Знач Стр)
	Стр = Врег(Стр);
	
	Стр = СтрЗаменить(Стр, "ФГУП", "");
	Стр = СтрЗаменить(Стр, "ООО", "");
	Стр = СтрЗаменить(Стр, "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ", "");
	Стр = СтрЗаменить(Стр, "ОАО", "");
	Стр = СтрЗаменить(Стр, "ОТКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО", "");
	Стр = СтрЗаменить(Стр, "ЗАО", "");
	Стр = СтрЗаменить(Стр, "ЗАКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО", "");
	Стр = СтрЗаменить(Стр, "ПАО", "");
	Стр = СтрЗаменить(Стр, "АО", "");
	Стр = СтрЗаменить(Стр, """", "");
	Стр = СтрЗаменить(Стр, "«", "");
	Стр = СтрЗаменить(Стр, "»", "");
	Стр = СтрЗаменить(Стр, " - ", "-");
	Стр = СтрЗаменить(Стр, "  ", " ");
	Стр = СокрЛП(Стр);
	
	Возврат Стр;
КонецФункции

&НаКлиенте
Процедура Сопоставить(Команда)
	Список = СопоставитьНаСервере();
	
	Сч = 0; КолВо = Список.Количество();
	Для Каждого Стр Из Список Цикл
		Сч = Сч + 1;
		Состояние("" + Стр.ИсточникНаименование + " => " + Стр.ПриемникНаименование, Сч / Колво * 100, "Прогресс сопоставления");
		ОбработкаПрерыванияПользователя();
		
		КонтрагентСравним = Ложь;
		Если Не СопоставитьБезВопроса И СопоставитьБезВопросаДляКонтрагентов Тогда
//			Сообщить("" + ПриведенноеИмяКонтрагента(Стр.ИсточникНаименование) + " => " + ПриведенноеИмяКонтрагента(Стр.ПриемникНаименование));
			КонтрагентСравним = ПриведенноеИмяКонтрагента(Стр.ИсточникНаименование) = ПриведенноеИмяКонтрагента(Стр.ПриемникНаименование);
		КонецЕсли;
		
		Если СопоставитьБезВопроса Тогда
			Ответ = КодВозвратаДиалога.Да;
		ИначеЕсли КонтрагентСравним Тогда
			Ответ = КодВозвратаДиалога.Да;
		Иначе
			Ответ = Вопрос(""
					+ "Сопоставить элементы (" + Сч + " / " + Колво + "):" + Символы.ПС
					//+ Стр.ИсточникКод + " "
					+ Стр.ИсточникНаименование + Символы.ПС
					//+ Стр.ПриемникКод + " "
					+ Стр.ПриемникНаименование + Символы.ПС
				, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Нет
			);
		КонецЕсли;
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Продолжить;
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Прервать;
		КонецЕсли;
		
		
		УстановитьСоответствиеНаСервере(Стр.ИсточникСсылка, Стр.ПриемникСсылка);
		
		СписокПриемника.НайтиСтроки(Новый Структура("Ссылка", Стр.ПриемникСсылка))[0].ЕстьСоответствие = Истина;
		
	КонецЦикла;

	Элементы.СписокИсточника.Обновить();
КонецПроцедуры

#КонецОбласти
