
&НаСервере
Функция СкопироватьНаСервере()
	
	НовЭл = Справочники.Организации.СоздатьЭлемент();
	НовЭл.ОбменДанными.Загрузка = Истина;
	ЗаполнитьЗначенияСвойств(НовЭл, Объект.Организация,,"Код,Родитель,Владелец");
	
	Для Каждого ТЧ Из Объект.Организация.Метаданные().ТабличныеЧасти Цикл
		НовЭл[ТЧ.Имя].Загрузить(Объект.Организация[ТЧ.Имя].Выгрузить());
	КонецЦикла;
	
	НовЭл.УстановитьНовыйКод();
	
	СтарЭл = Объект.Организация.ПолучитьОбъект();
	СтарЭл.ОбменДанными.Загрузка = Истина;
	СтарЭл.ПометкаУдаления = Истина;
	
	НачатьТранзакцию();
	Попытка
		НовЭл.Записать();
		СтарЭл.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Объект.Организация = НовЭл.Ссылка;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Скопировать(Команда)
	
	Если Объект.Организация.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если СкопироватьНаСервере() Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Организация);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПоGUIDНаСервере()
	
	Если Объект.Организация.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(Объект.GUID);
	Ссылка = Справочники.Организации.ПолучитьСсылку(Идентификатор);
	НовОбъект = Ссылка.ПолучитьОбъект();
	Если НовОбъект = Неопределено Тогда
		НовОбъект = Справочники.Организации.СоздатьЭлемент();
		НовОбъект.УстановитьСсылкуНового(Ссылка);
		НовОбъект.УстановитьНовыйКод();
		НовОбъект.ОбменДанными.Загрузка = Истина;
		
		ЗаполнитьЗначенияСвойств(НовОбъект, Объект.Организация,,"Код,Родитель,Владелец");
		НовОбъект.УстановитьНовыйКод();
		
		Для Каждого ТЧ Из Объект.Организация.Метаданные().ТабличныеЧасти Цикл
			НовОбъект[ТЧ.Имя].Загрузить(Объект.Организация[ТЧ.Имя].Выгрузить());
		КонецЦикла;
		
		СтарЭл = Объект.Организация.ПолучитьОбъект();
		СтарЭл.ОбменДанными.Загрузка = Истина;
		СтарЭл.ПометкаУдаления = Истина;
		
		НачатьТранзакцию();
		Попытка
			НовОбъект.Записать();
			СтарЭл.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		Объект.Организация = НовОбъект.Ссылка;
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Найден объект с таким GUID");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПоGUID(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.GUID) Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьПоGUIDНаСервере() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СкопироватьПодрНаСервере()
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажи организацию (владелец).'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Подразделение.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовЭл = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
	НовЭл.ОбменДанными.Загрузка = Истина;
	ЗаполнитьЗначенияСвойств(НовЭл, Объект.Подразделение, , "Код,Родитель,Владелец");
	НовЭл.Владелец = Объект.Организация;
	
	Для Каждого ТЧ Из Объект.Подразделение.Метаданные().ТабличныеЧасти Цикл
		НовЭл[ТЧ.Имя].Загрузить(Объект.Подразделение[ТЧ.Имя].Выгрузить());
	КонецЦикла;
	
	НовЭл.УстановитьНовыйКод();
	
	СтарЭл = Объект.Подразделение.ПолучитьОбъект();
	СтарЭл.ОбменДанными.Загрузка = Истина;
	СтарЭл.ПометкаУдаления = Истина;
	
	НачатьТранзакцию();
	Попытка
		НовЭл.Записать();
		СтарЭл.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Объект.Подразделение = НовЭл.Ссылка;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СкопироватьПодр(Команда)
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажи организацию (владелец).'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.Подразделение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если СкопироватьПодрНаСервере() Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Подразделение);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьПоGUIDПодрНаСервере()
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажи организацию.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Подразделение.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажи подразделение.");
		Возврат Ложь;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(Объект.GUIDПодр);
	Ссылка = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Идентификатор);
	НовОбъект = Ссылка.ПолучитьОбъект();
	Если НовОбъект = Неопределено Тогда
		НовОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
		НовОбъект.УстановитьСсылкуНового(Ссылка);
		НовОбъект.ОбменДанными.Загрузка = Истина;
		
		ЗаполнитьЗначенияСвойств(НовОбъект, Объект.Подразделение, , "Код,Родитель,Владелец");
		НовОбъект.Владелец = Объект.Организация;
		НовОбъект.УстановитьНовыйКод();
		
		Для Каждого ТЧ Из Объект.Подразделение.Метаданные().ТабличныеЧасти Цикл
			НовОбъект[ТЧ.Имя].Загрузить(Объект.Подразделение[ТЧ.Имя].Выгрузить());
		КонецЦикла;
		
		СтарЭл = Объект.Подразделение.ПолучитьОбъект();
		СтарЭл.ОбменДанными.Загрузка = Истина;
		СтарЭл.ПометкаУдаления = Истина;
		
		НачатьТранзакцию();
		Попытка
			НовОбъект.Записать();
			СтарЭл.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		Объект.Подразделение = НовОбъект.Ссылка;
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Найден объект с таким GUID");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПоGUIDПодр(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.GUIDПодр) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажи организацию (Владелец)");
		Возврат;
	КонецЕсли;
	
	Если Объект.Подразделение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьПоGUIDПодрНаСервере() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНесколькоОрганизаций(Команда)
	
	Если СброситьНесколькоОрганизацийНаСервере() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Константа ""Использовать несколько организаций"" сброшена в Ложь.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СброситьНесколькоОрганизацийНаСервере()
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Ложь);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СкопироватьНомГруппуНаСервере()
	
	Если Объект.НомГруппа.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.НомГруппа.ЭтоГруппа Тогда
		НовЭл = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
	Иначе
		НовЭл = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
	КонецЕсли;
	
	НовЭл.ОбменДанными.Загрузка = Истина;
	ЗаполнитьЗначенияСвойств(НовЭл, Объект.НомГруппа, , "Код,Родитель,Владелец");
	
	Если Не Объект.НомГруппа.ЭтоГруппа Тогда
		Для Каждого ТЧ Из Объект.НомГруппа.Метаданные().ТабличныеЧасти Цикл
			НовЭл[ТЧ.Имя].Загрузить(Объект.НомГруппа[ТЧ.Имя].Выгрузить());
		КонецЦикла;
	КонецЕсли;
	
	НовЭл.УстановитьНовыйКод();
	
	СтарЭл = Объект.НомГруппа.ПолучитьОбъект();
	СтарЭл.ОбменДанными.Загрузка = Истина;
	СтарЭл.ПометкаУдаления = Истина;
	
	НачатьТранзакцию();
	Попытка
		НовЭл.Записать();
		СтарЭл.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Объект.НомГруппа = НовЭл.Ссылка;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СкопироватьНомГруппу(Команда)
	
	Если Объект.НомГруппа.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если СкопироватьНомГруппуНаСервере() Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.НомГруппа);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПоGUIDНомГруппуНаСервере()
	
	Если Объект.НомГруппа.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажи номенклатурную группу.'"));
		Возврат Ложь;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(Объект.GUIDНомГруппы);
	Ссылка = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Идентификатор);
	НовОбъект = Ссылка.ПолучитьОбъект();
	Если НовОбъект = Неопределено Тогда
		
		Если Объект.НомГруппа.ЭтоГруппа Тогда
			НовОбъект = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
		Иначе
			НовОбъект = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		КонецЕсли;
		
		НовОбъект.УстановитьСсылкуНового(Ссылка);
		НовОбъект.ОбменДанными.Загрузка = Истина;
		
		ЗаполнитьЗначенияСвойств(НовОбъект, Объект.НомГруппа, , "Код,Родитель,Владелец");
		НовОбъект.УстановитьНовыйКод();
		
		Если Не Объект.НомГруппа.ЭтоГруппа Тогда
			Для Каждого ТЧ Из Объект.НомГруппа.Метаданные().ТабличныеЧасти Цикл
				НовОбъект[ТЧ.Имя].Загрузить(Объект.НомГруппа[ТЧ.Имя].Выгрузить());
			КонецЦикла;
		КонецЕсли;
		
		СтарЭл = Объект.НомГруппа.ПолучитьОбъект();
		СтарЭл.ОбменДанными.Загрузка = Истина;
		СтарЭл.ПометкаУдаления = Истина;
		
		НачатьТранзакцию();
		Попытка
			НовОбъект.Записать();
			СтарЭл.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		Объект.НомГруппа = НовОбъект.Ссылка;
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Найден объект с таким GUID");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПоGUIDНомГруппу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.GUIDНомГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.НомГруппа.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьПоGUIDНомГруппуНаСервере() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Завершено.");
	КонецЕсли;
	
КонецПроцедуры
