#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбменДаннымиСервер.ФормаУзлаПриСозданииНаСервере(ЭтотОбъект, Отказ);
	УстановитьОформлениеУзлаНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	УстановитьОформлениеУзлаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементамФормы();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		Оповестить("Запись_УзелПланаОбмена");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)

	УстановитьДоступностьЭлементамФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементамФормы()

	Элементы.Организации.Доступность = Объект.ИспользоватьОтборПоОрганизациям;

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеУзлаНаСервере()

	ЭтоЭтотУзел = Объект.ЭтотУзел;
	Если Элементы.Найти("ПояснениеЭтотУзел") <> Неопределено Тогда
		Элементы.ПояснениеЭтотУзел.Видимость = ЭтоЭтотУзел;
	КонецЕсли;
	Если Элементы.Найти("ПояснениеКорреспондент") <> Неопределено Тогда
		Элементы.ПояснениеКорреспондент.Видимость = Не ЭтоЭтотУзел;
	КонецЕсли;
	Если Элементы.Найти("ГруппаОграниченияРегистрации") <> Неопределено Тогда
		Элементы.ГруппаОграниченияРегистрации.Видимость = Не ЭтоЭтотУзел;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
